{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama Legislature to begin 2026 session; Ivey to deliver final State of the State address",
      "link": "https://alabamareflector.com/2026/01/13/alabama-legislature-to-begin-2026-session/",
      "thumbnail": "",
      "description": "Alabama Gov. Kay Ivey delivers the State of the State address in the Old House Chamber at the Alabama State Capitol on Feb. 4, 2025 in Montgomery, Alabama. Ivey will deliver her ninth and final address on Tuesday, kickin..."
    },
    {
      "title": "A voter’s guide to the House District 63 special election in Tuscaloosa County",
      "link": "https://alabamareflector.com/2026/01/13/a-voters-guide-to-the-house-district-63-special-election-in-tuscaloosa-county/",
      "thumbnail": "",
      "description": "Republican Tuscaloosa City Councilman Norman Crow, (left), and Tuscaloosa Democratic Party Chair Judith Taylor (right) will compete in Tuesday's House District 63 special election. (Photos courtesy of candidates, graphic..."
    },
    {
      "title": "Democrats clash with Noem over new limits on oversight visits to immigration facilities",
      "link": "https://alabamareflector.com/2026/01/12/repub/democrats-clash-with-noem-over-new-limits-on-oversight-visits-to-immigration-facilities/",
      "thumbnail": "",
      "description": "U.S. Rep. Ilhan Omar, D-Minn., left, and Rep. Angie Craig, D-Minn., arrive at the regional ICE headquarters at the Bishop Henry Whipple Federal Building on Jan. 10, 2026 in Minneapolis, Minnesota. The lawmakers attempted..."
    },
    {
      "title": "Arizona US Sen. Mark Kelly sues Hegseth over penalties for ‘illegal orders’ video",
      "link": "https://alabamareflector.com/2026/01/12/repub/arizona-us-sen-mark-kelly-sues-hegseth-over-penalties-for-illegal-orders-video/",
      "thumbnail": "",
      "description": "Arizona Democratic Sen. Mark Kelly speaks with reporters in the Mansfield Room of the U.S. Capitol building in Washington, D.C., on Monday, Dec. 1, 2025. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — Arizona Demo..."
    },
    {
      "title": "Sports stadium deals hand even more taxpayer money to billionaires",
      "link": "https://alabamareflector.com/2026/01/12/repub/sports-stadium-deals-hand-ever-more-taxpayer-money-to-billionaires/",
      "thumbnail": "",
      "description": "Kansas Gov. Laura Kelly, a Democrat, holds a Kansas City Chiefs jersey with team owner Clark Hunt ahead of a news conference last month in Topeka, Kan., announcing the team would build a new $3 billion stadium in the sta..."
    },
    {
      "title": "US Senate Republicans defend independence of the Fed after DOJ launches Powell probe",
      "link": "https://alabamareflector.com/2026/01/12/repub/us-senate-republicans-defend-independence-of-the-fed-after-doj-launches-powell-probe/",
      "thumbnail": "",
      "description": "Federal Reserve Chair Jerome Powell speaks during a press conference following the Federal Open Markets Committee meeting at the Federal Reserve on Dec. 10, 2025 in Washington, D.C. &nbsp;(Photo by Chip Somodevilla/Getty..."
    },
    {
      "title": "More than 100 people attend Montgomery vigil for woman shot by ICE",
      "link": "https://alabamareflector.com/briefs/more-than-100-people-attend-montgomery-vigil-for-woman-shot-by-ice/",
      "thumbnail": "",
      "description": "People hold signs criticizing ICE during a vigil held on Jan. 11, 2026 in Montgomery, Alabama for Renee Nicole Good. Good was shot and killed by an ICE agent in Minneapolis on Jan. 7. (Ralph Chapoco/Alabama Reflector)Civ..."
    },
    {
      "title": "Alabama Legislature 2026 preview: Let’s get this over with",
      "link": "https://alabamareflector.com/2026/01/12/alabama-legislature-2026-preview-lets-get-this-over-with/",
      "thumbnail": "",
      "description": "The Alabama House of Representatives as seen on Feb. 25, 2025. The Alabama Legislature begins its 2026 legislative session on Tuesday, with many lawmakers expecting to focus on the budgets and eschew larger issues. (Stew..."
    },
    {
      "title": "The legacy of a departing Alabama Legislature",
      "link": "https://alabamareflector.com/2026/01/12/the-legacy-of-a-departing-alabama-legislature/",
      "thumbnail": "",
      "description": "Reps. Mark Gidley, R-Hokes Bluff (left) and Tracey Estes, R-Winfield, speak in the chamber of the Alabama House of Representatives on Feb. 4, 2025 in Montgomery, Alabama. The 2026 regular session of the Alabama Legislatu..."
    },
    {
      "title": "Tuscaloosa voters to choose new representative in House District 63 special election",
      "link": "https://alabamareflector.com/2026/01/12/tuscaloosa-voters-to-choose-new-representative-in-house-district-63-special-election/",
      "thumbnail": "",
      "description": "Tuscaloosa voters will choose Republican Tuscaloosa City Councilman Norman Crow (left) or Tuscaloosa Democratic Party Chair Judith Taylor (right) as their next representative in a special election for House District 63 o..."
    }
  ],
  "lastUpdated": "2026-01-13T15:47:35.294Z"
}