{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "‘Confused, angry:’ APLS revokes Fairhope Public Library’s remaining 2025 state funds amid dispute",
      "link": "https://alabamareflector.com/2025/11/17/confused-angry-apls-revokes-fairhope-public-librarys-2025-state-aid-amid-book-dispute/",
      "thumbnail": "",
      "description": "Fairhope Public Library Board Chair Randal Wright reads a prepared statement before the Alabama Public Library Service on Thursday, September 18, 2025. APLS said the Fairhope Public Library has forfeited state money susp..."
    },
    {
      "title": "Alabama can never spend enough money on a prison",
      "link": "https://alabamareflector.com/2025/11/17/alabama-can-never-spend-enough-money-on-a-prison/",
      "thumbnail": "",
      "description": "The American flag flying at Holman Correctional Facility on Oct. 22, 2019. A state senator last week said the price tag on a new men's prison in Elmore County had grown to $1.2 billion, eating up nearly all the money the..."
    },
    {
      "title": "Obesity requires comprehensive care, specialist tells Alabama task force",
      "link": "https://alabamareflector.com/2025/11/17/obesity-requires-comprehensive-care-specialist-tells-alabama-task-force/",
      "thumbnail": "",
      "description": "Katherine Saunders, a physician specializing in obesity, speaking to the Chronic Weight Management and Type 2 Diabetes Task Force on Nov. 13, 2025, in the Alabama State House in Montgomery, Alabama. She tole the task for..."
    },
    {
      "title": "New obstacles for proposed Bessemer data center: the Northern Beltline and a fish",
      "link": "https://alabamareflector.com/2025/11/16/new-obstacles-for-proposed-bessemer-data-center-the-northern-beltline-and-a-fish/",
      "thumbnail": "",
      "description": "A specimen of the Birmingham darter documented by Yale biologist Thomas Near and his research team. A biologist says a proposed data center for Bessemer could put the fish at risk of extinction. (Courtesy Konstantinos An..."
    },
    {
      "title": "Accreditation of colleges, once low key, has gotten political",
      "link": "https://alabamareflector.com/2025/11/15/repub/accreditation-of-colleges-once-low-key-has-gotten-political/",
      "thumbnail": "",
      "description": "Soon-to-be graduates pose for a photo at the University of North Carolina on May 1, 2024, in Chapel Hill, N.C. The University of North Carolina is one of six Southern public university systems that formed a new accredita..."
    },
    {
      "title": "Attorneys for AHSAA say Ivey, Ledbetter have no standing in CHOOSE Act lawsuit",
      "link": "https://alabamareflector.com/2025/11/14/attorneys-for-ahsaa-say-ivey-ledbetter-have-no-standing-in-choose-act-lawsuit/",
      "thumbnail": "",
      "description": "Alabama House Speaker Nathaniel Ledbetter, R-Rainsville, speaks at a press conference promoting a package of law enforcement bills at the Alabama State Capitol on Feb. 12, 2025 in Montgomery, Alabama. Alabama Gov. Kay Iv..."
    },
    {
      "title": "Shutdown ends, but more federal chaos looms for states",
      "link": "https://alabamareflector.com/2025/11/14/repub/shutdown-ends-but-more-federal-chaos-looms-for-states/",
      "thumbnail": "",
      "description": "Maryland Democratic Gov. Wes Moore spent a few minutes sorting donated food before signing an executive order in late October declaring a state of emergency to allow for distribution of food aid. As the federal governmen..."
    },
    {
      "title": "Alabama State Board of Education OKs hiring changes for nutrition program directors",
      "link": "https://alabamareflector.com/briefs/alabama-state-board-of-education-approves-changes-for-hiring-child-nutrition-program-directors/",
      "thumbnail": "",
      "description": "Left to right: Jackie Zeigler, Tracie West, Kelly Mooney, Eric Mackey, Gov. Kay Ivey, Marie Manning, Yvette Richardson, Tonya Chestnut, Wayne Reynolds The Alabama State Board of Education votes on a resolution at the boa..."
    },
    {
      "title": "Alabama K-12 system sees improvements on state report card",
      "link": "https://alabamareflector.com/2025/11/14/alabama-k-12-system-sees-improvements-on-state-report-card/",
      "thumbnail": "",
      "description": "Alabama State Superintendent Eric Mackey talks to Alabama State Board of Education members about enrollment numbers at their monthly meeting on Oct. 9, 2025. Alabama public school performance increased slightly last year..."
    },
    {
      "title": "Chambers, Lee county voters to choose GOP nominee for special House election",
      "link": "https://alabamareflector.com/2025/11/14/chambers-lee-county-voters-to-choose-gop-nominee-in-special-house-election-in-runoff/",
      "thumbnail": "",
      "description": "Garrett Dixon (left) and Kristin Nelson will face off in a special GOP primary runoff election for House District 38 in Chambers and Lee counties on Nov. 18. The winner of the runoff will face Democratic candidate Hazel ..."
    }
  ],
  "lastUpdated": "2025-11-17T14:42:58.773Z"
}