{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "US House approves bill mandating proof of citizenship for voting in federal elections",
      "link": "https://alabamareflector.com/2026/02/11/repub/us-house-approves-bill-mandating-proof-of-citizenship-for-voting-in-federal-elections/",
      "thumbnail": "",
      "description": "Booths await voters at the Pennington County Administration Building during early voting on Jan. 19, 2026, for a municipal election in Rapid City, South Dakota. (Photo by Seth Tupper/South Dakota Searchlight)WASHINGTON —..."
    },
    {
      "title": "Shutdown looms for FEMA, Coast Guard, TSA with stalemate over Homeland Security funds",
      "link": "https://alabamareflector.com/2026/02/11/repub/shutdown-looms-for-fema-coast-guard-tsa-with-stalemate-over-homeland-security-funds/",
      "thumbnail": "",
      "description": "At a congressional hearing on Feb. 11, 2026, lawmakers were told a funding lapse has lasting challenges for the Coast Guard workforce, its operational readiness and its long-term capabilities. In this photo, Petty Office..."
    },
    {
      "title": "Immigrant surge helped boost GOP states’ population, and they may gain US House seats as a result",
      "link": "https://alabamareflector.com/2026/02/11/repub/immigrant-surge-helped-boost-gop-states-population-and-they-may-gain-us-house-seats-as-a-result/",
      "thumbnail": "",
      "description": "Shelby Park in Eagle Pass, Texas, on the U.S.-Mexico border is occupied by the Texas National Guard in February 2025. Republican states that emphasize border security might benefit from immigration increases since 2020 b..."
    },
    {
      "title": "Bill regulating AI in determining health coverage passes Alabama Senate committee",
      "link": "https://alabamareflector.com/briefs/bill-regulating-ai-in-determining-health-coverage-passes-senate-committee/",
      "thumbnail": "",
      "description": "Sen. Arthur Orr, R-Decatur (top) listens to Sen. Larry Stutts, R-Tuscumbia on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate Health Care Committee approved O..."
    },
    {
      "title": "Tuscaloosa, other cities drop lawsuit over Alabama Internet sales tax",
      "link": "https://alabamareflector.com/2026/02/11/tuscaloosa-other-cities-drop-lawsuit-over-alabama-internet-sales-tax/",
      "thumbnail": "",
      "description": "The Alabama Statehouse as seen in 2023. A group of cities Wednesday dropped a lawsuit over the state's Internet sales tax, which alleged that the Alabama Department of Revenue was allowing ineligible companies to partici..."
    },
    {
      "title": "High-speed Minnesota car chase involving federal agent ends with multi-car crash",
      "link": "https://alabamareflector.com/2026/02/11/repub/high-speed-minnesota-car-chase-involving-federal-agent-ends-with-multi-car-crash/",
      "thumbnail": "",
      "description": "A high-speed car chase involving a man in a red Prius and federal agent ended with multi-car crash at Nina’s in St. Paul Wednesday Feb. 11, 2026. (Photo by Alyssa Chen/Minnesota Reformer)A high-speed car chase that invol..."
    },
    {
      "title": "Many middle-income families spend at least a tenth of their income on health insurance",
      "link": "https://alabamareflector.com/2026/02/11/repub/many-middle-income-families-spend-at-least-a-tenth-of-their-income-on-health-insurance/",
      "thumbnail": "",
      "description": "A health care worker places a bandage on a child after giving a vaccination shot. A new study shows that in many states, premium contributions and deductibles take a significant bite out of household incomes. (Scott Hous..."
    },
    {
      "title": "Alabama House committee passes bill granting scholarships to law enforcement families",
      "link": "https://alabamareflector.com/briefs/alabama-house-committee-passes-bill-granting-scholarships-to-law-enforcement-families/",
      "thumbnail": "",
      "description": "Rep. Allen Treadaway, R-Morris, speaks in the Alabama House of Representatives on May 8, 2024 at the Alabama Statehouse in Montgomery. (Brian Lyman/Alabama Reflector)An Alabama House committee Wednesday approved a bill t..."
    },
    {
      "title": "Jobs report shows a historic stall in hiring last year",
      "link": "https://alabamareflector.com/2026/02/11/repub/jobs-report-shows-a-historic-stall-in-hiring-last-year/",
      "thumbnail": "",
      "description": "Construction workers install finishing touches at a Scout Motors electric vehicle assembly plant in Blythewood, S.C., in February. Health care and construction hiring helped boost January jobs, but downward revisions for..."
    },
    {
      "title": "Alabama Senate approves bill allowing firings of library board members",
      "link": "https://alabamareflector.com/2026/02/11/alabama-senate-approves-bill-allowing-firings-of-library-board-members/",
      "thumbnail": "",
      "description": "Sen. Chris Elliott, R-Josephine, (left) speaks with Sen. Vivian Davis Figures, D-Mobile (right) on the floor of the Alabama Senate on Feb. 10, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate Tuesday app..."
    }
  ],
  "lastUpdated": "2026-02-12T05:44:53.105Z"
}