{
"status": "ok"
"feed": {
"url": "https://feeds.feedburner.com/alabamareflector/0zGtsmkibDb"
"title": "Alabama Reflector"
"link": "https://alabamareflector.com/"
"author": ""
"description": "Clarity today for a better tomorrow"
"image": "https://alabamareflector.com/wp-content/uploads/2023/01/cropped-AL-Reflector-Icon-1-lg-32x32.png"
}
"items": [
{
"title": "States are quietly cutting child care funding — and families are out of options"
"pubDate": "2025-11-08 13:01:52"
"link": "https://alabamareflector.com/2025/11/08/states-are-quietly-cutting-child-care-funding-and-families-are-out-of-options/"
"guid": "https://alabamareflector.com/?p=16880"
"author": "Chabeli Carrazana, The 19th"
"thumbnail": ""
"description": "This story was originally reported by Chabeli Carrazana of The 19th. Meet Chabeli and read more of her reporting on gender, politics and policy. For the past year, families in need of child care assistance in Indiana have been sitting on a waitlist that has ballooned from 3,000 to 30,000 kids. It’s still climbing — […]"
"content": " <img width="1024" height="768" src="https://alabamareflector.com/wp-content/uploads/2025/11/Childcare-crisis-Indiana-for-Nov-8-2025-story-1024x768.jpg" class="attachment-large size-large wp-post-image" alt='A woman holding up a sign saying "Child care crisis = Economic crisis Refund CCDF"' decoding="async" fetchpriority="high" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/Childcare-crisis-Indiana-for-Nov-8-2025-story-1024x768.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/Childcare-crisis-Indiana-for-Nov-8-2025-story-300x225.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/Childcare-crisis-Indiana-for-Nov-8-2025-story-768x576.jpg 768w, https://alabamareflector.com/wp-content/uploads/2025/11/Childcare-crisis-Indiana-for-Nov-8-2025-story-1536x1152.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2025/11/Childcare-crisis-Indiana-for-Nov-8-2025-story-2048x1536.jpg 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>Hoosiers protest child care voucher cuts in front of the Indiana Statehouse, in Indianapolis, on Friday, Oct. 10, 2025. In September, Indiana moved to lower its child care reimbursement rates, meaning the state will pay providers 10 to 35 percent less to care for low-income kids. Centers have had to pass those costs on to parents through higher co-payments. (Leslie Bonilla Muñiz/Indiana Capital Chronicle)</p> <p><!-- Creative Commons Attribution-NonCommercial-NoDerivatives https://creativecommons.org/licenses/by-nc-nd/4.0/ --></p> <p><em><a href="https://19thnews.org/2025/11/states-cutting-child-care-funding?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/11/states-cutting-child-care-funding" target="_blank">This story</a> was originally reported by Chabeli Carrazana of <a href="https://19thnews.org/?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/11/states-cutting-child-care-funding" target="_blank">The 19th</a>. <a href="https://19thnews.org/author/chabeli-carrazana?utm_source=partner&amp;utm_medium=referral&amp;utm_campaign=19th-republishing&amp;utm_content=/2025/11/states-cutting-child-care-funding" target="_blank"> Meet Chabeli and read more of her reporting on gender, politics and policy</a>.</em></p> <p>For the past year, families in need of child care assistance in Indiana have been sitting on a waitlist that has ballooned from 3,000 to <a href="https://www.in.gov/fssa/carefinder/Indianas-Child-Care-Dashboards/child-care-subsidy-dashboard/" target="_blank">30,000</a> kids. It’s still climbing — and no one is coming off of it.</p> <p>Emily Pike, the executive director of New Hope For Families in Bloomington, which cares for children experiencing homelessness, can’t remember a time when no families were coming off the waitlist. Before this year, she said, low-income families could expect to be on the list just a few weeks before they found placement at a center that took child care vouchers, which for most brought their costs down to zero.</p> <p>But now, state officials project that no kids will come off the list until <a href="https://dailyjournal.net/2025/10/30/no-new-indiana-child-care-vouchers-to-be-issued-until-2027/" target="_blank">at least 2027</a>.</p> <a href="https://alabamareflector.com/subscribe"> <div class="subscribeShortcodeContainer"> <div class="subscribeTextContainer"> <i class="fas fa-envelope"></i> <p>GET THE MORNING HEADLINES.</p> </div> <div class="subscribeButtonContainer"> <button>SUBSCRIBE</button> </div> </div> </a> <p>That isn’t the only drastic change. In September, Indiana moved to lower its child care reimbursement rates, meaning the state will pay providers 10 to 35 percent less to care for low-income kids. Centers have had to pass those costs on to parents through higher co-payments.</p> <p>Already, centers have <a href="https://www.lpm.org/news/2025-09-12/about-19-of-indiana-child-cares-have-already-closed-classrooms-as-state-cuts-aid" target="_blank">closed classrooms</a> as a result. Workers have been fired. Parents have pulled their children out of care.</p> <p>Versions of this story have quietly been playing out across the nation, including in <a href="https://arktimes.com/arkansas-blog/2025/09/24/blindsided-by-child-care-cuts-advocates-urge-the-state-to-slow-down" target="_blank">Arkansas</a>, <a href="https://www.oregonlive.com/education/2025/06/oregon-early-learning-child-care-programs-poised-for-45-million-in-cuts.html" target="_blank">Oregon</a>, <a href="https://marylandmatters.org/2025/09/16/enrollment-for-child-care-scholarships-still-closed-unclear-when-it-might-reopen/" target="_blank">Maryland</a> and <a href="https://www.njspotlightnews.org/2025/08/nj-cuts-child-care-subsidies-for-new-applicants/" target="_blank">New Jersey</a>. The reasons appear to be the same: States used a historic infusion of <a href="https://19thnews.org/2021/05/child-care-american-rescue-plan-for-the-industry/" target="_blank">COVID-19 relief funds</a> to improve their child care systems over the past few years, and now that the money has run dry, some can no longer keep their child care reimbursement rates up. To keep funds going to families already receiving state assistance, states have stopped accepting new children into their voucher programs and implemented waitlists.</p> <p>At the same time, they’re facing cuts — or upcoming ones — in federal funding.</p> <p>President Donald Trump’s tariff hikes are constricting budgets in states, like Indiana, that rely on international trade, and his Big Beautiful Bill spending package will dramatically cut funding for Medicaid and the Supplemental Nutrition Assistance Program, or SNAP. Scrambling to fill those new holes in their coffers, states have looked to child care.</p> <p>“A lot of states are facing major budget pressures for various reasons and those are unlikely to get better, and very likely to get worse, as a result of the Big Beautiful Bill, said Elliot Haspel, a national child care expert. “In some ways it’s all the more alarming that states are doing this before they are feeling the full effects.”</p> <p>In Arkansas, where the state proposed leveling reimbursement rates, the waitlist for child care vouchers is frozen.</p> <p><a href="https://marylandmatters.org/2025/09/16/enrollment-for-child-care-scholarships-still-closed-unclear-when-it-might-reopen/" target="_blank">Maryland </a>has stopped offering new applicants child care vouchers because it has more children enrolled right now than it can financially support. The state would need more funding to shrink its waitlist, and legislators have said that is <a href="https://marylandmatters.org/2025/10/09/still-no-answers-on-when-enrollment-freeze-on-child-care-scholarships-will-be-lifted/" target="_blank">not likely to come</a> because of cuts in federal funding.</p> <p>In Oregon, the legislature has slashed the budget for its free preschool program <a href="https://www.opb.org/article/2025/06/18/oregon-senators-agree-to-cut-45-million-in-funding-for-early-childhood-programs/" target="_blank">by 10 percent</a> due to poor economic projections for the corporate tax that funds the state’s program. The reason for those poor projections? <a href="https://www.opb.org/article/2025/09/05/think-out-loud-oregon-budget-politics-deficit-funding/" target="_blank">Tariffs</a> hitting a state economy that relies <a href="https://www.opb.org/article/2025/05/21/oregon-key-exports-imports-impact-trump-tariffs-wheat-coffee-computer-chips/" target="_blank">heavily on international trade</a>. An estimated 640 kids will no longer get free preschool.</p> <p>Helene Stebbins, the executive director of the Alliance for Early Success, a group that brings together early childhood advocacy at the state level, said some states “did not prepare for the very predictable end for the COVID dollars,” while others, like <a href="https://19thnews.org/2025/09/new-mexico-first-state-free-child-care/" target="_blank">New Mexico</a> and <a href="https://www.ctinsider.com/politics/article/ct-early-childhood-endowment-20783193.php" target="_blank">Connecticut</a>, have instead invested more state money in child care after the funds ended.</p> <p>“It’s a choice about how they collect and redistribute revenue and budget,” she said.</p> <p>In 2021, child care got <a href="https://19thnews.org/2021/05/child-care-american-rescue-plan-for-the-industry/" target="_blank">a $39 billion infusion</a> after <a href="https://www.childcareaware.org/demanding-change-repairing-our-child-care-system/" target="_blank">16,000 child care centers and homes closed</a> during the pandemic and more than 370,000 workers lost their jobs. It was money states used for a whole host of things, including paying providers more, raising wages and improving infrastructure. The last of those dollars expired in September 2024. Many advocates in 2023 warned that a child care cliff <a href="https://19thnews.org/2023/08/child-care-centers-closing-pandemic-era-funding-communities/" target="_blank">was coming</a>. Years later, it’s now here.</p> <p>In Indiana, the state said its recent changes were largely due to a projected <a href="https://content.govdelivery.com/accounts/INOECOSL/bulletins/3f0e8a3" target="_blank">$225 million</a> funding gap created by “unsustainable” use of COVID relief funds by the prior governor’s administration. In 2021, the funds allowed the state to pay providers about 20 percent more to care for low-income kids and expanded the eligibility requirements, which led to more families enrolling in child care vouchers. But after the funds expired, Indiana could no longer cover those rates, even after it invested an additional $147 million in child care earlier this year.</p> <p>The state declined an interview on the changes, but a spokesperson for the Office of Early Childhood and Out-of-School Learning told The 19th that Indiana is also battling lower revenue projections in part <a href="https://indianacapitalchronicle.com/2025/04/16/newest-forecast-data-projects-2b-less-in-revenue/" target="_blank">due to tariffs</a>. Indiana is the <a href="https://www.axios.com/local/indianapolis/2025/04/16/indiana-fourth-largest-export-market-china-tariffs-pharmaceuticals" target="_blank">fourth highest exporter</a> of goods to China in the United States. Cuts to Medicaid and SNAP that will take effect in 2027 are very likely also going to affect the child care budget, a spokesperson said.</p> <p>In a news release, Adam Alson, the director of Indiana’s early childhood office, said the state decided to focus its funding on the families already receiving aid. He reasoned it out like this: “There is only one pot of money — we could either protect providers or kids, and we chose kids.”</p> <p>But if centers have to fire teachers, close classrooms or close entire buildings, children will also be impacted, multiple Indiana child care providers told The 19th. Most of the children on vouchers in Indiana <a href="https://www.in.gov/fssa/carefinder/files/CCDFOverview.pdf" target="_blank">are Black or Latinx kids</a> from single-parent households. About 60 percent of those families are living below the poverty level and nearly all are working. If those children can’t be in care, their parents face missing out on work or losing jobs altogether.</p> <p>“When policymakers decide to cut something like this, what they’re saying is, ‘Oh people will figure it out.’ I think they expect caregivers to figure it out,” Pike said. “It’s a dramatic misunderstanding of what the field does, because at the end of the day, we as a society make choices about what’s most important to us. When we choose not to fund early learning we are demonstrating real short sightedness.”</p> <p>Cori Kerns, an early childhood advocate and staff consultant at Little Duckling Early Learning Schools in Indianapolis, said families there are seeing their co-pays rise from $5 to $15 a week, and even that modest increase is having a big impact. So big, in fact, that the centers had to consolidate their two buildings into one because so many parents stopped bringing their kids in after the rate hikes. The center is surviving only because the community has chipped in to cover electricity bills and rent payments.</p> <p>Across Indiana, at least 36 centers have closed entirely since the start of the year, said Hanan Osman, the executive director for Indiana Association for the Education of Young Children, which is tracking closures.</p> <p>Arkansas faces a similar situation: Providers were staring down as many as <a href="https://arkansasadvocate.com/2025/10/28/panel-recommends-changes-to-sustain-arkansas-child-care-during-government-shutdown/" target="_blank">400 layoffs</a> and potential <a href="https://arkansasadvocate.com/2025/10/15/arkansas-child-care-providers-ask-state-for-help-after-changes-to-school-readiness-program/" target="_blank">closures</a> due to significant reimbursement rate cuts proposed by the state designed to spread the money across more kids and lower the number of children on the waitlist. The list now numbers <a href="https://arkansasadvocate.com/2025/10/28/panel-recommends-changes-to-sustain-arkansas-child-care-during-government-shutdown/" target="_blank">1,100</a> and has also been frozen since the start of the year.</p> <p>In September, the state notified providers that it would no longer pay out higher reimbursement rates to higher-quality centers. In Arkansas, centers are rated for quality from 1 to 6 — the higher their quality rating, the more money the state puts in to cover the cost of providing that care, often because the provider is also spending more on curriculum, teacher pay and materials. The state then proposed that every provider will get a flat fee. Higher co-payments for families kicked in October 1, and the reimbursement rate change was delayed to November 1 after significant public opposition to the plan.</p> <p>Last month Arkansas Secretary of Education Jacob Oliva said uncertainty around the federal government shutdown was part of it, and so was an <a href="https://www.ualrpublicradio.org/local-regional-news/2025-10-01/arkansas-education-officials-delay-childcare-reimbursement-changes-raise-copays" target="_blank">unexpected reduction</a> in the federal funds the state receives for child care due to a change in how state allowances are calculated. That led to a realization that the voucher program was significantly over budget, to the tune of as much as $9 million <a href="https://dese.ade.arkansas.gov/Files/Early_Childhood_Commission_Work_Session_Presentation_20251015_OEC.pdf" target="_blank">more a month</a>, because so many more children were receiving services.</p> <p>In late October, a task force of child care experts presented recommendations to the state to scale back the cuts, most of which have <a href="https://arkansasadvocate.com/briefs/arkansas-education-department-adopts-most-of-plan-to-keep-families-providers-in-child-care-industry/" target="_blank">now been implemented</a>. Instead of a new flat reimbursement rate, providers rated <a href="https://arkansasadvocate.com/wp-content/uploads/2025/11/new-SRA-rates.pdf" target="_blank">3 to 6 in quality will still get higher rates</a>, albeit not as high as they were previously.</p> <p>It’s all been incredibly stressful for McKinley Hess, the executive director of Conway Cradle Care in Conway, Arkansas, which primarily serves teen parents. In the past, those teens had been able to bypass the waitlist because they are considered a priority population, but Arkansas removed the exception at the end of August. The center is a level 3 of 6 for quality, but under the proposed cuts she would have seen a cut of $20 less per infant per day and $16 per toddler per day. Now, the cuts will be less dramatic: $5 a day each for infants and toddlers.</p> <p>Still, “it is a disaster,” Hess said bluntly. The center had been covering all costs for eight families who are sitting on the state’s waitlist for assistance and plans to continue doing so until those families come off it.</p> <p>“While the new reimbursement rates are not as detrimental as the initially proposed cuts, our most pressing challenge remains the number of adolescent parents who are waitlisted and unable to receive assistance,” Hess said. “For our adolescent parents, access to child care is the bridge between continuing their education and being forced to drop out of school.”</p> <p>In Mountain Home, Arkansas, Jill Wilson, the executive director of Open Arms Learning Center, was looking at a $32,000-a-month shortfall from the rate changes. Now the shortfall will be more like $3,200. Her center is accredited 5 stars out of 6, a quality level that she earned through significant investments like specialized curriculum for each class room — $4,000 each for 17 rooms.</p> <p>Already, she had to cut two staff positions and combine classrooms.</p> <p>“I have been here for 20 years and it’s never been like this,” Wilson said. “I feel like the rug has been pulled out from under me.”</p> <p>For Pike in Indiana, the situation goes far beyond the dollars and cents of a state budget. For the families she serves, access to child care is the key to retaining a job and moving out of homelessness.</p> <p>“I have seen families make devastatingly difficult decisions when they don’t have access to child care. It makes me emotional to talk about it. I have seen families choose to leave their children with someone with an active substance use problem. I’ve seen families leave little kids home with big kids. And I’m using big kids pretty loosely there — they might be 8 or 9 or 10. I have seen families lose jobs,” Pike said.</p> <p>She started her center 10 years ago when she encountered a crying mom with a 4-year-old girl and an infant in the parking lot of a shelter. The little girl had been bitten by a dog at an unlicensed child care home the previous day and received 17 stitches in her neck. The mom’s boss was threatening to fire her if she missed work, and so the mother had no choice but to send her daughter back.</p> <p>Pike helped the family that day and later started her center, an experience that has fueled her belief that cutting access to child care funding does not mean children no longer need care. They still have to go somewhere.</p> <p>Put simply, she said: “When we take away subsidies, we are taking away low-income families’ access to safe care.”</p> <p><img decoding="async" src="https://pixel.19thnews.org/2025/11/states-cutting-child-care-funding" alt=""></p> "
"enclosure": {
}
"categories": [
"Government &amp; Politics"
"American Rescue Plan Act of 2021"
"child care"
"COVID-19"
"economy"
"Federal government of the United States"
"Pre-K"
"Supplemental Nutritional Assistance Program (SNAP)"
"Women in the workforce"
]
}
{
"title": "US Supreme Court temporarily blocks November SNAP payments"
"pubDate": "2025-11-08 03:34:52"
"link": "https://alabamareflector.com/2025/11/07/repub/us-supreme-court-temporarily-blocks-november-snap-payments/"
"guid": "https://alabamareflector.com/?post_type=republished&amp;p=16887"
"author": "Jacob Fischler"
"thumbnail": ""
"description": "The U.S. Supreme Court temporarily blocked Friday night a lower court’s order that the Trump administration pay for a full month of food benefits, hours after some states began loading nutrition assistance funds on payment cards held by the 42 million Americans who use the program. In a two-page filing, Justice Ketanji Brown Jackson accepted the government’s […]"
"content": " <img width="1024" height="768" src="https://alabamareflector.com/wp-content/uploads/2025/11/supremecourtoctober2024norman-1024x768.jpeg" class="attachment-large size-large wp-post-image" alt="The U.S. Supreme Court on Oct. 9, 2024. (Photo by Jane Norman/States Newsroom)" decoding="async" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/supremecourtoctober2024norman-1024x768.jpeg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/supremecourtoctober2024norman-300x225.jpeg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/supremecourtoctober2024norman-768x576.jpeg 768w, https://alabamareflector.com/wp-content/uploads/2025/11/supremecourtoctober2024norman-1536x1152.jpeg 1536w, https://alabamareflector.com/wp-content/uploads/2025/11/supremecourtoctober2024norman-2048x1536.jpeg 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>The U.S. Supreme Court on Oct. 9, 2024. (Photo by Jane Norman/States Newsroom)</p> <p dir="ltr">The U.S. Supreme Court temporarily blocked Friday night a lower court’s order that the Trump administration pay for a full month of food benefits, hours after some states began loading nutrition assistance funds on payment cards held by the 42 million Americans who use the program.</p> <p dir="ltr"><a href="https://www.documentcloud.org/documents/26221041-25a539-admin-stay/" target="_blank">In a two-page filing,</a> Justice Ketanji Brown Jackson accepted the government’s request to pause a Thursday order from Rhode Island Chief U.S. District Judge John J. McConnell while a lower appeals court hears the case. </p> <p dir="ltr">His order Thursday compelled the U.S. Department of Agriculture to transfer funds from other programs to fund the Supplemental Nutrition Assistance Program, or SNAP, for November. The Trump administration had said the ongoing government shutdown meant it could not pay November SNAP benefits.</p> <p dir="ltr">“The applicants assert that, without intervention from this Court, they will have to ‘transfer an estimated $4 billion by tonight’ to fund SNAP benefits through November,” Jackson, who was appointed by President Joe Biden, wrote. </p> <p dir="ltr">A stay is needed to reach an “expeditious resolution,” she wrote.</p> <p dir="ltr">Jackson’s order froze SNAP payments to states that the USDA had <a href="https://www.newsfromthestates.com/article/trump-administration-issues-november-snap-benefits-then-asks-supreme-court-intervene" target="_blank">appeared to authorize</a> earlier Friday before the administration appealed to the high court.</p> <p dir="ltr">It was unclear Friday night what effect that might have on individual recipients’ electronic benefit transfer, or EBT, cards. A press release earlier Friday from California Gov. Gavin Newsom said some Californians had begun to see full benefits on their cards, following an order from a lower court.</p> <h4>High court challenge </h4> <p dir="ltr">In a Friday evening brief to the Supreme Court that followed a day of conflicting messages from the administration, U.S. Solicitor General D. John Sauer said the high court should step in to protect the executive branch’s power from what he characterized as unprecedented overreach by McConnell.</p> <p dir="ltr">By demanding that the USDA transfer money from a $23 billion fund for child nutrition programs to pay for November SNAP benefits, McConnell substituted his judgment for the agency’s, a violation of the constitutional separation-of-powers doctrine, Sauer argued. </p> <p dir="ltr">The department’s decision to pay for partial November benefits, by using the roughly $5 billion remaining in a contingency fund, rather than by paying about $9 billion for a full month of benefits, was its decision to make and not reviewable by courts, Sauer said.</p> <p dir="ltr">“USDA reasonably determined that the best course was to combine partial SNAP payments with stable funding for Child Nutrition Programs—versus jeopardize the latter to guarantee full payments with the former,” Sauer wrote. “The district court would have done otherwise. But it had no legal basis to ‘substitute its own policy judgment for that of the agency.’”</p> <h4>Confusion in states </h4> <p dir="ltr">The lower court order — as well a midday Friday letter from the USDA to state SNAP administrators — had also led to confusion among states who started to demand SNAP funds in a way Sauer compared to a bank run.</p> <p dir="ltr">Several states announced full funding would be available and began sending money to beneficiaries.</p> <p dir="ltr">Immediately after McConnell’s order was published, Wisconsin demanded “100% of SNAP benefits,” Sauer wrote. Even though the USDA system rejected the file, the private-sector processor of the payment “moved forward, resulting in Wisconsin currently overdrawing its letter of credit by $20 million,” he said.</p> <p dir="ltr">Kansas made a similar move. And some California SNAP users received their full benefits, according to Sauer’s brief.</p> <h4>16 million children on SNAP</h4> <p dir="ltr">McConnell on Thursday had ruled the department’s decision to withhold SNAP benefits arbitrary and capricious — the standard for judicial review of an executive branch action. </p> <p dir="ltr">The $23 billion fund could spare the $4 billion needed to make November SNAP benefits whole and still maintain its intended purpose well beyond the month, so there was no need to maintain that fund at that level, he wrote.</p> <p dir="ltr">Instead, the decision “predictably magnifies harm and undermines the very purpose of the program it administers,” McConnell wrote.</p> <p dir="ltr">While federal agencies are due discretion from courts, such a “poor” use of decision-making power must be remedied, he said.</p> <p dir="ltr">“Contrary to what the Defendants claim, 29 million children who participate in the Child Nutrition Program are not at risk of immediately going hungry in the event of a transfer,” he said. “Instead, SNAP recipients—16 million of whom are children—will go hungry if they do not receive their SNAP benefits this month.”</p> <h4>‘Starve Peter to feed Paul’</h4> <p dir="ltr">But Sauer responded that was not McConnell’s call to make. </p> <p dir="ltr">The trial judge’s ruling improperly assumed that Congress would eventually replenish the child nutrition program fund, but the USDA was within its right to take a more cautious approach toward protecting the child nutrition funding, said the solicitor general.</p> <p dir="ltr">“It obviously was not unlawful for the agency to see things differently—and refuse to starve Peter to feed Paul, by gambling school lunches tomorrow in exchange for more SNAP money today,” he wrote. “Indeed, that sort of hard tradeoff is precisely the sort of decision that Congress committed to agency discretion and placed beyond the reach of judges.”</p> <p dir="ltr">While the USDA had not denied that it was able to move money to different priorities after Congress had appropriated it, the government did not have to do so, Sauer said.</p> <p dir="ltr">Allowing McConnell’s ruling to stand would invite a stampede to litigation, the government maintained.</p> <p dir="ltr">“If allowed to stand, this decision will metastasize and sow further shutdown chaos,” Sauer said. “Every beneficiary of a federal program could run into court, point to an agency’s general discretion to prioritize funding, and claim that failing to prioritize their chosen program was arbitrary and capricious.”</p> <h4>Trump social media post</h4> <p dir="ltr">Sauer also said McConnell read too much into Trump’s social media post this week that threatened to withhold SNAP funding for the duration of the shutdowns.</p> <p dir="ltr">McConnell cited in his order the post, in which Trump said SNAP benefits would “be given only when the Radical Left Democrats open up government, which they can easily do, and not before!” showed the true purpose of the USDA move was political leverage.</p> <p dir="ltr">Sauer said that was improper.</p> <p dir="ltr">“The court below had no basis to transfer of billions of dollars from school lunches to its preferred program based on its tendentious view of ‘the administration’s true motivations.’”</p> <p dir="ltr">In a statement, Skye Perryman, the president and CEO of Democracy Forward, an advocacy group that is leading the litigation to force SNAP payments, said the group would continue to work to “secure benefits for the American people”</p> <p dir="ltr">“The Trump-Vance administration continues to attempt — over and over — to take food out of the hands of families, seniors, workers, and children,” Perryman said. “And every time they tried, the courts told them what the law already makes clear: they cannot. American families should not be used as political props in a shutdown that this White House manufactured.”</p> "
"enclosure": {
}
"categories": [
"D.C. Bureau"
"Congress"
"Federal judiciary of the United States"
"Food insecurity"
"Gavin Newsom"
"Ketanji Brown Jackson"
"President Donald Trump"
"Supplemental Nutritional Assistance Program (SNAP)"
"Supreme Court of the United States (SCOTUS)"
"U.S. Department of Agriculture (USDA)"
]
}
{
"title": "Montgomery police arrest fifth suspect in October shooting"
"pubDate": "2025-11-07 21:03:44"
"link": "https://alabamareflector.com/briefs/montgomery-police-arrest-fifth-suspect-in-october-shooting/"
"guid": "https://alabamareflector.com/?post_type=briefs&amp;p=16886"
"author": "Anna Barrett"
"thumbnail": ""
"description": "Montgomery Police arrested a fifth suspect Thursday in connection with an October mass shooting that killed two and injured 12. The Montgomery Police Department said in a statement posted to Facebook Friday that Ivan Floyd, 22, was charged with certain persons forbidden to carry a firearm. He was taken to the Montgomery County Detention Facility, […]"
"content": " <img width="1024" height="768" src="https://alabamareflector.com/wp-content/uploads/2025/10/IMG_4971-1024x768.png" class="attachment-large size-large wp-post-image" alt="" decoding="async" srcset="https://alabamareflector.com/wp-content/uploads/2025/10/IMG_4971-1024x768.png 1024w, https://alabamareflector.com/wp-content/uploads/2025/10/IMG_4971-300x225.png 300w, https://alabamareflector.com/wp-content/uploads/2025/10/IMG_4971-768x576.png 768w, https://alabamareflector.com/wp-content/uploads/2025/10/IMG_4971-1536x1152.png 1536w, https://alabamareflector.com/wp-content/uploads/2025/10/IMG_4971-2048x1536.png 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>Montgomery Mayor Steven Reed giving press an update on the Oct. 4 mass shooting on Oct. 20, 2025, at the Montgomery Police Department in Montgomery, Alabama. MPD announced Friday that a fifth suspect was arrested in connection with the shooting. (Anna Barrett/Alabama Reflector)</p> <p><span>Montgomery Police arrested a fifth suspect Thursday in connection with an </span><a href="https://alabamareflector.com/2025/10/05/police-montgomery-shooting-leaves-two-dead-12-injured/"><span>October mass shooting</span></a><span> that killed two and injured 12.</span></p> <p><span>The Montgomery Police Department said in a statement posted to </span><a href="https://www.facebook.com/share/p/1AA7HjEffx/" target="_blank"><span>Facebook</span></a><span> Friday that Ivan Floyd, 22, was charged with certain persons forbidden to carry a firearm. He was taken to the Montgomery County Detention Facility, according to the statement.</span></p> <p><span>Floyd was also charged with robbery in the first degree, theft of property in the first degree, and theft of property in the second degree, which happened on Sept. 29, according to the statement. Police said those crimes were not connected to the shooting. </span></p> <p><span>“MPD extends its gratitude to local and federal law enforcement partners for their continued support and collaboration, which have been instrumental in advancing the case,” the statement said.</span></p> <p><span>The shooting, which took place during celebrations after a football game, killed Jeremiah Morris, 17, and Shalanda Williams, 43. </span></p> <p><span>Four others were arrested last month. </span><a href="https://alabamareflector.com/briefs/fourth-arrest-made-in-montgomery-mass-shooting/"><span>Kemontae Hood</span></a><span>, 21, an </span><a href="https://alabamareflector.com/briefs/montgomery-police-make-arrest-in-connection-with-mass-shooting/"><span>unnamed juvenile</span></a><span> and </span><a href="https://alabamareflector.com/briefs/montgomery-police-second-arrest-in-connection-to-mass-shooting/"><span>Dantavious McGhee</span></a><span>, 19, were charged with one count of capital murder, nine counts of first-degree assault and three counts of second-degree assault. </span><a href="https://alabamareflector.com/briefs/third-arrest-made-in-montgomery-mass-shooting/"><span>Javorick Whiting</span></a><span>, 19, was charged last week with one count of attempted murder. Whiting was later released on bond, which </span><a href="https://alabamareflector.com/2025/10/21/man-charged-in-montgomery-mass-shooting-bonds-out-sparking-criticism-from-police-chief/"><span>sparked criticism</span></a><span> from city leaders.</span></p> <p>The shooting sparked <a href="https://alabamareflector.com/2025/10/07/gop-officials-attack-montgomery-leaders-in-wake-of-shooting-city-leaders-push-back/">a war of words</a> between state Republican leaders and city officials, who tend to be Democratic. Attorney General Steve Marshall accused Montgomery leaders of a “stubborn refusal to acknowledge they have a serious problem.” Montgomery Mayor Steven Reed invited Marshall to meet with him about solutions and condemned state lawmakers for passing permissive gun laws in the last several years.</p> "
"enclosure": {
}
"categories": [
"Government &amp; Politics"
"Alabama Law Enforcement Agency (ALEA)"
"James Graboys"
"Mass shooting"
"Montgomery"
"Montgomery Police Department"
"Montgomery shooting"
"Steven Reed"
]
}
{
"title": "Trump administration issues November SNAP benefits, then asks Supreme Court to intervene"
"pubDate": "2025-11-07 20:12:51"
"link": "https://alabamareflector.com/2025/11/07/repub/full-november-snap-benefits-to-be-issued-by-trump-administration-despite-shutdown/"
"guid": "https://alabamareflector.com/?post_type=republished&amp;p=16884"
"author": "Jacob Fischler"
"thumbnail": ""
"description": "This report has been updated. The U.S. Department of Agriculture told states Friday it was releasing full November funding for the nation’s major food assistance program that helps 42 million people afford groceries, complying with a federal court order issued Thursday. The midday memo to states contradicted the Trump administration’s weeks-long position that funding the […]"
"content": " <img width="1024" height="683" src="https://alabamareflector.com/wp-content/uploads/2025/11/snapposter-1024x683.jpg" class="attachment-large size-large wp-post-image" alt="The entrance to a Big Lots store in Portland, Oregon. (Stock photo by hapabapa/Getty Images)" decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/snapposter-1024x683.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/snapposter-300x200.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/snapposter-768x512.jpg 768w, https://alabamareflector.com/wp-content/uploads/2025/11/snapposter-1536x1024.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2025/11/snapposter-2048x1366.jpg 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>The entrance to a Big Lots store in Portland, Oregon. (Stock photo by hapabapa/Getty Images)</p> <p dir="ltr"><em>This report has been updated.</em></p> <p dir="ltr">The U.S. Department of Agriculture told states Friday it was releasing full November funding for the nation’s major food assistance program that helps 42 million people afford groceries, complying with a federal court order issued Thursday.</p> <p dir="ltr">The midday memo to states contradicted the Trump administration’s weeks-long position that funding the Supplemental Nutrition Assistance Program, or SNAP, during the government shutdown was illegal. And late Friday, the administration resumed that position, <a href="https://www.documentcloud.org/documents/26220987-supremecourtnov72025/" target="_blank">asking the Supreme Court </a>to overturn a lower court’s ruling that compelled the earlier memo.</p> <p dir="ltr">Payments would be sent to states Friday, the department’s Food and Nutrition Service said in a letter to state directors of  SNAP, which is funded by the federal government and administered by the states. Patrick A. Penn, the deputy under secretary for food, nutrition and consumer services, wrote the <a href="https://www.documentcloud.org/documents/26220869-snap-november-2025-benefit-guidance-update/" target="_blank">two-paragraph letter.</a></p> <p dir="ltr">“Later today, FNS will complete the processes necessary to make funds available to support your subsequent transmittal of full issuance files to your EBT processor,” Penn wrote. “We will keep you as up to date as possible on any future developments and appreciate your continued partnership to serve program beneficiaries across the country.”</p> <p dir="ltr">The move undermined an appeal President Donald Trump’s administration made following <a href="https://www.newsfromthestates.com/article/trump-administration-ordered-pay-full-9b-november-snap-benefits-amid-shutdown" target="_blank">Thursday’s order</a> from Chief U.S. District Judge John J. McConnell Jr. of Rhode Island. The <a href="https://www.courtlistener.com/docket/71886023/00108363689/rhode-island-state-council-of-churches-v-rollins/" target="_blank">appeal</a> said the government shutdown, and the resulting lack of funding for SNAP, was Congress’ fault and that the department could not be compelled to transfer other funds to pay for SNAP benefits.</p> <p dir="ltr">A Department of Justice spokesperson said in a Friday email to States Newsroom the government must comply with McConnell’s order until and unless it is given relief by a higher court.</p> <p dir="ltr">The shutdown, which started when Congress failed to pass annual spending laws by Oct. 1, left SNAP without any appropriated funding for November and beyond. The administration <a href="https://www.newsfromthestates.com/article/usda-wont-shuffle-funds-extend-snap-during-shutdown-about-face-earlier-plan" target="_blank">reversed its own guidance</a> and declined to use a contingency fund and other accounts within the USDA held more than enough to cover some benefits.</p> <h4>Appeal in limbo</h4> <p dir="ltr">The move from the USDA was in contrast to an appeals court brief the Justice Department filed on USDA’s behalf Friday morning, leaving the future of that litigation unclear.</p> <p dir="ltr">The appeal asked the 1st Circuit U.S. Court of Appeals for an emergency freeze on McConnell’s order, which it characterized as a wild overreach to a reasonable agency decision.</p> <p dir="ltr">A three-judge panel for the appeals court <a href="https://www.courtlistener.com/docket/71886023/00108364203/rhode-island-state-council-of-churches-v-rollins/" target="_blank">denied</a> the government’s request for a stay on the merits late Friday, while saying it would soon decide on a motion for an administrative stay.</p> <p dir="ltr">The judges — David J. Barron, Gustavo A. Gelpí and Julie Rikelman — were all appointed by Democratic presidents, though Gelpí was appointed to a lower court by Republican President George W. Bush. </p> <p dir="ltr">The agency said it complied with a Nov. 1 McConnell order to either pay full benefits by Nov. 3 or partial benefits by Nov. 5 by sending states a memo and tables to calculate partial benefits. </p> <p dir="ltr">The USDA had the power to decide to pay only partial benefits from a contingency fund that held about $4.5 billion, the government argued. SNAP benefits cost the government about $9 billion per month.</p> <p dir="ltr">In McConnell’s Thursday order, he rejected that argument, saying the partial payment had to be made by Nov. 5 to be in compliance with the Oct. 31 order. </p> <p dir="ltr">The judge said Thursday that because the department had not met that deadline, it must transfer money from outside the contingency fund to make November SNAP benefits whole.</p> <p dir="ltr">The administration argued to the 1st Circuit that order was beyond McConnell’s power.</p> <p dir="ltr">“There is no lawful basis for an order that directs USDA to somehow find $4 billion in the metaphorical couch cushions,” the appeal said.</p> <p dir="ltr">The administration has resisted suggestions, including from McConnell, that it tap a $23 billion fund meant for child nutrition programs in order to pay November SNAP benefits.</p> <p dir="ltr">The administration asked the appeals court to pause McConnell’s order by 4 p.m. Eastern time Friday.</p> <h4>Problem of government’s ‘own making’</h4> <p dir="ltr">The coalition of nonprofits and city governments that sued to force the administration to pay November benefits responded later Friday morning that USDA was to blame for the tight timeline that provoked the department’s complaints.</p> <p dir="ltr">The department chose, between the two options offered by McConnell, to pay partial benefits “but with complete disregard for the conditions the district court had attached to it,” the coalition wrote Friday.</p> <p dir="ltr">“Defendants’ current situation, therefore, is entirely the product of their own making,” they wrote. “They purported to comply with an order of the district court in a manner that was not compliant; having done so, they cannot complain that the district court ordered them to take the other path.”</p> <p dir="ltr">The coalition also sharply criticized the administration’s decision not to use the child nutrition program fund. The fund had enough money to pay benefits until at least May, the coalition lawyers wrote Friday. But denying SNAP benefits for November would leave 16 million children hungry this month, they said. </p> <h4>Major shutdown issue</h4> <p dir="ltr">The issue has become a focus of the shutdown, with each party in Washington blaming the other for denying food assistance for low-income people and those with disabilities.</p> <p dir="ltr">Friday’s rapid turnaround by USDA appeared to take even lawmakers by surprise.</p> <p dir="ltr">Sen. Tim Kaine, a Virginia Democrat, posted to social media after the notice had gone out that Trump was “trying to weasel his way out of a court order requiring him to help millions of hungry Americans.”</p> <p dir="ltr">Rep. Angie Craig, the ranking Democrat on the U.S. House Agriculture Committee, said in a late Friday statement the administration’s mixed messaging led to mass confusion, leaving some states to fully fund SNAP while others have not. </p> <p dir="ltr">“The Trump administration needs to tell American households and states in plain language whether it is continuing to appeal the Rhode Island court order or if it is fully funding November SNAP benefits,” she said. “Americans are still living with the uncertainty around what the hell is happening here. The incompetence is stunning.”</p> <p dir="ltr">Republicans have also highlighted the issue while urging Democrats to accept a stopgap funding measure to reopen the government at fiscal 2025 spending levels.</p> <p dir="ltr">“There are people going hungry right now because Democrats refuse to agree to a clean, nonpartisan funding extension,” Senate Majority Leader John Thune, R-S.D., said on the Senate floor Friday.</p> <p dir="ltr">Democrats have blocked a House-passed bill to reopen the government, seeking assurances that Republicans will work to address expiring tax credits for people who buy health insurance on the Affordable Care Act marketplace.</p> "
"enclosure": {
}
"categories": [
"D.C. Bureau"
"Government &amp; Politics"
"2025 federal government shutdown"
"Congress"
"Electronic Benefit Transfer (EBT)"
"Food insecurity"
"President Donald Trump"
"Supplemental Nutritional Assistance Program (SNAP)"
"U.S. Department of Agriculture (USDA)"
]
}
{
"title": "US Senate fails to pass war powers resolution blocking Trump attacks on Venezuela"
"pubDate": "2025-11-07 15:20:54"
"link": "https://alabamareflector.com/2025/11/07/repub/us-senate-fails-to-pass-war-powers-resolution-blocking-trump-attacks-on-venezuela/"
"guid": "https://alabamareflector.com/?post_type=republished&amp;p=16878"
"author": "Ashley Murray"
"thumbnail": ""
"description": "WASHINGTON — A vote to stop President Donald Trump’s deadly strikes on alleged drug-running boats off the coast of Venezuela failed Thursday in the U.S. Senate, nearly mirroring the outcome of a similar war powers vote last month.  Senate Republicans Lisa Murkowski of Alaska and Rand Paul of Kentucky again joined Democrats in a 49-51 vote, […]"
"content": " <img width="1024" height="769" src="https://alabamareflector.com/wp-content/uploads/2025/11/timkainenov62025-1024x769.jpg" class="attachment-large size-large wp-post-image" alt="Sen. Adam Schiff of California, left, and Sen. Tim Kaine of Virginia, both Democrats, talk to reporters at the U.S. Capitol on Nov. 6, 2025. (Photo by Ashley Murray/States Newsroom)" decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/timkainenov62025-1024x769.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/timkainenov62025-300x225.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/timkainenov62025-768x577.jpg 768w, https://alabamareflector.com/wp-content/uploads/2025/11/timkainenov62025-1536x1153.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2025/11/timkainenov62025-2048x1538.jpg 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>Sen. Adam Schiff of California, left, and Sen. Tim Kaine of Virginia, both Democrats, talk to reporters at the U.S. Capitol on Nov. 6, 2025. (Photo by Ashley Murray/States Newsroom)</p> <p dir="ltr">WASHINGTON — A vote to stop President Donald Trump’s deadly strikes on alleged drug-running boats off the coast of Venezuela failed Thursday in the U.S. Senate, nearly mirroring the outcome of a similar war powers vote last month. </p> <p dir="ltr">Senate Republicans Lisa Murkowski of Alaska and Rand Paul of Kentucky again joined Democrats in <a href="https://www.senate.gov/legislative/LIS/roll_call_votes/vote1191/vote_119_1_00608.htm" target="_blank">a 49-51 vote</a>, just shy of the simple majority needed to advance legislation aimed at halting Trump’s escalating campaign on what his administration describes as “narco-terrorists.”</p> <p dir="ltr">The <a href="https://www.congress.gov/bill/119th-congress/senate-joint-resolution/90/cosponsors?s=1&amp;r=1&amp;q=%7B%22search%22%3A%22S.J.res+90%22%7D" target="_blank">joint resolution</a>, brought to the floor by Sen. Tim Kaine, D-Va., directs the “removal of United States Armed Forces from hostilities within or against Venezuela that have not been authorized by Congress.”</p> <p dir="ltr">Paul and Sen. Adam Schiff, D-Calif., initially cosponsored the bill, and a dozen more Democratic senators and one independent signed on. </p> <p dir="ltr">Schiff’s similar measure <a href="https://www.newsfromthestates.com/article/us-senate-rejects-restriction-military-strikes-vessels-caribbean" target="_blank">failed</a> 48-51 in early October.</p> <p dir="ltr">Kaine forced Thursday’s vote under the War Powers Resolution, a Vietnam War-era <a href="https://www.congress.gov/crs-product/R47603" target="_blank">statute</a> that gives Congress a check on the president’s use of the military abroad. </p> <p dir="ltr">The death toll from U.S. military strikes has risen to 67 since September, according to <a href="https://www.cnn.com/2025/11/02/politics/timeline-us-strikes-caribbean-pacific-vis" target="_blank">CNN</a>. Notably, the Trump administration is <a href="https://www.navytimes.com/news/your-navy/2025/11/04/uss-gerald-r-ford-heads-to-caribbean-to-support-anti-narcotics-effort/" target="_blank">relocating</a> the country’s most advanced aircraft carrier from the Mediterranean to the Caribbean, joining other Navy resources currently amassed there. </p> <p dir="ltr">On Oct. 16, Trump <a href="https://www.npr.org/2025/10/16/g-s1-93677/trump-confirms-cia-operations-venezuela" target="_blank">publicly confirmed</a> a New York Times report that he had authorized covert CIA operations in Venezuela and told reporters he was “looking at land” for possible further strikes.  </p> <h4>Kaine, Schiff push for war powers vote</h4> <p dir="ltr">“All of this together with the increased pace of strikes in the Caribbean and the Pacific suggest that we are on the verge of something that should not happen without a debate and vote in Congress before the American people,” Kaine said on the floor before the vote. </p> <p dir="ltr">Kaine and Schiff told reporters Thursday they viewed the White House Office of Legal Counsel opinion authorizing the fatal strike in the Caribbean Sea and Pacific Ocean near Venezuela. </p> <p dir="ltr">The document, which senators are allowed to read in a classified setting, “makes no effort to claim that there’s a legal rationale for invading a sovereign nation, no effort to claim that it’s about Venezuela, or could be used with respect to Venezuela or any country,” Kaine said.</p> <p dir="ltr">Schiff characterized the opinion as “broad enough to authorize just about anything.”</p> <p dir="ltr">Kaine urged Senate Republicans, who received a brief and review of the document earlier this week, to introduce and debate legislation authorizing the administration to continue its military force in the region.</p> <p dir="ltr">“Anybody in Congress who thinks we ought to be bombing ships in the Caribbean and Pacific, introduce an AUMF (Authorization for Use of Military Force) and have a debate and vote on it,” Kaine said, adding “but don’t just abdicate this power.” </p> <h4>Hegseth posts video</h4> <p dir="ltr">Secretary of Defense Pete Hegseth <a href="https://x.com/SecWar/status/1985863010376642677" target="_blank">posted</a> a grainy video online Tuesday of a vessel in flames after a strike, and said the United States targeted the boat in the Eastern Pacific that had been operated by “a Designated Terrorist Organization.” </p> <p dir="ltr">“Intelligence confirmed that the vessel was involved in illicit narcotics smuggling, transiting along a known narco-trafficking route, and carrying narcotics. The strike was conducted in international waters in the Eastern Pacific.”</p> <p dir="ltr">“No U.S. forces were harmed in the strike, and two male narco-terrorists — who were aboard the vessel — were killed,” Hegseth wrote on social media.</p> <p dir="ltr">It’s <a href="https://media.defense.gov/2023/Jul/31/2003271432/-1/-1/0/DOD-LAW-OF-WAR-MANUAL-JUNE-2015-UPDATED-JULY%202023.PDF" target="_blank">unlawful</a> for the U.S. military to intentionally <a href="https://media.defense.gov/2023/Jul/31/2003271432/-1/-1/0/DOD-LAW-OF-WAR-MANUAL-JUNE-2015-UPDATED-JULY%202023.PDF" target="_blank">kill</a> civilians who are not actively taking part in hostilities against the U.S. </p> <p dir="ltr">Ahead of Thursday’s vote, Sen. James Risch, R-Idaho, defended the administration’s “decisive actions to protect thousands of Americans from lethal narcotics.” </p> <p dir="ltr">“Some Democrat members and members of the media claim that President Trump does not have authority to conduct these strikes. I’ll tell you right now, that is plain wrong,” said Risch, chair of the Senate Committee on Foreign Relations.</p> <p dir="ltr">Risch said he and fellow Senate Republicans have sat through “hours of briefings and analysis by government legal departments and attorneys” regarding the strikes.</p> <p dir="ltr">Schiff and Kaine told reporters their access to information and briefings has been more limited.</p> <h4>Paul criticizes Trump moves</h4> <p dir="ltr">On the Senate floor ahead of the vote, Paul compared the strikes and buildup in the Caribbean to the U.S. military’s “misguided” intervention in the Middle East.</p> <p dir="ltr">“We owe it to our service members to only send them into harm’s way when vital American interests are at stake. Who is in charge of Venezuela does not constitute such an interest,” Paul said, alleging the strikes are about regime change in the South American nation ruled by dictator Nicolás Maduro.</p> <p dir="ltr">  “We overthrew Sadam Hussein thinking Iraq would be transformed into this great Jeffersonian democracy. Instead what occurred was an insurgency that led to some of the most brutal sectarian violence in living memory,” Paul said.</p> <p dir="ltr">Congress passed the War Powers Resolution in 1973 after the Nixon administration secretly bombed Vietnam and Cambodia, <a href="https://gsp.yale.edu/sites/default/files/walrus_cambodiabombing_oct06.pdf" target="_blank">killing hundreds of thousands of people.</a> </p> "
"enclosure": {
}
"categories": [
"D.C. Bureau"
"Adam Schiff"
"Central Intelligence Agency (CIA)"
"Congress"
"Peter Hegseth"
"President Donald Trump"
"U.S. Senate"
"Venezuela"
"War Powers Resolution"
]
}
{
"title": "Alabama bill would further restrict communications for sex offenders"
"pubDate": "2025-11-07 13:01:48"
"link": "https://alabamareflector.com/2025/11/07/alabama-bill-would-further-restrict-communications-for-sex-offenders/"
"guid": "https://alabamareflector.com/?p=16871"
"author": "Ralph Chapoco"
"thumbnail": ""
"description": "An Alabama legislator has prefiled a bill that would allow parole officers to restrict the communications of people convicted of a sexual offense against children and require them to undergo treatment. HB 26, sponsored by Mack Butler, R-Rainbow City, authorizes parole and probation officers to restrict people listed on the sexual offense registry from using […]"
"content": " <img width="1024" height="683" src="https://alabamareflector.com/wp-content/uploads/2025/04/IMG_9035-1024x683.jpg" class="attachment-large size-large wp-post-image" alt="" decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2025/04/IMG_9035-1024x683.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/04/IMG_9035-300x200.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/04/IMG_9035-768x512.jpg 768w, https://alabamareflector.com/wp-content/uploads/2025/04/IMG_9035-1536x1024.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2025/04/IMG_9035.jpg 1920w" sizes="(max-width: 1024px) 100vw, 1024px"><p>Rep. Mack Butler, R-Rainbow City, speaking to the House Education Policy Committee on April 9, 2025, in the Alabama House in Montgomery, Alabama. Butler has prefiled a bill for the 2026 legislative session that could require people who commit sex crimes against children to undergo a polygraph exam and prohibit them from having a post office box. (Anna Barrett/Alabama Reflector)</p> <p>An Alabama legislator has prefiled a bill that would allow parole officers to restrict the communications of people convicted of a sexual offense against children and require them to undergo treatment.</p> <p><a href="https://alison.legislature.state.al.us/files/pdf/SearchableInstruments/2026RS/HB26-int.pdf" target="_blank">HB 26</a>, sponsored by Mack Butler, R-Rainbow City, authorizes parole and probation officers to restrict people listed on the sexual offense registry from using a post office box or electronic media, including computer tablets and cell phones and smart phones. It also allows the court or the Alabama Board of Pardons and Paroles to require them to complete polygraph examinations.</p> <p>“It gives them another tool in the toolbox,” Butler said in an interview on Tuesday. “It is a pretty disgusting crime.”</p> <a href="https://alabamareflector.com/subscribe"> <div class="subscribeShortcodeContainer"> <div class="subscribeTextContainer"> <i class="fas fa-envelope"></i> <p>GET THE MORNING HEADLINES.</p> </div> <div class="subscribeButtonContainer"> <button>SUBSCRIBE</button> </div> </div> </a> <p>Butler introduced a similar bill in the 2025 legislative session that passed the House but did not come to a vote in the Senate.</p> <p>HB 26 also allows the court or the Alabama Board of Pardons and Paroles to order an offender to receive mental health treatment, which could also include recurring polygraph examinations.</p> <p>People who fail to report to treatment could be found guilty of a Class C felony, punishable by up to 10 years in prison and a $15,000 fine.</p> <p>“It is just another level of accountability,” Butler said. “The polygraph people came to me with that. We are seeing other states putting that in because, apparently, people are lying to you.”</p> <p>Experts and defense attorneys agreed with the treatment requirement but expressed doubts about other elements of the legislation.</p> <p>Kerry McCarthy, clinical director at Wandering Pines Wellness, an organization based in Colorado that provides mental health counseling services, provided  therapy to people who had been convicted of sexual-based offenses for seven years. He took issue with restricting people’s access to communication devices.</p> <p>“Those all sound like really good tools to limit access and availability to problematic content, but they are not research and evidenced based,” she said. “They also create hindrances for individuals to pay their bills. A lot of things are online. A lot of jobs require you to fill out an online application.”</p> <p>Kyle Pierce, a criminal defense lawyer with Pierce and Pierce Attorneys, based in Gadsden and Birmingham, expressed concerns with the polygraph component.</p> <p>“This requirement to go do this polygraph, pay for it twice a year, so it is adding a significant financial burden, a significant time burden, on people who are already having to regularly register, to pay every time that they register,” he said. “Polygraphs are bad science; polygraphs are not admissible in court. I can’t see the benefit of the required polygraph testing.”</p> <p>The Alabama Legislature begins its 2026 session on Jan. 13.</p> "
"enclosure": {
}
"categories": [
"Criminal justice"
"Alabama Board of Pardons and Paroles"
"Alabama House of Representatives"
"Alabama Legislature"
"Alabama politics"
"Alabama Senate"
"Mack Butler"
"sexual assault"
]
}
{
"title": "States’ death penalty policies are heading in sharply different directions"
"pubDate": "2025-11-07 12:57:28"
"link": "https://alabamareflector.com/2025/11/07/repub/states-death-penalty-policies-are-heading-in-sharply-different-directions/"
"guid": "https://alabamareflector.com/?post_type=republished&amp;p=16858"
"author": "Amanda Watford"
"thumbnail": ""
"description": "States are moving in sharply different directions on the death penalty, with some looking to broaden when and how executions occur while others try to scale them back or end them entirely. Lawmakers in more than half of the states have introduced over 100 bills this year to either expand or limit capital punishment, to […]"
"content": " <img width="1024" height="683" src="https://alabamareflector.com/wp-content/uploads/2025/11/San-Quentin-chamber.jpg" class="attachment-large size-large wp-post-image" alt="Corrections staff dismantle the death row lethal injection facility at San Quentin State Prison." decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/San-Quentin-chamber.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/San-Quentin-chamber-300x200.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/San-Quentin-chamber-768x512.jpg 768w" sizes="(max-width: 1024px) 100vw, 1024px"><p>Corrections staff dismantle the death row lethal injection facility at San Quentin State Prison in San Quentin, Calif., in 2019 after Democratic Gov. Gavin Newsom announced a moratorium on the state’s death penalty. California is one of four states with moratoriums in place. (Photo by California Department of Corrections and Rehabilitation via Getty Images)</p> <p>States are moving in sharply different directions on the death penalty, with some looking to broaden when and how executions occur while others try to scale them back or end them entirely.</p> <p>Lawmakers in more than half of the states have <a href="https://deathpenaltyinfo.org/facts-and-research/data/recent-legislative-activity" target="_blank" rel="noopener">introduced</a> over 100 bills this year to either expand or limit capital punishment, to alter execution protocols, and to change how death sentences are imposed, according to the Death Penalty Information Center, a nonprofit that studies capital punishment. The group does not take a position on the death penalty, but it is critical of how it is carried out.</p> <p>Some of the bills seeking to expand the death penalty would have included crimes that have been hot-button issues, such as the killing of police officers, sexual offenses against children, abortion and crimes committed by people living in the country illegally. Lawmakers in at least seven states this year also have attempted to legalize alternative methods of execution.</p> <p>Earlier in the year, however, some <a href="https://stateline.org/2025/03/07/trumps-death-penalty-push-faces-resistance-in-some-red-states/" target="_blank">Republican</a> legislators in conservative states — including Indiana, Kansas, Kentucky, Ohio and Oklahoma — proposed measures to abolish the death penalty or impose moratoriums to halt pending and future executions. None of those efforts advanced through their legislatures.</p> <p>Georgia, meanwhile, enacted a law barring the execution of people with intellectual disabilities.</p> <p>Nationally, and with about two months left in the year, states have carried out 41 executions. This marks the largest number of executions in the nation since 2012, when there were 43. Five more are scheduled in Florida, Oklahoma, South Carolina and Tennessee.</p> <p>“Executions mark a particular moment in time. They mark the punitiveness of the moment. … It’s no surprise to me to see execution spiking,” Corinna Lain, a law professor at the University of Richmond, told Stateline. Lain also is the author of the book “Secrets of the Killing State: The Untold Story of Lethal Injection.”</p> <p>The surge in executions comes as President Donald Trump has encouraged use of the death penalty. On his first day in office in January, he signed an <a href="https://www.whitehouse.gov/presidential-actions/2025/01/restoring-the-death-penalty-and-protecting-public-safety/" target="_blank" rel="noopener">executive order</a> ending the Biden-era federal moratorium on executions and directing the U.S. attorney general to seek the death penalty “for all crimes of a severity demanding its use.”</p> <p>The order requires federal prosecutors to pursue capital punishment in two circumstances — when a law enforcement officer is killed or when the accused is an immigrant living in the country illegally — regardless of other factors. It also instructs the U.S. Department of Justice to help states obtain lethal injection drugs, though it remains unclear how it would do so.</p> <p>Stateline asked the Department of Justice whether U.S. Attorney General Pam Bondi has taken any steps to help states obtain lethal injection drugs. The department declined to comment.</p> <p>Trump’s January executive order further calls on the U.S. attorney general to urge state and local prosecutors to pursue the death penalty in all eligible cases and to seek the reversal of Supreme Court precedents that limit state and federal authority to impose capital punishment.</p> <p>The order applies only to federal crimes; states set their own death penalty laws.</p> <p>Since 2009, seven states — Colorado, Connecticut, Illinois, Maryland, New Hampshire, New Mexico and Virginia — have legislatively <a href="https://www.ncsl.org/civil-and-criminal-justice/states-and-capital-punishment" target="_blank" rel="noopener">abolished</a> the death penalty, according to the National Conference of State Legislatures.</p> <p>Twenty-seven states allow the death penalty, but four — California, Ohio, Oregon and Pennsylvania — have paused executions.</p> <p>Seventeen death penalty-related bills were enacted into law this year across nine states, according to the Death Penalty Information Center’s <a href="https://deathpenaltyinfo.org/facts-and-research/data/recent-legislative-activity" target="_blank" rel="noopener">legislative tracker</a>: Alabama, Arkansas, Florida, Georgia, Idaho, Illinois, Louisiana, North Carolina and Oklahoma. Seven of those laws expand death eligibility or add aggravating factors for capital cases. Others focus on limiting eligibility, modifying execution protocols — including adding alternative methods of execution — or changing the appeals process.</p> <p>Despite the surge in executions this year, the number of new death sentences imposed on convicted murderers continues to fall amid concerns about how executions are carried out, and because prosecutors are seeking the punishment less often. And both the number of executions and new sentences remain far below their historic highs in the 1990s.</p> <p>“Death sentencing is falling in the United States for reasons that an executive order cannot fix,” Lain said.</p> <h4 class="editorialSubhed">‘Iryna’s Law’</h4> <p>One of the most sweeping measures this year came out of North Carolina.</p> <p>Known as “Iryna’s Law,” it makes broad changes to the state’s criminal code following the August <a href="https://ncnewsline.com/2025/09/11/nc-republican-leaders-pledge-to-address-soft-on-crime-policies-after-charlotte-transit-stabbing/" target="_blank" rel="noopener">killing</a> of Iryna Zarutska on Charlotte’s light rail system. The law <a href="https://ncnewsline.com/2025/09/23/nc-lawmakers-pass-crime-bill-as-partisan-divides-on-death-penalty-mental-health-drive-debate/" target="_blank" rel="noopener">imposes</a> stricter pretrial release conditions on defendants, mandates mental health evaluations for some defendants, shortens appeal timelines in capital cases and adds new execution methods.</p> <p>“I hope we can finally get justice for victims’ families and for the people of North Carolina,” Republican state Sen. Phil Berger said in a <a href="https://bergerpress.medium.com/senate-republicans-approve-measure-to-revive-death-penalty-in-north-carolina-a0b569eca0bc" target="_blank" rel="noopener">news release</a>. Berger has long backed efforts to resume executions in North Carolina. The state has not carried out an execution since 2006. There are 122 people on North Carolina’s <a href="https://www.dac.nc.gov/divisions-and-sections/institutions/death-penalty/death-row-roster" target="_blank" rel="noopener">death row</a>.</p> <p>Under the law, courts must schedule hearings for any capital case filings older than two years by December 2026 and resolve them by the end of 2027 — an accelerated timeline aimed at moving stalled cases through the system. The measure also adds a new aggravating factor allowing prosecutors to seek the death penalty for murders committed on public transportation.</p> <p>The law lifts state bans on electrocution and lethal gas as execution methods, though it keeps lethal injection as the primary method. If lethal injection were to be ruled unconstitutional, the state could adopt any execution method used elsewhere that has not been struck down by the U.S. Supreme Court.</p> <p>Democratic Gov. Josh Stein <a href="https://ncnewsline.com/2025/10/03/stein-signs-gop-led-north-carolina-crime-bill-despite-calling-death-penalty-changes-barbaric/" target="_blank" rel="noopener">signed</a> the measure into law in October, but raised concerns about the provisions that open the possibility of alternative execution methods.</p> <p>“It’s barbaric,” Stein said in a <a href="https://www.youtube.com/watch?v=AAmVa3tzXrI" target="_blank" rel="noopener">video</a> explaining his decision to sign the bill. “There will be no firing squads in North Carolina during my time as governor.”</p> <p>Florida has led the nation with 15 executions so far in 2025. Alabama and Texas have had the second-highest number of executions this year, with five each. The vast majority of executions this year occurred in Southern states, with only five taking place elsewhere — two in Arizona, two in Indiana and one in Missouri.</p> <p>States have faced chronic shortages of lethal injection drugs for years, and many manufacturers and pharmacies refuse to supply them for ethical reasons. Combined with high costs and drugs that often expire before use, these challenges have forced delays, cancellations or the use of alternative execution methods.</p> <p>Executions often occur decades after the original sentence, as people on death row may spend up to 30 years exhausting their appeals. Nationally, nearly 2,100 people are currently on death row, according to the Death Penalty Information Center.</p> <h4 class="editorialSubhed">Legal precedents</h4> <p>Expanding the death penalty to crimes beyond murder has become a central focus of federal and state officials seeking to reshape capital punishment laws.</p> <p>A key precedent comes from the 2008 Supreme Court case Kennedy v. Louisiana, in which the court <a href="https://supreme.justia.com/cases/federal/us/554/407/" target="_blank" rel="noopener">ruled</a> it unconstitutional to impose the death penalty for crimes other than homicide or crimes against the state. In that case, a man had been given the death penalty after raping his then-8-year-old stepdaughter.</p> <p>In September, Florida Attorney General James Uthmeier led 15 Republican state attorneys general in sending a <a href="https://drive.google.com/file/d/1udd5fSCJN_S9z6KWJwCnRQA7LIZSmtJG/view?usp=sharing" target="_blank" rel="noopener">letter</a> to Bondi and White House counsel David Warrington, seeking federal support to challenge Supreme Court precedent and uphold death sentences for child rape.</p> <p>“We believe repairing Kennedy’s flawed outcome is within the power of the States,” the attorneys general wrote.</p> <p>The letter cited Trump’s January executive order and noted the recent enactment of state laws authorizing the death penalty for child sexual abuse in several states, including Arkansas, Florida and Tennessee. This year, both Idaho and Oklahoma made sexual assaults of children offenses eligible for death.</p> <p>“For many victims, the pain and trauma never fully go away,” Arkansas Attorney General Tim Griffin, a Republican, wrote in an email to Stateline. “The death penalty is entirely appropriate and necessary to deter future wrongdoers and achieve justice for the victims.”</p> <p>Griffin also wrote that he hopes to bring a case before the Supreme Court to challenge the Kennedy precedent in the future.</p> <h4 class="editorialSubhed">Sentencing trends</h4> <p>So far this year, 16 people across the country have been sentenced to death — one of the lowest totals in more than a decade, according to Lain, who independently tracks new death sentences. In 2024, 26 people were sentenced to death.</p> <p>She said this reflects a long-term shift: Juries and prosecutors are seeking the death penalty less often, but the states that continue to use it are doing so more aggressively.</p> <p>“Today’s death sentences are tomorrow’s executions,” Lain said in an interview. “If you don’t have new death sentences feeding the machinery of death, the death penalty will die on the vine.”</p> <p>The push to expand the death penalty comes as support for it has waned. A <a href="https://news.gallup.com/poll/1606/death-penalty.aspx" target="_blank" rel="noopener">Gallup poll</a> in October found 52% of Americans back capital punishment for murder, down sharply from 80% in 1994.</p> <p>Critics have long highlighted persistent racial disparities and the risk of wrongful convictions. Since 1973, at least 201 former death row prisoners have been exonerated, and about 40% of current death row inmates are Black, according to the Death Penalty Information Center.</p> <p>A 2024 <a href="https://reprieve.org/wp-content/uploads/sites/2/2024/04/2024_04_17_PUB-Botched-lethal-injection-report-FINAL.pdf" target="_blank" rel="noopener">analysis</a> by the nonprofit Reprieve, which advocates against the death penalty, found that since 1982, 8% of lethal injection executions of Black people were botched, compared with 4% of executions of white people. Lethal injection is the most commonly used execution method across the country, though it is also the method with the most recorded botches or mistakes.</p> <p>The high costs of imprisoning death row inmates, buying lethal injection drugs from unregulated “gray market” compounding pharmacies and navigating decades-long appeals — along with questions about the death penalty’s effectiveness as a deterrent and the secrecy surrounding how executions are carried out — have cast uncertainty over the future of capital punishment across the states.</p> <p>Indiana Republican Gov. Mike Braun <a href="https://indianacapitalchronicle.com/2025/06/24/braun-clarifies-indiana-acquisition-of-execution-drugs-reveals-more-than-1m-spent/" target="_blank" rel="noopener">revealed</a> in June that the state spent nearly $1.2 million on four doses of execution drugs, half of which — $600,000 worth — expired before they could be used.</p> <p>Braun said he does not plan to purchase more drugs, <a href="https://indianacapitalchronicle.com/2025/06/04/braun-says-indiana-is-out-of-execution-drugs-signals-willingness-to-debate-capital-punishment/" target="_blank" rel="noopener">saying</a>, “[S]omething that costs, I think, $300,000 a pop that has a 90-day shelf life — I’m not going to be for putting it on the shelf and then letting them expire.”</p> <p>Idaho has faced similar challenges. In court filings, state officials <a href="https://www.idahostatesman.com/news/local/crime/article305576681.html" target="_blank" rel="noopener">said</a> they spent $200,000 on execution drugs that went unused, and a new facility for firing squad executions is expected to cost more than $1 million.</p> <p>In Texas, state officials have spent more than $775,000 on pentobarbital, one of the commonly used drugs in lethal injections, since October 2024, according to records obtained by <a href="https://www.nbcnews.com/news/us-news/texas-new-details-execution-drug-underscore-closely-guarded-secret-rcna236168" target="_blank" rel="noopener">NBC News</a>. Tennessee spent $600,000 on lethal injection drugs between 2017 and March 2025, according to records obtained by <a href="https://www.tennessean.com/story/news/crime/2025/03/20/tennessee-death-row-lethal-injection-pentobarbital/82517783007/?gnt-cfr=1&amp;gca-cat=p&amp;gca-uir=true&amp;gca-epti=z115347p002450c002450d00----v115347b0043xxd004365&amp;gca-ft=156&amp;gca-ds=sophi&amp;sltsgmt=0154_A" target="_blank" rel="noopener">The Tennessean</a>. During that period, the state carried out two executions via lethal injection.</p> <p>“At some point, states have to look at the death penalty and say, ‘Is it worth the money?’” Lain said.</p> <p><em>Stateline reporter Amanda Watford can be reached at <a href="mailto:ahernandez@stateline.org">ahernandez@stateline.org</a>.</em></p> <div class="snrPubNote"> <p>This story was originally produced by <a href="https://stateline.org/2025/11/06/states-death-penalty-policies-are-heading-in-sharply-different-directions/" target="_blank">Stateline</a>, which is part of States Newsroom, a nonprofit news network which includes Alabama Reflector, and is supported by grants and a coalition of donors as a 501c(3) public charity.</p> </div> "
"enclosure": {
}
"categories": [
"Criminal justice"
"Alabama Legislature"
"Alabama politics"
"Crime"
"Death penalty"
"executions"
"Law enforcement"
"lethal injection"
]
}
{
"title": "Auburn University apologizes for accidentally sending shooter, tornado, hazmat alerts"
"pubDate": "2025-11-06 21:32:05"
"link": "https://alabamareflector.com/briefs/auburn-university-apologizes-for-accidentally-sending-shooter-tornado-hazmat-alerts/"
"guid": "https://alabamareflector.com/?post_type=briefs&amp;p=16872"
"author": "Anna Barrett"
"thumbnail": ""
"description": "Auburn University apologized for accidentally sending three emergency alerts to students and employees about an active shooter, a tornado and a hazardous waste spill within the space of minutes early Thursday afternoon. “The alerts were triggered unintentionally, and we are actively working to resolve the issue to prevent future occurrences,” the university said in a […]"
"content": " <img width="1024" height="682" src="https://alabamareflector.com/wp-content/uploads/2023/08/Auburn-University-04-1024x682.jpg" class="attachment-large size-large wp-post-image" alt="A sign saying Auburn University, Established 1856." decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2023/08/Auburn-University-04-1024x682.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2023/08/Auburn-University-04-300x200.jpg 300w, https://alabamareflector.com/wp-content/uploads/2023/08/Auburn-University-04-768x512.jpg 768w, https://alabamareflector.com/wp-content/uploads/2023/08/Auburn-University-04-1536x1024.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2023/08/Auburn-University-04.jpg 2000w" sizes="(max-width: 1024px) 100vw, 1024px"><p>A sign for Auburn University seen on August 14, 2023 in Auburn, Alabama. Behind the sign is William J. Samford Hall. The university apologized Thursday for accidental emergency alerts that were sent to students and employees. (Brian Lyman/Alabama Reflector)</p> <p><span>Auburn University apologized for accidentally sending three emergency alerts to students and employees about an active shooter, a tornado and a hazardous waste spill within the space of minutes early Thursday afternoon.</span></p> <p><span>“The alerts were triggered unintentionally, and we are actively working to resolve the issue to prevent future occurrences,” the university said in a statement </span><a href="https://x.com/AuburnU/status/1986499579953512855" target="_blank"><span>posted to social media</span></a><span>. “We understand that the alerts may have caused concern or alarm, and we sincerely apologize for any confusion.”</span></p> <p><span>The alerts were sent over the span of about 20 minutes, according to reports on social media. Jennifer Adams, the university’s vice president for public affairs, communication and marketing, wrote in an email Thursday afternoon that alerts may continue to go out.</span></p> <p><span>“Please be assured that there is no threat to campus or the community,” she said. </span></p> "
"enclosure": {
}
"categories": [
"Education"
"active shooter"
"Auburn"
"Auburn University"
"emergency alerts"
"tornadoes"
]
}
{
"title": "Here are airports hit by the FAA pullback on air traffic; 3,300 flights daily to be canceled"
"pubDate": "2025-11-06 20:54:55"
"link": "https://alabamareflector.com/2025/11/06/repub/here-are-airports-hit-by-the-faa-pullback-on-air-traffic-3300-flights-daily-to-be-canceled/"
"guid": "https://alabamareflector.com/?post_type=republished&amp;p=16868"
"author": "Jacob Fischler"
"thumbnail": ""
"description": "The 40 airports set to see a 10% reduction in flights during the government shutdown nearly matched the list of the nation’s busiest airports, according to a preliminary list seen by States Newsroom, potentially leading to thousands of flight cancellations across the country. A 10% reduction at the listed airports would mean 3,300 canceled flights […]"
"content": " <img width="1024" height="683" src="https://alabamareflector.com/wp-content/uploads/2025/11/airport2025-1024x683.jpg" class="attachment-large size-large wp-post-image" alt="People sit in front of windows looking out on the tarmac at Salt Lake City International Airport in Salt Lake City on April 3, 2024. (Photo by Spenser Heaps/Utah News Dispatch)" decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/airport2025-1024x683.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/airport2025-300x200.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/airport2025-768x512.jpg 768w, https://alabamareflector.com/wp-content/uploads/2025/11/airport2025-1536x1024.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2025/11/airport2025-2048x1366.jpg 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>People sit in front of windows looking out on the tarmac at Salt Lake City International Airport in Salt Lake City on April 3, 2024. (Photo by Spenser Heaps/Utah News Dispatch)</p> <p dir="ltr">The 40 airports set to see a 10% reduction in flights during the government shutdown nearly matched the list of the nation’s busiest airports, according to a preliminary list seen by States Newsroom, potentially leading to thousands of flight cancellations across the country.</p> <p dir="ltr">A 10% reduction at the listed airports would mean 3,300 canceled flights per day, according to Airports Council International-North America, the trade group for airports.</p> <p dir="ltr">The Federal Aviation Administration had not released an official list of airports by early Thursday afternoon, but three sources familiar with the matter provided tables listing the proposed airports.</p> <p dir="ltr">U.S. Transportation Secretary Sean Duffy said Wednesday that the FAA would cut air traffic at 40 major airports starting Friday to help alleviate stress for air traffic controllers who have been working without pay since the federal government shut down on Oct 1.</p> <p dir="ltr">The airports on the preliminary list are: </p> <ul> <li dir="ltr" aria-level="1">Anchorage, Alaska</li> <li dir="ltr" aria-level="1">Atlanta</li> <li dir="ltr" aria-level="1">Baltimore</li> <li dir="ltr" aria-level="1">Boston</li> <li dir="ltr" aria-level="1">Charlotte, North Carolina</li> <li dir="ltr" aria-level="1">Chicago Midway</li> <li dir="ltr" aria-level="1">Chicago O’Hare</li> <li dir="ltr" aria-level="1">Cincinnati/Northern Kentucky</li> <li dir="ltr" aria-level="1">Dallas/Forth Worth International</li> <li dir="ltr" aria-level="1">Dallas Love Field</li> <li dir="ltr" aria-level="1">Denver</li> <li dir="ltr" aria-level="1">Detroit</li> <li dir="ltr" aria-level="1">Fort Lauderdale/Hollywood, Florida</li> <li dir="ltr" aria-level="1">Honolulu</li> <li dir="ltr" aria-level="1">Houston George Bush Intercontinental</li> <li dir="ltr" aria-level="1">Houston W.P. Hobby</li> <li dir="ltr" aria-level="1">Indianapolis</li> <li dir="ltr" aria-level="1">Las Vegas</li> <li dir="ltr" aria-level="1">Louisville, Kentucky</li> <li dir="ltr" aria-level="1">Los Angeles</li> <li dir="ltr" aria-level="1">Miami</li> <li dir="ltr" aria-level="1">Minneapolis/St. Paul</li> <li dir="ltr" aria-level="1">Memphis, Tennessee</li> <li dir="ltr" aria-level="1">Newark, New Jersey</li> <li dir="ltr" aria-level="1">New York LaGuardia International</li> <li dir="ltr" aria-level="1">New York John F. Kennedy International</li> <li dir="ltr" aria-level="1">Orlando, Florida</li> <li dir="ltr" aria-level="1">Oakland, California</li> <li dir="ltr" aria-level="1">Ontario, California</li> <li dir="ltr" aria-level="1">Portland, Oregon</li> <li dir="ltr" aria-level="1">Philadelphia</li> <li dir="ltr" aria-level="1">Phoenix</li> <li dir="ltr" aria-level="1">San Diego</li> <li dir="ltr" aria-level="1">San Francisco</li> <li dir="ltr" aria-level="1">Salt Lake City</li> <li dir="ltr" aria-level="1">Seattle/Tacoma</li> <li dir="ltr" aria-level="1">Teterboro, New Jersey</li> <li dir="ltr" aria-level="1">Tampa, Florida</li> <li dir="ltr" aria-level="1">Washington, D.C. Reagan National and Dulles International, both in Northern Virginia</li> </ul> <h4>Busy Nashville, Raleigh-Durham not on list</h4> <p dir="ltr">While there is significant overlap of the list with the nation’s busiest airports, there are some exceptions. </p> <p dir="ltr">The busiest passenger airport not included was in Nashville, Tennessee, the 28th-busiest airport in the country in 2024, according to Airports Council International-North America.</p> <p dir="ltr">Austin, Texas; St. Louis; Raleigh-Durham, North Carolina; Sacramento, California; New Orleans; Kansas City; and San Jose, California, were also among the 40 busiest airports that will not see reductions Friday.</p> <p dir="ltr">Memphis, Anchorage and Louisville rank outside the top 40 for passenger traffic, but are the top three for cargo movement.</p> <p dir="ltr">Oakland and Indianapolis ranked just outside the top 40 for passenger travel. Teterboro’s airport did not rank in the group’s top 50 busiest.</p> <h4>$327 million in daily economic output lost </h4> <p dir="ltr">A 10% reduction at the listed airports would decrease economic output at airports by about $327 million daily, according to the council.</p> <p dir="ltr">Because the reductions are to the nation’s busiest airports that serve as hubs for the major airlines, they will also affect airports that aren’t on the list but depend on flights to and from those hubs.</p> <p dir="ltr">The group’s president and CEO, Kevin M. Burke, said in a statement that the group and its members had adapted to quickly changing conditions during the shutdown, but that they were “reaching a breaking point.”</p> <p dir="ltr">“The current trajectory is unsustainable,” Burke said. “With the busy holiday season on the horizon, Congress and the administration must come together now to reopen the federal government with a clean, bipartisan continuing resolution, pay federal employees, and restore operational certainty for the millions of air travelers who take to the skies every day.”</p> <h4>Prioritizing safety</h4> <p dir="ltr">At a press conference Wednesday, Duffy said the decision was made to keep flying safe. He urged overworked air traffic controllers not to work second jobs, but was “not naive” that many would have to in order to pay their bills.</p> <p dir="ltr">He said the agency’s decision was made to prevent any accidents that could result from overworked controllers, while assuring the flying public that commercial air travel remained extremely safe.</p> <p dir="ltr">President Donald Trump was less explicit during an Oval Office appearance Thursday. </p> <p dir="ltr">“Fair question,” he said when asked by a reporter if flying remained safe. “Sean Duffy announced they’re cutting in certain areas 10%, and they want to make sure it’s 100% safe. That’s why they’re doing it.”</p> <h4>Dems call for shutdown end</h4> <p dir="ltr">Some Democratic lawmakers, who have blocked a bill to temporarily reopen the government at fiscal 2025 levels in an effort to force Republicans to negotiate an extension to tax credits for insurance purchased on the Affordable Care Act marketplace, renewed those calls in light of the FAA’s decision.</p> <p dir="ltr">Sen. Tina Smith, a Minnesota Democrat, said in a statement the Minneapolis-St. Paul International Airport sees a daily average of 60,000 passengers on 750 flights.</p> <p dir="ltr">She called on Trump and House Speaker Mike Johnson, R-La., to negotiate with her party on the expiring health insurance tax credits to reopen the government “so we don’t see the impacts like the ones at MSP.”</p> <p dir="ltr">“The only path forward is through negotiating, so air traffic in the skies above Minnesota and the country can keep operating safely and at full capacity and our government can finally open up again,” she said.</p> <p dir="ltr">House Transportation and Infrastructure ranking Democrat Rick Larsen of Washington state called the Duffy move “drastic and unprecedented” and requested the FAA share data that went into the decision. </p> <p dir="ltr">He also called for an end to the shutdown to allow air traffic controllers to be paid.</p> <p dir="ltr">“Shutting down parts of our National Airspace System is a dramatic and unprecedented step that demands more transparency,” he said. “The FAA must immediately share any safety risk assessment and related data that this decision is predicated on with Congress. If we want to resolve issues in the NAS, let us fix health care, open government and pay transportation and aviation safety workers.”</p> "
"enclosure": {
}
"categories": [
"D.C. Bureau"
"2025 federal government shutdown"
"Affordable Care Act"
"air traffic"
"Air traffic control"
"Federal Aviation Administration"
"President Donald Trump"
"Sean Duffy"
]
}
{
"title": "Trump administration ordered to pay full $9B in November SNAP benefits amid shutdown"
"pubDate": "2025-11-06 19:09:32"
"link": "https://alabamareflector.com/2025/11/06/repub/usda-revises-snap-benefit-amounts-during-shutdown-after-admitting-miscalculation/"
"guid": "https://alabamareflector.com/?post_type=republished&amp;p=16865"
"author": "Jacob Fischler"
"thumbnail": ""
"description": "This report has been updated. A federal judge in Rhode Island ordered the Trump administration Thursday to pay roughly $9 billion for a full month of nutrition assistance benefits by the next day. Chief Judge John J. McConnell Jr., who was appointed by Democratic former President Barack Obama, said the administration blew its chance to […]"
"content": " <img width="1024" height="681" src="https://alabamareflector.com/wp-content/uploads/2025/11/shutdown-food-8_1-1024x681.jpg" class="attachment-large size-large wp-post-image" alt="A sign in a convenience store along Barlowe Road in Hyattsville, Maryland, on Oct. 28, 2025, advertises that it accepts SNAP benefits. (Photo by Ashley Murray/States Newsroom)" decoding="async" loading="lazy" srcset="https://alabamareflector.com/wp-content/uploads/2025/11/shutdown-food-8_1-1024x681.jpg 1024w, https://alabamareflector.com/wp-content/uploads/2025/11/shutdown-food-8_1-300x199.jpg 300w, https://alabamareflector.com/wp-content/uploads/2025/11/shutdown-food-8_1-768x511.jpg 768w, https://alabamareflector.com/wp-content/uploads/2025/11/shutdown-food-8_1-1536x1021.jpg 1536w, https://alabamareflector.com/wp-content/uploads/2025/11/shutdown-food-8_1-2048x1362.jpg 2048w" sizes="(max-width: 1024px) 100vw, 1024px"><p>A sign in a convenience store along Barlowe Road in Hyattsville, Maryland, on Oct. 28, 2025, advertises that it accepts SNAP benefits. (Photo by Ashley Murray/States Newsroom)</p> <p dir="ltr"><em>This report has been updated.</em></p> <p dir="ltr">A federal judge in Rhode Island ordered the Trump administration Thursday to pay roughly $9 billion for a full month of nutrition assistance benefits by the next day.</p> <p dir="ltr">Chief Judge John J. McConnell Jr., who was appointed by Democratic former President Barack Obama, said the administration blew its chance to choose to pay only partial benefits for the Supplemental Nutrition Assistance Program, or SNAP, when it failed to release funds by a Wednesday deadline.</p> <p dir="ltr">He said <a href="https://www.newsfromthestates.com/article/defiant-trump-vows-no-snap-payments-until-democrats-cave-shutdown" target="_blank">a social media post</a> by President Donald Trump showed the president sought to use hunger for political leverage during the government shutdown, which <a href="https://www.newsfromthestates.com/article/us-senate-talks-continue-end-37-day-shutdown-final-deal-elusive" target="_blank">stretched into day 37</a> on Thursday.</p> <p dir="ltr">Earlier, in a Friday oral order that he expanded in a Saturday written order, McConnell had said the government must either pay full benefits by Monday or partial benefits from a contingency fund by Wednesday. </p> <p dir="ltr">The government did neither, he said Thursday.</p> <p dir="ltr">The administration had argued it was impossible to pay the benefits, which go to 42 million Americans, within a few days, saying that the USDA had never calculated partial benefits and that coordinating new payments for SNAP, a federally funded program administered by the states, was difficult. </p> <p dir="ltr">The administration quickly appealed the ruling to the 1st Circuit U.S. Court of Appeals.</p> <p dir="ltr">“Today is a major victory for 42 million people in America. The court could not be more clear – the Trump-Vance administration must stop playing politics with people’s lives by delaying SNAP payments they are obligated to issue,” said Skye Perryman, President and CEO of Democracy Forward, co-counsel for the coalition challenging the administration.</p> <h4>‘USDA cannot now cry’</h4> <p dir="ltr">But McConnell said the department created the problem, in part by failing to prepare for it far earlier. USDA was obligated to spend from a contingency fund to ensure SNAP benefits flowed into November uninterrupted, he said. </p> <p dir="ltr">“USDA did not do so,” he said. “Even when Nov. 1 came, USDA refused to use the congressionally mandated contingency funds. USDA cannot now cry that it cannot get timely payments to beneficiaries for weeks or months because states are not prepared to make partial payments.</p> <p dir="ltr">“USDA arbitrarily and capriciously created this problem by ignoring the congressionally mandated contingency funds and failing to timely notify the states.”</p> <p dir="ltr">McConnell also pointed to Trump’s post on Truth Social on Tuesday that indicated he would not authorize payments consistent with the judge’s order until Democrats agreed to his terms to end the government shutdown.</p> <p dir="ltr">“The day before the compliance was ordered, the president stated his intent to defy the court order when he said, ‘SNAP payments will be given only when the government opens,’” McConnell said Thursday.</p> <h4>Child nutrition funding suggested</h4> <p dir="ltr">The USDA had said it would pay only partial November benefits from a contingency fund holding about $4.5 billion, rather than tap into other money at its disposal, including a $23 billion fund for child nutrition programs.</p> <p dir="ltr">The coalition of cities and nonprofit organizations that sued to force the administration to pay SNAP benefits for November has argued the court should force USDA to pay full benefits for November. </p> <p dir="ltr">In addition to the missed Wednesday deadline, the move violated a fundamental administrative law requiring federal agencies not to make arbitrary and capricious decisions, Kristin Bateman of the Democracy Forward Foundation, which is representing the groups, said Thursday.</p> <p dir="ltr">The child nutrition program would not need its billions of dollars until June, she said, meaning that transferring funds for SNAP would only actually hurt the child nutrition program if the shutdown persists until then.</p> <p dir="ltr">“A decision on such a highly unlikely set of events is not reasoned decision-making,” Bateman said. “It’s particularly unreasonable because the defendants have not explained why they would choose to let 42 million Americans, including 16 million children, go hungry now in order to guard against the extreme outside chance that come June, there won’t be enough money to fund child nutrition programs.”</p> <p dir="ltr">McConnell agreed that invoking the child nutrition fund was “entirely pretextual,” which was demonstrated in part by Trump’s post and other statements by administration officials.</p> <p dir="ltr">“The defendants’ stated desire to conserve funding for the child nutrition programs is entirely pretextual, given the numerous statements made in recent weeks by the president and his administration officials who admit to withholding full SNAP benefits for political reasons,” he said.</p> <p dir="ltr">McConnell also noted that the case should be resolved as soon as possible to help provide food to hungry people or “needless suffering will occur.”</p> <h4>‘A state problem’</h4> <p dir="ltr">Tyler Becker, who argued on behalf of the USDA, said the department had done its part by making available to states a table showing how they should allocate partial November benefits for households of differing circumstances.</p> <p dir="ltr">SNAP is a complex program, requiring coordination between the federal government and all 50 states, each of which has a different system for distributing benefits.</p> <p dir="ltr">“The government did make the payments, is making the payments to the states,” he said. “That’s all the government does in the SNAP program.”</p> <p dir="ltr">He added that the government had shown earlier in the case some of the administrative difficulties of paying partial benefits.</p> <p dir="ltr">In a separate case in Massachusetts federal court, some states said they could process the benefits immediately, while others cannot.</p> <p dir="ltr">“This is a state problem,” he said.</p> <p dir="ltr">But McConnell cut him off shortly after, saying the federal government was responsible for ensuring people got their SNAP benefits.</p> <p dir="ltr">“The problem that the government identified needed to be resolved one way or the other by Wednesday,” he said. “And if it wasn’t resolved by Wednesday, then you had to make the full payments, because that’s the only way we could get money to people immediately and alleviate the irreparable harm, whether you could or couldn’t do anything about that.”</p> <p dir="ltr">In a Sept. 30 contingency plan about how to proceed during a government shutdown, the USDA itself said it would pay for continuing benefits through the contingency fund, which at the time held $6 billion. The administration <a href="https://www.newsfromthestates.com/article/usda-wont-shuffle-funds-extend-snap-during-shutdown-about-face-earlier-plan" target="_blank">later reversed that plan</a> and said it could not tap the contingency fund.</p> <p dir="ltr">In the Massachusetts case, which was brought by 25 Democratic states and the District of Columbia, the states argued Thursday that confusion stemming from a miscalculation the USDA made in determining November partial benefits was a reason to force the administration to pay for a full month.</p> <h4>USDA corrects miscalculation</h4> <p dir="ltr">The hearing followed a late Wednesday night filing from the USDA correcting an error it made in calculating the amounts beneficiaries would receive under its plan for partial payments. </p> <p dir="ltr">The department said it will reduce the largest monthly food assistance payments by about 35% in November, down from a 50% cut the department initially estimated.</p> <p dir="ltr">USDA miscalculated how to adjust benefit payments for SNAP to account for a lack of full funding during the government shutdown, a department official said in <a href="https://www.documentcloud.org/documents/26218472-usdadocnov5/" target="_blank">a filing</a> to the U.S. District Court for Rhode Island. </p> <p dir="ltr">The formula the government initially used and sent to states Tuesday would have resulted in about a 50% cut to the maximum monthly benefits, and left some households without benefits. </p> <p dir="ltr">SNAP pays benefits on a sliding scale depending on the size of a household, the household’s income and other expenses such as housing. By cutting the maximum benefit by one-half, the department would have spent about $3 billion from a SNAP contingency fund instead of the full $4.65 billion in the fund, which is what the court ordered it to spend.</p> <p dir="ltr">The mixup created confusion for state administrators, the states in the Massachusetts litigation said.</p> <p dir="ltr">“The fact they have been asked to suddenly shift on a dime yet again as a result of these entirely new tables, causing further chaos and delay, underscores that USDA’s approach here is untenable and unlawful,” the states wrote in <a href="https://www.mass.gov/doc/snap-reply-brief/download" target="_blank">a Thursday brief</a>.</p> <p dir="ltr">The error was first reported to McConnell by the coalition of cities and nonprofit organizations that sued to force the government to pay SNAP benefits this month. </p> <h4>Think tank discovers discrepancy </h4> <p dir="ltr">An analysis submitted by Sharon Parrott, a former White House budget officer who now leads the left-leaning think tank Center for Budget and Policy Priorities, showed that the table the department submitted to the court and sent to states on Tuesday would fall short of the court’s order to spend the entire contingency fund.</p> <p dir="ltr">The groups said the department’s error was another reason the court should compel the government to transfer funds to pay out full benefits for November.</p> <p dir="ltr">“Defendants’ approach means that only around $3 billion—out of the $4.65 billion Defendants have said is available—will be spent on SNAP benefits in November, leaving more than $1.5 billion in contingency funds unspent,” they wrote in a Wednesday brief. “Defendants opted for partial (and delayed) SNAP payments, but even then, did not manage to do that correctly.”</p> <p dir="ltr">The department said in its filing later Wednesday that it independently discovered its miscalculation and worked to fix it before Parrott’s declaration hit the court docket.</p> <p dir="ltr">“Defendants realized this error and worked to issue new guidance and tables as soon as it was discovered, not in response to Plaintiffs’ notice filed earlier this evening,” USDA’s brief said.</p> "
"enclosure": {
}
"categories": [
"D.C. Bureau"
"2025 federal government shutdown"
"Federal judiciary of the United States"
"Food insecurity"
"President Donald Trump"
"Supplemental Nutritional Assistance Program (SNAP)"
"U.S. Department of Agriculture (USDA)"
"U.S. Department of Justice"
]
}
]
}
