{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "House committee passes bill allowing public K-12 schools to have volunteer chaplains",
      "link": "https://alabamareflector.com/2026/02/04/house-committee-passes-bill-allowing-public-k-12-schools-to-have-volunteer-chaplains/",
      "thumbnail": "",
      "description": "Rep. Mark Gidley, R-Hokes Bluff, listens during a session of the Alabama House of Representatives on Tuesday, March 14, 2023. An Alabama House committee Wednesday approved a bill sponsored by Gidley that would allow chap..."
    },
    {
      "title": "Top Dems in Congress list ICE constraints they want in funding bill",
      "link": "https://alabamareflector.com/2026/02/04/repub/top-dems-in-congress-list-ice-constraints-they-want-in-funding-bill/",
      "thumbnail": "",
      "description": "A demonstrator waves a red cloth as hundreds gather after ICE agent Jonathan Ross shot and killed Renee Good through her car window Wednesday, Jan. 7, 2026 near Portland Avenue South and East 34th Street in Minneapolis. ..."
    },
    {
      "title": "Alabama House committee OKs bill criminalizing intentional church service disruptions",
      "link": "https://alabamareflector.com/2026/02/04/alabama-house-committee-oks-bill-criminalizing-intentional-church-service-disruptions/",
      "thumbnail": "",
      "description": "Rep. Greg Barnes, R-Curry, voting on a local bill in the Alabama House of Representatives on Jan. 21, 2026, in Montgomery, Alabama, in the Alabama State House. A House committee Wednesday approved a bill sponsored by Bar..."
    },
    {
      "title": "States move to ban NDAs that silence survivors of child sexual abuse",
      "link": "https://alabamareflector.com/2026/02/04/repub/states-move-to-ban-ndas-that-silence-survivors-of-child-sexual-abuse/",
      "thumbnail": "",
      "description": "Alabama state Sen. Matt Woods, a Republican, speaks to a colleague on the floor of the Alabama Senate in January. The Senate passed a bill Woods sponsored that would prohibit civil courts from issuing nondisclosure agree..."
    },
    {
      "title": "Family of Renee Good, citizens hurt by DHS detail violence to Democratic panel",
      "link": "https://alabamareflector.com/2026/02/04/repub/family-of-renee-good-citizens-hurt-by-dhs-detail-violence-to-democratic-panel/",
      "thumbnail": "",
      "description": "Brent Ganger, far left, and Luke Ganger, second from left, brothers of Renee Good, watch a forum on Department of Homeland Security use of force organized by congressional Democrats on Feb. 3, 2026. Good was killed by a ..."
    },
    {
      "title": "Alabama Senate passes bill banning stricter state environmental rules than federal government",
      "link": "https://alabamareflector.com/2026/02/04/alabama-senate-passes-bill-banning-stricter-state-environmental-regulations-than-federal-government/",
      "thumbnail": "",
      "description": "Sen. Donnie Chesteen, R-Geneva, left, talking to Sen. Rodger Smitherman, D-Birmingham, on the floor of the Alabama Senate in the Alabama Statehouse in Montgomery, Alabama, on Feb. 3, 2026. The Senate passed Chesteen's bi..."
    },
    {
      "title": "Alabama House OKs bill restricting some self-defense arguments in court cases",
      "link": "https://alabamareflector.com/2026/02/04/alabama-house-oks-bill-restricting-some-self-defense-arguments-in-court-cases/",
      "thumbnail": "",
      "description": "Rep. David Faulkner, R-Mountain Brook, speaks during a debate in the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House of Representatives Tuesday passed ..."
    },
    {
      "title": "Alabama House approves bill banning foreign campaign contributions",
      "link": "https://alabamareflector.com/briefs/alabama-house-approves-bill-banning-foreign-campaign-contributions/",
      "thumbnail": "",
      "description": "Rep. James Lomax, R-Huntsville, stands on the floor of the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House of Representatives Tuesday approved a bill sponsored..."
    },
    {
      "title": "Kristin Nelson wins House District 38 special election in Chambers, Lee counties",
      "link": "https://alabamareflector.com/2026/02/03/kristin-nelson-wins-house-district-38-special-election-in-chambers-lee-counties/",
      "thumbnail": "",
      "description": "Republican voters in Chambers and Lee counties chose Kristin Nelson as their nominee in the House District 38 special election. Nelson will face Democratic candidate Hazel Floyd on Feb. 3. (photo courtesy of candidate)Ch..."
    },
    {
      "title": "Trump doubles down on calling for the feds to take over state elections",
      "link": "https://alabamareflector.com/2026/02/03/repub/trump-doubles-down-on-calling-for-the-feds-to-take-over-state-elections/",
      "thumbnail": "",
      "description": "President Donald Trump gives a speech at the World Economic Forum on Jan. 21, 2026 in Davos, Switzerland. (Photo by Chip Somodevilla/Getty Images)President Donald Trump restated a call Tuesday for federal control over el..."
    }
  ],
  "lastUpdated": "2026-02-04T22:50:30.685Z"
}