{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Abortion pill safety review at FDA targeted by frustrated Republicans, advocates",
      "link": "https://alabamareflector.com/2026/01/17/repub/abortion-pill-safety-review-at-fda-targeted-by-frustrated-republicans-advocates/",
      "thumbnail": "",
      "description": "Louisiana Republican U.S. Sen. Bill Cassidy speaks during a press conference on Wednesday, Jan. 14, 2026. Also pictured, from left, are Family Foundation of Virginia President Victoria Cobb, National Association of Chris..."
    },
    {
      "title": "US Education Department delays plan to garnish wages of student borrowers in default",
      "link": "https://alabamareflector.com/2026/01/16/repub/us-education-department-delays-plan-to-garnish-wages-of-student-borrowers-in-default/",
      "thumbnail": "",
      "description": "U.S. Education Secretary Linda McMahon takes in a selection of grade school students’ patriotic artworks and high schoolers’ recent output in a special installation set up at Exeter-West Greenwich Regional Junior High an..."
    },
    {
      "title": "Federal courts deny Trump request for private voter data in 2 states",
      "link": "https://alabamareflector.com/2026/01/16/repub/federal-courts-deny-trump-request-for-private-voter-data-in-2-states/",
      "thumbnail": "",
      "description": "Ryan Patraw processes ballots at the Marion County Clerk’s Office in Salem, Ore., on May 16. Judges in Oregon and California have ruled against the Trump administration’s requests to turn over voter data. (Photo by Ron C..."
    },
    {
      "title": "What passed in the Alabama Legislature: Jan. 13-15, 2026",
      "link": "https://alabamareflector.com/2026/01/16/what-passed-in-the-alabama-legislature-jan-13-15-2026/",
      "thumbnail": "",
      "description": "Rep. Juandalynn Givan, D-Birmingham (left) takes a photo with Reps. Rolanda Hollis, D-Birmingham (center) and Tashina Morris, D-Montgomery (right) in the Alabama House of Representatives on Jan. 13, 2026 at the Alabama S..."
    },
    {
      "title": "APLS to continue withholding Fairhope Library funds over ‘Handmaid’s Tale,’ other books",
      "link": "https://alabamareflector.com/2026/01/16/apls-to-continue-withholding-fairhope-library-funds-over-handmaids-tale-other-books/",
      "thumbnail": "",
      "description": "John Wahl, chair of the Alabama Public Library Service and the Alabama Republican Party speaks to attendees of a meeting on Jan. 15 2026. The APLS Board voted to continue denying state funds to Fairhope Public Library an..."
    },
    {
      "title": "Alabama House passes post-election audit bill",
      "link": "https://alabamareflector.com/2026/01/16/alabama-house-passes-post-election-audit-bill/",
      "thumbnail": "",
      "description": "Rep. Joe Lovvorn, R-Auburn, standing on the floor of the Alabama House of Representatives on Jan. 15, 2026, in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)The Alabama House of Representatives Thursday passed a b..."
    },
    {
      "title": "Alabama Department of Corrections settles suit claiming neglect led to partial foot amputation",
      "link": "https://alabamareflector.com/2026/01/16/alabama-department-of-corrections-settles-suit-claiming-neglect-led-to-partial-foot-amputation/",
      "thumbnail": "",
      "description": "A prison dorm at Holman Correctional Facility on Oct. 23, 2019. The Alabama Department of Corrections has settled a lawsuit that alleged staff neglect led to a incarcerated person's feet being partially amputated. (File)..."
    },
    {
      "title": "In the car with the Minneapolis community patrols working to disrupt ICE operations",
      "link": "https://alabamareflector.com/2026/01/15/repub/in-the-car-with-the-minneapolis-community-patrols-working-to-disrupt-ice-operations/",
      "thumbnail": "",
      "description": "Three cars filled with federal agents stop in front of Elle Neubauer and another observer, surrounding the car and threatening arrest during an early morning watch observing ICE in South Minneapolis Monday, Jan. 12, 2026..."
    },
    {
      "title": "US Senate Dems launch midterm affordability push with focus on housing costs",
      "link": "https://alabamareflector.com/2026/01/15/repub/us-senate-dems-launch-midterm-affordability-push-with-focus-on-housing-costs/",
      "thumbnail": "",
      "description": "An aerial view of residential housing under construction at a planned community in Fontana, California, on Sept. 17, 2025. (Photo by Mario Tama/Getty Images)WASHINGTON — U.S. Senate Democrats began detailing their afford..."
    },
    {
      "title": "Court considers end to legal protection for nearly 1 million immigrants from Haiti, Venezuela",
      "link": "https://alabamareflector.com/2026/01/15/repub/court-considers-end-to-legal-protection-for-nearly-1-million-immigrants-from-haiti-venezuela/",
      "thumbnail": "",
      "description": "Department of Homeland Security Secretary Kristi Noem at a Nashville press conference on July 18, 2025, to discuss arrests of immigrants during recent Immigration and Customs Enforcement sweeps. (Photo by John Partipilo/..."
    }
  ],
  "lastUpdated": "2026-01-18T08:18:00.797Z"
}