{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Bill regulating AI in determining health coverage passes Alabama Senate committee",
      "link": "https://alabamareflector.com/briefs/bill-regulating-ai-in-determining-health-coverage-passes-senate-committee/",
      "thumbnail": "",
      "description": "Sen. Arthur Orr, R-Decatur (top) listens to Sen. Larry Stutts, R-Tuscumbia on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate Health Care Committee approved O..."
    },
    {
      "title": "Tuscaloosa, other cities drop lawsuit over Alabama Internet sales tax",
      "link": "https://alabamareflector.com/2026/02/11/tuscaloosa-other-cities-drop-lawsuit-over-alabama-internet-sales-tax/",
      "thumbnail": "",
      "description": "The Alabama Statehouse as seen in 2023. A group of cities Wednesday dropped a lawsuit over the state's Internet sales tax, which alleged that the Alabama Department of Revenue was allowing ineligible companies to partici..."
    },
    {
      "title": "High-speed Minnesota car chase involving federal agent ends with multi-car crash",
      "link": "https://alabamareflector.com/2026/02/11/repub/high-speed-minnesota-car-chase-involving-federal-agent-ends-with-multi-car-crash/",
      "thumbnail": "",
      "description": "A high-speed car chase involving a man in a red Prius and federal agent ended with multi-car crash at Nina’s in St. Paul Wednesday Feb. 11, 2026. (Photo by Alyssa Chen/Minnesota Reformer)A high-speed car chase that invol..."
    },
    {
      "title": "Many middle-income families spend at least a tenth of their income on health insurance",
      "link": "https://alabamareflector.com/2026/02/11/repub/many-middle-income-families-spend-at-least-a-tenth-of-their-income-on-health-insurance/",
      "thumbnail": "",
      "description": "A health care worker places a bandage on a child after giving a vaccination shot. A new study shows that in many states, premium contributions and deductibles take a significant bite out of household incomes. (Scott Hous..."
    },
    {
      "title": "Alabama House committee passes bill granting scholarships to law enforcement families",
      "link": "https://alabamareflector.com/briefs/alabama-house-committee-passes-bill-granting-scholarships-to-law-enforcement-families/",
      "thumbnail": "",
      "description": "Rep. Allen Treadaway, R-Morris, speaks in the Alabama House of Representatives on May 8, 2024 at the Alabama Statehouse in Montgomery. (Brian Lyman/Alabama Reflector)An Alabama House committee Wednesday approved a bill t..."
    },
    {
      "title": "Jobs report shows a historic stall in hiring last year",
      "link": "https://alabamareflector.com/2026/02/11/repub/jobs-report-shows-a-historic-stall-in-hiring-last-year/",
      "thumbnail": "",
      "description": "Construction workers install finishing touches at a Scout Motors electric vehicle assembly plant in Blythewood, S.C., in February. Health care and construction hiring helped boost January jobs, but downward revisions for..."
    },
    {
      "title": "Alabama Senate approves bill allowing firings of library board members",
      "link": "https://alabamareflector.com/2026/02/11/alabama-senate-approves-bill-allowing-firings-of-library-board-members/",
      "thumbnail": "",
      "description": "Sen. Chris Elliott, R-Josephine, (left) speaks with Sen. Vivian Davis Figures, D-Mobile (right) on the floor of the Alabama Senate on Feb. 10, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate Tuesday app..."
    },
    {
      "title": "All Democratic governors bow out of White House dinner after Trump snubs several",
      "link": "https://alabamareflector.com/2026/02/11/repub/all-democratic-governors-bow-out-of-white-house-dinner-after-trump-snubs-several/",
      "thumbnail": "",
      "description": "Maryland Gov. Wes Moore, a Democrat, said President Donald Trump \"uninvited\" him from a National Governors Association black-tie dinner at the White House planned during the group's annual meeting Feb. 19-21, 2026. (Phot..."
    },
    {
      "title": "Alabama Senate approves bill requiring breast cancer screening coverage for women over 40",
      "link": "https://alabamareflector.com/briefs/alabama-senate-approves-bill-requiring-breast-cancer-screening-coverage-for-women-over-40/",
      "thumbnail": "",
      "description": "Sen. Linda Coleman-Madison, D-Birmingham, speaks with a colleague on the floor of the Alabama Senate on Feb. 10, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector) The Alabama Senate p..."
    },
    {
      "title": "Alabama House approves bill allowing nurses, PAs to approve K-12 athletic physicals",
      "link": "https://alabamareflector.com/briefs/alabama-house-approves-bill-allowing-nurses-pas-to-approve-k-12-athletic-physicals/",
      "thumbnail": "",
      "description": "Rep. Ed Oliver, R-Dadeville, introduces a bill on unemployment compensation in the Alabama House of Representatives on Feb. 11, 2025 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)The Al..."
    }
  ],
  "lastUpdated": "2026-02-11T21:57:24.184Z"
}