{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Even conservative Supreme Court justices cool to Trump dismissal of the Fed’s Lisa Cook",
      "link": "https://alabamareflector.com/2026/01/21/repub/even-conservative-supreme-court-justices-cool-to-trump-dismissal-of-the-feds-lisa-cook/",
      "thumbnail": "",
      "description": "Federal Reserve Governor Lisa Cook leaves the U.S. Supreme Court on Jan. 21, 2026 in Washington, D.C, after the court heard oral arguments in Trump v. Cook. (Photo by Kevin Dietsch/Getty Images)WASHINGTON — U.S. Supreme ..."
    },
    {
      "title": "US House panel says Clintons should be held in contempt of Congress over Epstein subpoena",
      "link": "https://alabamareflector.com/2026/01/21/repub/us-house-panel-says-clintons-should-be-held-in-contempt-of-congress-over-epstein-subpoena/",
      "thumbnail": "",
      "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton arrive to attend the inauguration of President Donald Trump on Jan. 20, 2025 in Washington, D.C. (Photo by Shawn Thew-Pool/Getty Images)The U.S...."
    },
    {
      "title": "Senate committee approves bill requiring cross-checks for Medicaid, SNAP enrollees",
      "link": "https://alabamareflector.com/2026/01/21/senate-committee-approves-bill-requiring-cross-checks-for-medicaid-snap-enrollees/",
      "thumbnail": "",
      "description": "Sen. Greg Albritton, R-Atmore, speaking at the Senate General Fund Finance & Taxation Committee meeting on Jan. 21, 2026, in the Alabama State House in Montgomery, Alabama. The Senate General Fund Finance and Taxation Co..."
    },
    {
      "title": "Trump announces ‘framework of a future deal’ on Greenland, relents on 8-nation tariffs",
      "link": "https://alabamareflector.com/2026/01/21/repub/trump-at-davos-pitches-us-acquisition-of-greenland-while-claiming-he-wont-use-force/",
      "thumbnail": "",
      "description": "U.S. President Donald Trump gives a speech at the World Economic Forum on Jan. 21, 2026 in Davos, Switzerland. (Photo by Chip Somodevilla/Getty Images)WASHINGTON — President Donald Trump announced in a social media post ..."
    },
    {
      "title": "With rental registries, cities try to track housing and hold bad actors accountable",
      "link": "https://alabamareflector.com/2026/01/21/repub/with-rental-registries-cities-try-to-track-housing-and-hold-bad-actors-accountable/",
      "thumbnail": "",
      "description": "A sign lists a home for rent in Maryland. Municipal rental registries are gaining attention as cities try to get a handle on who owns rental properties and where, both to better understand their housing landscape and to ..."
    },
    {
      "title": "Alabama House committee approves bill limiting youthful offender status in murder cases",
      "link": "https://alabamareflector.com/2026/01/21/alabama-house-committee-approves-bill-limiting-youthful-offender-status-in-murder-cases/",
      "thumbnail": "",
      "description": "Rep. Phillip Pettus, R-Killen, speaks to Rep. Terri Collins, R-Decatur on the floor of the Alabama House of Representatives on April 22, 2025 at the Alabama Statehouse in Montgomery, Alabama. An Alabama House committee W..."
    },
    {
      "title": "Alabama Public Television waiting on more information to renew PBS contract",
      "link": "https://alabamareflector.com/2026/01/21/alabama-public-television-waiting-on-more-information-to-renew-pbs-contract/",
      "thumbnail": "",
      "description": "Alabama Public Television Executive Director Wayne Reid and Alabama Educational Television Commissioners Ferris Stephens and Bebe Williams listen to public comments during a meeting on Nov. 18, 2025. Reid said Tuesday th..."
    },
    {
      "title": "Alabama Senate passes bill giving ADPH oversight of Sickle Cell Commission",
      "link": "https://alabamareflector.com/2026/01/21/alabama-senate-passes-bill-giving-adph-oversight-of-sickle-cell-commission/",
      "thumbnail": "",
      "description": "Sen. Linda Coleman-Madison, D-Birmingham, stands on the floor of the Alabama Senate on Jan. 20, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate passed Coleman-Madison's bill giving ADPH oversight of the..."
    },
    {
      "title": "APLS is playing cat-and-mouse with Fairhope library funds",
      "link": "https://alabamareflector.com/2026/01/21/apls-is-playing-cat-and-mouse-with-fairhope-library-funds/",
      "thumbnail": "",
      "description": "Rows of books in a library. The Alabama Public Library Service last week voted to withhold money from Fairhope Public Library over the presence of 10 books in a teen section that the board chair deemed sexually explicit...."
    },
    {
      "title": "In NCAA letter, Michigan congresswoman warns against private equity in college sports",
      "link": "https://alabamareflector.com/2026/01/20/repub/in-ncaa-letter-michigan-congresswoman-warns-against-private-equity-in-college-sports/",
      "thumbnail": "",
      "description": "U.S. Rep. Haley Stevens (D-Birmingham) addresses residents in Detroit at the Durfee Innovation Society to unveil her policy agenda for Black and brown communities across Michigan as she continues her bid for the U.S. Sen..."
    }
  ],
  "lastUpdated": "2026-01-22T01:07:29.729Z"
}