{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Minnesota prosecution of ICE officer faces new political obstacles under Trump",
      "link": "https://alabamareflector.com/2026/01/09/repub/minnesota-prosecution-of-ice-officer-faces-new-political-obstacles-under-trump/",
      "thumbnail": "",
      "description": "Local police officers stand guard as Renee Good's car is towed away after ICE officers shot and killed a woman through her car window Wednesday, Jan. 7, 2026 near Portland Avenue and 34th Street. (Photo by Nicole Neri/Mi..."
    },
    {
      "title": "Federal agents shoot two people in Portland, police say",
      "link": "https://alabamareflector.com/2026/01/09/repub/federal-agents-shoot-two-people-in-portland-police-say/",
      "thumbnail": "",
      "description": "Portland police officers stand behind police tape in front of an apartment building in east Portland. (Photo by Alex Baumhardt/Oregon Capital Chronicle)Federal agents reportedly shot and injured two people near a medical..."
    },
    {
      "title": "Alabama senator continues to delay legal contracts over Internet sales tax lawsuit",
      "link": "https://alabamareflector.com/2026/01/09/alabama-senator-continues-to-delay-legal-contracts-over-internet-sales-tax-lawsuit/",
      "thumbnail": "",
      "description": "Sen. Greg Albritton, R-Atmore (top) speaks to Sen. Lance Bell, R-Pell City in the Alabama Senate on May 6, 2024 at the Alabama Statehouse in Montgomery, Alabama. Albritton has held legal services contracts for a second s..."
    },
    {
      "title": "Alabama State Board of Education could vote on new textbooks in February",
      "link": "https://alabamareflector.com/2026/01/09/alabama-state-board-of-education-could-vote-on-new-textbooks-in-february/",
      "thumbnail": "",
      "description": "Textbooks pictured a in the Gordon Persons Building in downtown Montgomery, Alabama on Monday, May 15, 2023. The Alabama State Board of Education could take a long-delayed vote on new arts and social studies textbooks at..."
    },
    {
      "title": "Criminal justice reform advocates expect to play defense in Alabama legislative session",
      "link": "https://alabamareflector.com/2026/01/09/criminal-justice-reform-advocates-expect-to-play-defense-in-alabama-legislative-session/",
      "thumbnail": "",
      "description": "Barbed wire seen behind a fence at an Alabama prison. Criminal justice reform advocates expect to play defense in the 2026 Alabama legislative session but are also supporting bills targeting parole, prison conditions and..."
    },
    {
      "title": "Maybe, just maybe, there’s not another shutdown looming at the end of January",
      "link": "https://alabamareflector.com/2026/01/08/repub/maybe-just-maybe-theres-not-another-shutdown-looming-at-the-end-of-january/",
      "thumbnail": "",
      "description": "The U.S. Capitol in Washington, D.C., on Oct. 1, 2025, at the beginning of a government shutdown of historic length. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — Republicans and Democrats in Congress are cautiou..."
    },
    {
      "title": "Minneapolis schools cancel class following ICE shooting, separate confrontation on campus",
      "link": "https://alabamareflector.com/2026/01/08/repub/minneapolis-schools-cancel-class-following-ice-shooting-separate-confrontation-on-campus/",
      "thumbnail": "",
      "description": "A federal agent grabs a demonstrator as they attempt to drive a truck through the area while protesters gather after ICE officers shot and killed a woman through her car window Wednesday, Jan. 7, 2026 near Portland Avenu..."
    },
    {
      "title": "Defiant Vance scolds reporters over descriptions of Minneapolis ICE shooting",
      "link": "https://alabamareflector.com/2026/01/08/repub/defiant-vance-scolds-reporters-over-descriptions-of-minneapolis-ice-shooting/",
      "thumbnail": "",
      "description": "Vice President JD Vance speaks during a news briefing in the White House briefing room on January 8, 2026. Vance joined White House press secretary Karoline Leavitt to address several topics including the Jan. 7, 2026, f..."
    },
    {
      "title": "US House backs extension of health insurance subsidies after Dems force vote",
      "link": "https://alabamareflector.com/2026/01/08/repub/us-house-backs-extension-of-health-insurance-subsidies-after-dems-force-vote/",
      "thumbnail": "",
      "description": "House Minority Leader Hakeem Jeffries, D-N.Y., speaks as U.S. Senate Minority Leader Chuck Schumer, D-N.Y., looks on during a news conference at the U.S. Capitol on Jan. 8, 2026 in Washington, D.C. Schumer and Jeffries s..."
    },
    {
      "title": "Worried about surveillance, states enact privacy laws and restrict license plate readers",
      "link": "https://alabamareflector.com/2026/01/08/repub/worried-about-surveillance-states-enact-privacy-laws-and-restrict-license-plate-readers/",
      "thumbnail": "",
      "description": "A police officer uses the Flock Safety license plate reader system. Many left-leaning states and cities are trying to protect their residents’ personal information amid the Trump administration's immigration crackdown, b..."
    }
  ],
  "lastUpdated": "2026-01-09T19:38:14.506Z"
}