{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama Legislature 2026 preview: Let’s get this over with",
      "link": "https://alabamareflector.com/2026/01/12/alabama-legislature-2026-preview-lets-get-this-over-with/",
      "thumbnail": "",
      "description": "The Alabama House of Representatives as seen on Feb. 25, 2025. The Alabama Legislature begins its 2026 legislative session on Tuesday, with many lawmakers expecting to focus on the budgets and eschew larger issues. (Stew..."
    },
    {
      "title": "The legacy of a departing Alabama Legislature",
      "link": "https://alabamareflector.com/2026/01/12/the-legacy-of-a-departing-alabama-legislature/",
      "thumbnail": "",
      "description": "Reps. Mark Gidley, R-Hokes Bluff (left) and Tracey Estes, R-Winfield, speak in the chamber of the Alabama House of Representatives on Feb. 4, 2025 in Montgomery, Alabama. The 2026 regular session of the Alabama Legislatu..."
    },
    {
      "title": "Tuscaloosa voters to choose new representative in House District 63 special election",
      "link": "https://alabamareflector.com/2026/01/12/tuscaloosa-voters-to-choose-new-representative-in-house-district-63-special-election/",
      "thumbnail": "",
      "description": "Tuscaloosa voters will choose Republican Tuscaloosa City Councilman Norman Crow (left) or Tuscaloosa Democratic Party Chair Judith Taylor (right) as their next representative in a special election for House District 63 o..."
    },
    {
      "title": "‘Teaching us how to grow with our babies’: How prisons allow mothers and infants to nest for months",
      "link": "https://alabamareflector.com/2026/01/11/repub/teaching-us-how-to-grow-with-our-babies-how-prisons-allow-mothers-and-infants-to-nest-for-months/",
      "thumbnail": "",
      "description": "Kathy Briggs is assisted by case manager Kim Immel, left, and nursery program manager Kim Perkins as she puts on a front-loading baby carrier with her daughter Melody inside at the Women’s Eastern Reception, Diagnostic a..."
    },
    {
      "title": "Phillip Ensler kicks off Alabama lieutenant governor campaign",
      "link": "https://alabamareflector.com/2026/01/10/phillip-ensler-kicks-off-lieutenant-governor-campaign/",
      "thumbnail": "",
      "description": "Rep. Phillip Ensler, D-Montgomery, speaking at his lieutenant governor campaign kickoff event on Jan. 10, 2026, in downtown Montgomery, Alabama. Ensler promised to use the constitutionally weak office to bring people tog..."
    },
    {
      "title": "Landmark cases on transgender athletes at the US Supreme Court put trans rights on the line",
      "link": "https://alabamareflector.com/2026/01/10/repub/landmark-cases-on-transgender-athletes-at-the-us-supreme-court-put-trans-rights-on-the-line/",
      "thumbnail": "",
      "description": "Becky Pepper-Jackson attends the Lambda Legal Liberty Awards on June 8, 2023 in New York City. Her mother sued on her behalf over West Virginia's law barring trans athletes from competing on girls’ and women’s sports tea..."
    },
    {
      "title": "What top climate scientists think of Trump’s treaty withdrawals",
      "link": "https://alabamareflector.com/2026/01/10/what-top-climate-scientists-think-of-trumps-treaty-withdrawals/",
      "thumbnail": "",
      "description": "Scientists gather for the 63rd session of the Intergovernmental Panel on Climate Change in Lima, Peru, on Oct. 27, 2025. (Peru Ministry of Environment)This article originally appeared on Inside Climate News, a nonprofit,..."
    },
    {
      "title": "Thune, GOP senators at the border tout big hiring boost for immigration crackdown",
      "link": "https://alabamareflector.com/2026/01/09/repub/thune-gop-senators-at-the-border-tout-big-hiring-boost-for-immigration-crackdown/",
      "thumbnail": "",
      "description": "A section of the U.S.-Mexico border wall near El Paso, Texas, on June 6, 2024. (Photo by Ariana Figueroa/States Newsroom)WASHINGTON — Senate Majority Leader John Thune, joined at the U.S.-Mexico border Friday by a handfu..."
    },
    {
      "title": "Alabama Court of Civil Appeals says birth centers are subject to state hospital regulations",
      "link": "https://alabamareflector.com/2026/01/09/alabama-court-of-civil-appeals-says-birth-centers-are-subject-to-state-hospital-regulations/",
      "thumbnail": "",
      "description": "Dr. Heather Skanes, OB-GYN and owner of Oasis Family Birth Center in Birmingham, discusses ACLU's lawsuit against the Alabama Public Health Department on Aug. 8, 2023 in front of the Mothers of Gynecology Monument in Mon..."
    },
    {
      "title": "Minnesota prosecution of ICE officer faces new political obstacles under Trump",
      "link": "https://alabamareflector.com/2026/01/09/repub/minnesota-prosecution-of-ice-officer-faces-new-political-obstacles-under-trump/",
      "thumbnail": "",
      "description": "Local police officers stand guard as Renee Good's car is towed away after ICE officers shot and killed a woman through her car window Wednesday, Jan. 7, 2026 near Portland Avenue and 34th Street. (Photo by Nicole Neri/Mi..."
    }
  ],
  "lastUpdated": "2026-01-12T13:36:40.252Z"
}