{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "No ‘clear path forward’ in US Senate on spiraling health care costs, with deadline near",
      "link": "https://alabamareflector.com/2025/12/03/repub/no-clear-path-forward-in-us-senate-on-spiraling-health-care-costs-with-deadline-near/",
      "thumbnail": "",
      "description": "Senate Majority Leader John Thune, R-S.D., speaks to reporters while walking to his office on Nov. 10, 2025 on Capitol Hill in Washington, D.C. (Photo by Tom Brenner/Getty Images)WASHINGTON — Republicans and Democrats in..."
    },
    {
      "title": "Hegseth denies he was present for deadly second strike on alleged Caribbean drug boat",
      "link": "https://alabamareflector.com/2025/12/03/repub/hegseth-denies-he-was-present-for-deadly-second-strike-on-alleged-caribbean-drug-boat/",
      "thumbnail": "",
      "description": "U.S. Secretary of Defense Pete Hegseth, right, looks on as U.S. President Donald Trump speaks during a meeting of his Cabinet in the Cabinet Room of the White House on Dec. 2, 2025 in Washington, D.C. (Photo by Chip Somo..."
    },
    {
      "title": "Alabama PSC approves Alabama Power’s request for rate freeze",
      "link": "https://alabamareflector.com/2025/12/03/alabama-psc-approves-alabama-powers-request-for-rate-freeze/",
      "thumbnail": "",
      "description": "Members of the Alabama Public Service Commission prepare for the Tuesday, August 5, 2025 regular meeting. The Alabama Public Service Commission Tuesday approved a request from Alabama Power to freeze some electricity rat..."
    },
    {
      "title": "Student coalition, Dem lawmakers object to Trump Education Department moves",
      "link": "https://alabamareflector.com/2025/12/03/repub/student-coalition-dem-lawmakers-object-to-trump-education-department-moves/",
      "thumbnail": "",
      "description": "Student protesters shout during a “Hands Off Our Schools” rally in front of the U.S. Department of Education building in Washington, D.C., in April. The same group held a virtual press conference Tuesday to protest Presi..."
    },
    {
      "title": "Alabama teachers’ insurance board may dip into reserves to avoid premium increases",
      "link": "https://alabamareflector.com/2025/12/03/alabama-teachers-insurance-board-may-dip-in-reserves-to-avoid-premium-increases/",
      "thumbnail": "",
      "description": "Diane Scott, chief financial officer for the Public Education Employees Health Insurance Program (PEEHIP) presenting a financial update to the board on Dec. 2, 2025, in the RSA tower in Montgomery, Alabama. An Alabama la..."
    },
    {
      "title": "Trump administration threatens to yank food stamps funding from Democratic-led states",
      "link": "https://alabamareflector.com/2025/12/02/repub/trump-administration-threatens-to-yank-food-stamps-funding-from-democratic-led-states/",
      "thumbnail": "",
      "description": "A store displays a sign accepting Electronic Benefits Transfer, or EBT, cards for Supplemental Nutrition Assistance Program purchases for groceries on Oct. 30, 2025 in New York City. (Photo by Spencer Platt/Getty Images)..."
    },
    {
      "title": "4 Republican states will help Homeland Security obtain driver’s license records",
      "link": "https://alabamareflector.com/2025/12/02/repub/4-republican-states-will-help-homeland-security-obtain-drivers-license-records/",
      "thumbnail": "",
      "description": "A Delray Beach, Fla., police officer speaks with a driver in 2019. The Trump administration wants access to state driver’s license data through a computer network used by law enforcement to share records across state lin..."
    },
    {
      "title": "Ann Bedsole, 1st woman to serve in Alabama Senate, dies at 95",
      "link": "https://alabamareflector.com/2025/12/02/ann-bedsole-1st-woman-to-serve-in-alabama-senate-dies-at-95/",
      "thumbnail": "",
      "description": "Ann Bedsole is seen standing outside the Alabama State Capitol in this undated photo. Bedsole, who was the first woman elected to the Alabama Senate, hsa died at the age of 95. Bedsole, a Republican from Mobile, served i..."
    },
    {
      "title": "University of Alabama suspends student magazines for Black students, female students",
      "link": "https://alabamareflector.com/2025/12/02/university-of-alabama-suspends-student-magazines-citing-federal-memo/",
      "thumbnail": "",
      "description": "Bryant-Denny Stadium at the University of Alabama as seen on Nov. 20, 2025, in Tuscaloosa, Alabama. The University of Alabama Monday suspended publication of two student-run magazines -- one focused on Black students, th..."
    },
    {
      "title": "Fairhope Public Library receives donations to cover funding canceled by state",
      "link": "https://alabamareflector.com/2025/12/02/fairhope-public-library-receives-donations-to-cover-funding-canceled-by-state/",
      "thumbnail": "",
      "description": "Fairhope Public Library Director Robert Gourlay, left, and Fairhope Public Library Board Chair Randal Wright wait for the beginning of the Alabama Public Library Service board meeting on Thursday, Nov, 20 2025 in Montgom..."
    }
  ],
  "lastUpdated": "2025-12-03T18:55:59.402Z"
}