{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Trump administration officially ends veteran abortion access",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-administration-officially-ends-veteran-abortion-access/",
      "thumbnail": "",
      "description": "The U.S. Department of Justice has instructed the U.S. Department of Veterans Affairs to stop providing any abortion care or abortion counseling, even in cases of rape or incest. The policy change comes from the Project ..."
    },
    {
      "title": "Trump appears in several files of latest Epstein release",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-appears-in-several-files-of-latest-epstein-release/",
      "thumbnail": "",
      "description": "A photograph of President Donald Trump and late sex offender Jeffrey Epstein is displayed after being unofficially installed in a bus shelter. (Leon Neal/Getty Images).WASHINGTON — The U.S. Department of Justice early Tu..."
    },
    {
      "title": "Homeless youth say they need more from schools, social services",
      "link": "https://alabamareflector.com/2025/12/23/repub/homeless-youth-say-they-need-more-from-schools-social-services/",
      "thumbnail": "",
      "description": "A homeless teen, holding a sign “Only 19, alone on the street,” asks for help in Manhattan in New York City. A report from the Covenant House and researchers at the University of California, Berkeley finds that schools a..."
    },
    {
      "title": "Alabama state appeals court upholds dismissal of lawsuit over prison labor",
      "link": "https://alabamareflector.com/2025/12/23/alabama-state-appeals-court-upholds-dismissal-of-lawsuit-over-prison-labor/",
      "thumbnail": "",
      "description": "A gate opens at Holman Correctional Facility in Atmore, Alabama on October 22, 2019. A state appeals court Friday upheld the dismissal of a lawsuit brought by Alabama inmates alleging labor conditions in the state's corr..."
    },
    {
      "title": "New PARCA report: Change in federal reporting could cloud Hispanic student enrollment picture",
      "link": "https://alabamareflector.com/2025/12/23/new-parca-report-suggests-possible-explanation-for-hispanic-latino-student-enrollment-decline/",
      "thumbnail": "",
      "description": "Students arrive for the first day of school at a Minnesota elementary school. Four-day school weeks are gaining in popularity, especially in rural districts. But researchers say the evidence on four-day weeks is unclear...."
    },
    {
      "title": "Louisiana Gov. Jeff Landry selected by Trump to be special envoy to Greenland",
      "link": "https://alabamareflector.com/2025/12/23/repub/louisiana-gov-jeff-landry-selected-by-trump-to-be-special-envoy-to-greenland/",
      "thumbnail": "",
      "description": "Gov. Jeff Landry holds a copy of the Louisiana tax code during his speech to the Legislature at the State Capitol in Baton Rouge on Wednesday, Nov. 6, 2024, the opening day of a special session in which he is asking lawm..."
    },
    {
      "title": "Kilmar Abrego Garcia to remain free from immigration custody for now",
      "link": "https://alabamareflector.com/2025/12/22/repub/kilmar-abrego-garcia-to-remain-free-from-immigration-custody-for-now/",
      "thumbnail": "",
      "description": "Simon Sandoval-Moshenberg, an attorney for Kilmar Abrego Garcia, speaks following a hearing in federal court in Greenbelt, Maryland, on Dec. 22, 2025. (Photo by Ashley Murray/States Newsroom)GREENBELT, Md. — U.S. Distric..."
    },
    {
      "title": "Trump administration pauses major East Coast offshore wind projects",
      "link": "https://alabamareflector.com/2025/12/22/repub/trump-administration-pauses-major-east-coast-offshore-wind-projects/",
      "thumbnail": "",
      "description": "Wind turbines generate electricity at the Block Island Wind Farm on July 7, 2022, near Block Island, Rhode Island. The first commercial offshore wind farm in the United States is located in the Atlantic Ocean 3.8 miles f..."
    },
    {
      "title": "As Supreme Court pulls back on gerrymandering, state courts may decide fate of maps",
      "link": "https://alabamareflector.com/2025/12/22/repub/as-supreme-court-pulls-back-on-gerrymandering-state-courts-may-decide-fate-of-maps/",
      "thumbnail": "",
      "description": "Missouri Capitol Police officers conduct security checks on boxes of petition signatures submitted to force a referendum vote on the state’s new congressional map. State courts in Missouri and other states may decide whe..."
    },
    {
      "title": "Alabama legislator files bills targeting the death penalty",
      "link": "https://alabamareflector.com/2025/12/22/alabama-legislator-files-bills-targeting-the-death-penalty/",
      "thumbnail": "",
      "description": "Rep. Chris England, D-Tuscaloosa, speaks to Rep. Steve Clouse, R-Ozark, on the floor of the Alabama House of Representatives on April 1, 2025 at the Alabama Statehouse in Montgomery, Alabama. England has filed two bills ..."
    }
  ],
  "lastUpdated": "2025-12-23T20:41:42.805Z"
}