{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Limestone County judge places restrictions on Belle Mina quarry as case proceeds",
      "link": "https://alabamareflector.com/2026/01/27/limestone-county-judge-places-restrictions-on-mine-until-case-is-decided/",
      "thumbnail": "",
      "description": "A map of a limestone quarry near Belle Mina in Limestone County. A judge last week placed restrictions on the operations of the mine amid an ongoing lawsuit. (Southern Environmental Law Center)A Limestone county judge Fr..."
    },
    {
      "title": "GOP gubernatorial candidate plans to challenge Tommy Tuberville’s residency",
      "link": "https://alabamareflector.com/2026/01/27/gop-gubernatorial-candidate-plans-to-challenge-tommy-tubervilles-residency/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, speaks to a crowd at an Alabama Republican Party fundraiser on Aug. 4, 2023. GOP gubernatorial candidate Ken McFeeters said Monday he plans to file a challenge to Tuberville's candi..."
    },
    {
      "title": "Alabama House passes bill aimed at curbing school bus driver shortage",
      "link": "https://alabamareflector.com/2026/01/27/alabama-house-passes-bill-to-curb-school-bus-driver-shortage/",
      "thumbnail": "",
      "description": "Rep. Kenneth Paschal, R-Pelham, speaks to a staffer on the floor of the Alabama House of Representatives on Feb. 13, 2024 in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)The Alabama House of Representatives Thursd..."
    },
    {
      "title": "As AI-generated fake content mars legal cases, states want guardrails",
      "link": "https://alabamareflector.com/2026/01/26/repub/as-ai-generated-fake-content-mars-legal-cases-states-want-guardrails/",
      "thumbnail": "",
      "description": "CoCounsel Legal is an artificial intelligence tool that acts as a virtual assistant for legal professionals. More people in the legal field are using AI to automate repetitive tasks and save time, but hallucinations have..."
    },
    {
      "title": "Congress hurtles toward partial shutdown after Alex Pretti killing in Minneapolis",
      "link": "https://alabamareflector.com/2026/01/26/repub/congress-hurtles-toward-partial-shutdown-after-alex-pretti-killing-in-minneapolis/",
      "thumbnail": "",
      "description": "Pictures of Alex Pretti sit in front of his home on Jan. 26, 2026 in Minneapolis, Minnesota. Pretti, an ICU nurse at a VA medical center, died Jan. 25, after being shot multiple times during a brief altercation with Bord..."
    },
    {
      "title": "US Senate Dems probe effect of Trump administration child care cutbacks on rural families",
      "link": "https://alabamareflector.com/2026/01/26/repub/us-senate-dems-probe-effect-of-trump-administration-child-care-cutbacks-on-rural-families/",
      "thumbnail": "",
      "description": "A September poll from&nbsp;First Five Years Fund, an advocacy group, found that 4 out of 5 rural Americans “say the ability of working parents to find and afford quality child care is either in a ‘state of crisis’ or ‘a ..."
    },
    {
      "title": "Homan heads to Minneapolis as White House, under siege, softens tone",
      "link": "https://alabamareflector.com/2026/01/26/repub/trump-sending-border-czar-homan-to-minnesota-in-aftermath-of-second-fatal-shooting/",
      "thumbnail": "",
      "description": "U.S. Border Czar Tom Homan speaks at the Tampa Convention Center on July 12, 2025. (Photo by Mitch Perry/Florida Phoenix)WASHINGTON — U.S. border czar Tom Homan is expected in Minneapolis by Monday evening, President Don..."
    },
    {
      "title": "HHS threats to freeze low-income child care assistance cause confusion, concern in Alabama",
      "link": "https://alabamareflector.com/2026/01/26/hhs-threats-to-freeze-low-income-child-care-assistance-cause-confusion-concern-in-alabama/",
      "thumbnail": "",
      "description": "Camille Bennett stands outside one of her two day-care centers in Alabama. The U.S. Department of Health and Human Services has threatened to freeze funding helping low-income families pay for child care. “Most child-car..."
    },
    {
      "title": "A better Alabama government requires a bigger Alabama electorate",
      "link": "https://alabamareflector.com/2026/01/26/a-better-alabama-government-requires-a-bigger-alabama-electorate/",
      "thumbnail": "",
      "description": "A line of voters wrapped around a polling location in Huntsville at midmorning on Nov. 5, 2024. (Anna Claire Vollers/Stateline)Years ago, the editor of the newspaper where I worked held a mandatory retreat where he outli..."
    },
    {
      "title": "Deadly shooting in Minneapolis could lead to partial government shutdown over ICE funding",
      "link": "https://alabamareflector.com/2026/01/25/repub/deadly-shooting-in-minneapolis-could-lead-to-partial-government-shutdown-over-ice-funding/",
      "thumbnail": "",
      "description": "A picture sits at a memorial to Alex Pretti on Jan. 25, 2026 in Minneapolis, Minnesota. Pretti, an ICU nurse at a VA medical center, died on Jan. 24 after being shot multiple times during a brief altercation with border ..."
    }
  ],
  "lastUpdated": "2026-01-27T19:02:41.855Z"
}