{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Trump’s calls to ‘nationalize’ elections have state, local election officials bracing for tumult",
      "link": "https://alabamareflector.com/2026/02/08/repub/trumps-calls-to-nationalize-elections-have-state-local-election-officials-bracing-for-tumult/",
      "thumbnail": "",
      "description": "FBI agents load boxes of election documents onto trucks at an elections warehouse in Fulton County, Ga. State and local election officials are bracing for the prospect of federal action after President Donald Trump’s cal..."
    },
    {
      "title": "Minnesota child care providers try to make ends meet as immigrant families keep kids home",
      "link": "https://alabamareflector.com/2026/02/07/repub/minnesota-child-care-providers-try-to-make-ends-meet-as-immigrant-families-keep-kids-home/",
      "thumbnail": "",
      "description": "A parent readies her child for drop off at Circulo de Amigos Child Care Center on Tuesday, Jan. 14, 2025, in Minneapolis, Minn. (Photo by Ellen Schmidt/Minnesota Reformer)Two weeks into January, the director of a St. Pau..."
    },
    {
      "title": "What passed in the Alabama Legislature: Feb. 3-5, 2026",
      "link": "https://alabamareflector.com/2026/02/06/what-passed-in-the-alabama-legislature-feb-3-5-2026/",
      "thumbnail": "",
      "description": "Senate Minority Leader Bobby Singleton, D-Greensboro, hands a paper to Alabama Senate staff on Feb. 5, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)Here are the bills that passed ..."
    },
    {
      "title": "White House takes down racist meme of Obamas posted on Trump social media",
      "link": "https://alabamareflector.com/2026/02/06/repub/gop-senator-calls-trumps-obama-meme-the-most-racist-thing-ive-seen-out-of-this-white-house/",
      "thumbnail": "",
      "description": "Chair of the Senate Committee on Banking, Housing, and Urban Affairs Sen. Tim Scott, R-S.C., on Feb. 5, 2026, in Washington, D.C. &nbsp;Scott criticized President Donald Trump's use of a racist meme on social media. (Pho..."
    },
    {
      "title": "‘It is astonishing’: Congress rebuffs Trump push to slash $33B from health, human services",
      "link": "https://alabamareflector.com/2026/02/06/repub/it-is-astonishing-congress-rebuffs-trump-push-to-slash-33b-from-health-human-services/",
      "thumbnail": "",
      "description": "U.S. Secretary of Health and Human Services Robert F. Kennedy Jr. speaks during a policy announcement event at the U.S. Department of Health and Human Services on Jan. 8, 2026 in Washington, DC. &nbsp;(Photo by Anna Mone..."
    },
    {
      "title": "Alabama House approves bills further defining terrorist threats",
      "link": "https://alabamareflector.com/2026/02/06/alabama-house-approves-bills-further-defining-terrorist-threats/",
      "thumbnail": "",
      "description": "Rep. James Lomax, R-Huntsville, speaks to a colleague on the floor of the Alabama House of Representatives on Jan. 22, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)The Alabama Hou..."
    },
    {
      "title": "Alabama Senate passes bill requiring app stores to verify ages of users",
      "link": "https://alabamareflector.com/2026/02/06/alabama-senate-passes-bill-requiring-app-stores-to-verify-ages-of-users/",
      "thumbnail": "",
      "description": "Rep. Chris Sells, R-Greenville (left) speaks with Sen. Clyde Chambliss, R-Prattville (right) on the floor of the Alabama Senate on Feb. 5, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama Senate on Thur..."
    },
    {
      "title": "Alabama House approves max price for voter rolls, restrictions on voter information",
      "link": "https://alabamareflector.com/2026/02/06/alabama-house-approves-max-price-for-voter-rolls-restrictions-on-voter-information/",
      "thumbnail": "",
      "description": "Rep. Jamie Kiel, R-Russellville, speaks on the floor of the Alabama House of Representatives on Feb. 5, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House of Representatives Thursday approved a bill..."
    },
    {
      "title": "With electricity bills rising, some states consider new data center laws",
      "link": "https://alabamareflector.com/2026/02/05/repub/with-electricity-bills-rising-some-states-consider-new-data-center-laws/",
      "thumbnail": "",
      "description": "An Amazon Web Services data center is shown situated near single-family homes in Stone Ridge, Va., in 2024. As Americans grow increasingly frustrated over their electricity bills, states are trying to keep the nation’s g..."
    },
    {
      "title": "Alabama schedules March execution for Charles Lee Burton",
      "link": "https://alabamareflector.com/briefs/alabama-schedules-march-execution-for-charles-lee-burton/",
      "thumbnail": "",
      "description": "Gov. Kay Ivey Thursday set the execution for Charles Lee Burton for March 12. He was convicted in 1992 of the capital murder of Doug Battle in 1991. If the execution goes forward, Osgood will be the first person put to d..."
    }
  ],
  "lastUpdated": "2026-02-09T08:40:14.257Z"
}