{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Republicans could gain nearly 200 state legislative seats in voting rights case, report finds",
      "link": "https://alabamareflector.com/2025/12/15/repub/republicans-could-gain-nearly-200-state-legislative-seats-in-voting-rights-case-report-finds/",
      "thumbnail": "",
      "description": "Voters walk to a polling place at a school gym in New Orleans. Republicans could gain scores of state legislative seats if the U.S. Supreme Court weakens a federal voting rights law, a new analysis finds. (Photo by Stacy..."
    },
    {
      "title": "Trump ‘very strongly’ considering loosening federal marijuana regulations",
      "link": "https://alabamareflector.com/2025/12/15/repub/trump-very-strongly-considering-loosening-federal-marijuana-regulations/",
      "thumbnail": "",
      "description": "A small cannabis plant. (Photo by Getty Images)President Donald Trump’s administration is looking “very strongly” at reclassifying cannabis from the strictest category of controlled substances, Trump said Monday. In a br..."
    },
    {
      "title": "Mountain Brook woman killed in mass shooting at Brown University",
      "link": "https://alabamareflector.com/2025/12/15/victim-in-brown-university-shooting-identified-as-mountain-brook-resident/",
      "thumbnail": "",
      "description": "Ella Cook, 19, a resident of Mountain Brook, was killed in a mass shooting at Brown University on Dec. 13, 2025. (Photo via LinkedIn)A woman from Mountain Brook was one of two people killed in a mass shooting at Brown Un..."
    },
    {
      "title": "Arrests nationwide have fallen to historic lows, report finds",
      "link": "https://alabamareflector.com/2025/12/15/repub/arrests-nationwide-have-fallen-to-historic-lows-report-finds/",
      "thumbnail": "",
      "description": "Federal and local law enforcement officers arrest a man in Washington, D.C., in August. The number of arrests nationwide fell sharply in 2020 and have stayed down since then, according to a new report from the nonpartisa..."
    },
    {
      "title": "Where death sentences are handed down in Alabama",
      "link": "https://alabamareflector.com/2025/12/15/where-death-sentences-are-handed-down-in-alabama/",
      "thumbnail": "",
      "description": "An oxygen mask. Alabama attaches a similar-looking mask to a condemned inmate when conducting executions using nitrogen hypoxia. An Alabama Reflector analysis of death sentences handed down in the state since 2012 found ..."
    },
    {
      "title": "The past keeps seeping into Alabama’s present. No wonder leaders fear it",
      "link": "https://alabamareflector.com/2025/12/15/the-past-keeps-seeping-into-alabamas-present-no-wonder-leaders-fear-it/",
      "thumbnail": "",
      "description": "The Alabama State Board of Education at a meeting in August. The board has delayed a vote on the adoption of a new social studies textbook over the concerns of a few members. (Anna Barrett/Alabama Reflector)I wish I coul..."
    },
    {
      "title": "Alabama state education committee identifies ‘burdensome paperwork tasks’ for teachers",
      "link": "https://alabamareflector.com/2025/12/15/alabama-state-education-committee-identifies-burdensome-paperwork-tasks-for-teachers/",
      "thumbnail": "",
      "description": "A high school classroom in Florida. An Alabama state committee has identified the most \"burdensome\" paperwork responsibilities for Alabama educators. (Getty Images)A committee told the Alabama State Department of Educati..."
    },
    {
      "title": "Lawsuit from Texas, Florida AGs takes another crack at limiting abortion pill access",
      "link": "https://alabamareflector.com/2025/12/14/repub/lawsuit-from-texas-florida-ags-takes-another-crack-at-limiting-abortion-pill-access/",
      "thumbnail": "",
      "description": "The attorneys general of Florida and Texas are suing the U.S. Food and Drug Administration, challenging access to and federal approval of mifepristone, a drug used to terminate early pregnancies. It’s the third ongoing l..."
    },
    {
      "title": "‘The unthinkable has happened.’ 2 killed, nine injured in mass shooting on Brown University campus",
      "link": "https://alabamareflector.com/2025/12/13/repub/the-unthinkable-has-happened-2-killed-eight-injured-in-mass-shooting-on-brown-university-campus/",
      "thumbnail": "",
      "description": "A screenshot of the suspected shooter is shown after leaving the Barus and Holley engineering building's Hope Street side. Police say the shooter took a right onto Waterman Street. (Screenshot from Providence police vide..."
    },
    {
      "title": "An ever-larger share of ICE’s arrested immigrants have no criminal record",
      "link": "https://alabamareflector.com/2025/12/13/repub/an-ever-larger-share-of-ices-arrested-immigrants-have-no-criminal-record/",
      "thumbnail": "",
      "description": "There were 105 immigration arrests in October at a horse racetrack in Wilder, Idaho. Idaho saw one of the country’s largest increases in immigration arrests this year through mid-October compared with the same period in ..."
    }
  ],
  "lastUpdated": "2025-12-16T04:52:42.642Z"
}