{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama House bill would create sales tax holiday for guns",
      "link": "https://alabamareflector.com/2026/02/17/alabama-house-bill-would-create-sales-tax-holiday-for-guns/",
      "thumbnail": "",
      "description": "Rep. Chris Sells, R-Greenville, speaks to a colleague on the floor of the Alabama House of Representatives on Feb. 12, 2025 at the Alabama Statehouse in Montgomery, Alabama. A House committee last week approved a bill sp..."
    },
    {
      "title": "Small business owners squeezed by Trump tariffs await Supreme Court decision",
      "link": "https://alabamareflector.com/2026/02/17/repub/small-business-owners-squeezed-by-trump-tariffs-await-supreme-court-decision/",
      "thumbnail": "",
      "description": "Tristan Wright, founder and president of Lost Boy Cider, stands near his production line on Feb. 6, 2026, in Alexandria, Virginia. (Photo by Ashley Murray/States Newsroom)WASHINGTON — Aluminum cans rolling off Virginia c..."
    },
    {
      "title": "Federal judge orders the restoration of exhibits on slavery to the President’s House in Philadelphia",
      "link": "https://alabamareflector.com/2026/02/16/repub/federal-judge-orders-the-restoration-of-exhibits-on-slavery-to-the-presidents-house-in-philadelphia/",
      "thumbnail": "",
      "description": "Tourists inspect a display entitled 'The Dirty Business of Slavery' at the President's House on August 9, 2025 in Philadelphia. (Photo by Matthew Hatcher/Getty Images)In a scathing opinion, U.S. District Court Judge Cynt..."
    },
    {
      "title": "After Minnesota church protest, Alabama, other states move to crack down on disruptions",
      "link": "https://alabamareflector.com/2026/02/16/repub/after-minnesota-church-protest-alabama-other-states-move-to-crack-down-on-disruptions/",
      "thumbnail": "",
      "description": "Oklahoma Republican state Sen. Todd Gollihare discusses on the Oklahoma Senate floor this month a bill he sponsored designed to protect against the disruption of worship services. The measure, which was signed into law, ..."
    },
    {
      "title": "Michigan GOP gubernatorial candidate repeatedly threatens to hang elected officials for ‘treason’",
      "link": "https://alabamareflector.com/2026/02/16/repub/michigan-gop-gubernatorial-candidate-repeatedly-threatens-to-hang-elected-officials-for-treason/",
      "thumbnail": "",
      "description": "Republican gubernatorial candidate Anthony Hudson speaking to the Mason City Council. Feb. 2, 2026 | ScreenshotAnthony Hudson, a Genesee County truck driver running for the Republican nomination for governor, has made a ..."
    },
    {
      "title": "As Trump administration pushes for more detentions, immigrants’ options for parole shrink",
      "link": "https://alabamareflector.com/2026/02/16/repub/as-trump-administration-pushes-for-more-detentions-immigrants-options-for-parole-shrink/",
      "thumbnail": "",
      "description": "A sign identifies the Torrance County Detention Facility in Estancia, N.M., where many immigrants are held. A new court ruling and proposed federal rule are making it harder for detained immigrants to appeal for relief i..."
    },
    {
      "title": "In DeKalb County, English Language Learner instructors teach, translate and calm fears",
      "link": "https://alabamareflector.com/2026/02/16/in-dekalb-county-english-language-learner-instructors-teach-translate-and-calm-fears/",
      "thumbnail": "",
      "description": "Students read during Elizabeth Barrientos’ second-grade class at Collinsville Elementary School on Tuesday, Feb. 10, 2026. Barrientos teaches English Language Learners in DeKalb County, which has the third-highest percen..."
    },
    {
      "title": "Canceling elections won’t lower Alabama power bills",
      "link": "https://alabamareflector.com/2026/02/16/canceling-elections-wont-lower-alabama-power-bills/",
      "thumbnail": "",
      "description": "Rep. Chip Brown, R-Hollinger's Island, prepares to speak to reporters at the Alabama Statehouse on Feb. 12, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House on Friday delayed a vote on a bill that..."
    },
    {
      "title": "Alabama State Board of Education members clash over delayed social studies textbook vote",
      "link": "https://alabamareflector.com/2026/02/16/alabama-state-board-of-education-members-clash-over-delayed-social-studies-textbook-vote/",
      "thumbnail": "",
      "description": "Left to right: Alabama State Board of Education Members, Tonya Chestnut, Jackie Zeigler, Allen Long and Wayne Reynolds listen during a debate over regarding social studies textbooks on Feb. 12, 2026. (Andrea Tinker/Alaba..."
    },
    {
      "title": "Bipartisan efforts to boost birth control access emerge as GOP keeps pushing abortion pill bills",
      "link": "https://alabamareflector.com/2026/02/15/repub/bipartisan-efforts-to-boost-birth-control-access-emerge-as-gop-keeps-pushing-abortion-pill-bills/",
      "thumbnail": "",
      "description": "Legislation approved on Feb. 3, 2026, by the South Carolina House would classify mifepristone and misoprostol as controlled dangerous substances. (Photo by Anna Moneymaker/Getty Images)Republican-majority legislatures ha..."
    }
  ],
  "lastUpdated": "2026-02-17T14:01:32.876Z"
}