{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Privacy concerns linger in reproductive health care despite HIPAA lawsuit’s dismissal",
      "link": "https://alabamareflector.com/2025/12/07/repub/privacy-concerns-linger-in-reproductive-health-care-despite-hipaa-lawsuits-dismissal/",
      "thumbnail": "",
      "description": "A Biden-era protection for reproductive and gender affirming health care information was upended by a federal judge in Texas in June. Despite several lawsuits, key privacy rules for medical records remain, but some exper..."
    },
    {
      "title": "Dozens of cities, states hiking minimum wages in 2026 amid federal inaction",
      "link": "https://alabamareflector.com/2025/12/06/repub/dozens-of-cities-states-hiking-minimum-wages-in-2026-amid-federal-inaction/",
      "thumbnail": "",
      "description": "A server waits on customers at a café. The minimum hourly wage for workers will increase in dozens of cities, counties and states in January. (Photo by Scott Olson/Getty Images)The minimum wage for workers will increase ..."
    },
    {
      "title": "With homelessness rising, new federal rules could benefit states that take tougher approaches",
      "link": "https://alabamareflector.com/2025/12/05/repub/with-homelessness-rising-new-federal-rules-could-benefit-states-that-take-tougher-approaches/",
      "thumbnail": "",
      "description": "A homeless man sits in his tent in Washington, D.C., this summer. New rules from the U.S. Department of Housing and Urban Development will sharply restrict how $3 billion in homelessness aid will be spent, allowing no mo..."
    },
    {
      "title": "Trump order ending birthright citizenship to be argued at US Supreme Court",
      "link": "https://alabamareflector.com/2025/12/05/repub/trump-order-ending-birthright-citizenship-to-be-argued-at-us-supreme-court/",
      "thumbnail": "",
      "description": "The U.S. Supreme Court on Oct. 9, 2024. (Photo by Jane Norman/States Newsroom)The U.S. Supreme Court said Friday justices will hear a case to decide if President Donald Trump’s order to end birthright citizenship is cons..."
    },
    {
      "title": "Texas becomes the first state to buy bitcoin as more states eye cryptocurrencies",
      "link": "https://alabamareflector.com/2025/12/05/repub/texas-becomes-the-first-state-to-buy-bitcoin-as-more-states-eye-cryptocurrencies/",
      "thumbnail": "",
      "description": "Bitcoin stickers are seen at Pubkey Bar in February 2024 in New York City. Texas became the first state to invest in the cryptocurrency, which continues to draw interest from federal and state leaders. (Photo by Michael ..."
    },
    {
      "title": "Alabama senator holds contracts in protest of local governments’ lawsuit over Internet sales tax",
      "link": "https://alabamareflector.com/2025/12/05/alabama-legislative-committee-holds-contracts-over-sales-tax-lawsuit/",
      "thumbnail": "",
      "description": "Sen. Greg Albritton, R-Atmore, speaks on the phone during a session of the Alabama Senate on April 3, 2025 at the Alabama Statehouse in Montgomery, Alabama. Albritton Thursday put a hold on four legal services contracts,..."
    },
    {
      "title": "U.S. work authorizations for legal immigrants slashed from 5 years to 18 months",
      "link": "https://alabamareflector.com/2025/12/05/repub/u-s-work-authorizations-for-legal-immigrants-slashed-from-5-years-to-18-months/",
      "thumbnail": "",
      "description": "Farm workers harvesting yellow bell peppers near Gilroy, California. (Nnehring/Getty Images)WASHINGTON — The Trump administration Thursday announced new restrictions for immigrants, reducing the work authorization period..."
    },
    {
      "title": "Signalgate report says Hegseth created a risk to national security with cellphone messages",
      "link": "https://alabamareflector.com/2025/12/04/repub/signalgate-report-says-hegseth-created-a-risk-to-national-security-with-cellphone-messages/",
      "thumbnail": "",
      "description": "U.S. Rep. Raja Krishnamoorthi, D-Ill., points to text messages by Defense Secretary Pete Hegseth during an annual worldwide threats assessment hearing at the Longworth House Office Building on March 26, 2025 in Washingto..."
    },
    {
      "title": "Man arrested in January 2021 pipe bomb case targeting party headquarters",
      "link": "https://alabamareflector.com/2025/12/04/repub/man-arrested-in-january-2021-pipe-bomb-case-targeting-party-headquarters/",
      "thumbnail": "",
      "description": "Attorney General Pam Bondi spoke on the arrest of Brian J. Cole Jr. from Department of Justice headquarters in Washington, D.C., on Thursday, Dec. 4, 2025. Standing behind Bondi, from left to right, Metropolitan Police D..."
    },
    {
      "title": "Health subsidies would continue for 3 years under Dem bill to be voted on in US Senate",
      "link": "https://alabamareflector.com/2025/12/04/repub/health-subsidies-would-continue-for-3-years-under-dem-bill-to-be-voted-on-in-us-senate/",
      "thumbnail": "",
      "description": "U.S. Senate Minority Leader Chuck Schumer, D-N.Y., and House Minority Leader Hakeem Jeffries, D-N.Y., speak with reporters during a press conference in the U.S. Capitol building in Washington, D.C., on Wednesday, Dec. 3,..."
    }
  ],
  "lastUpdated": "2025-12-08T08:57:13.472Z"
}