{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "States move to ban NDAs that silence survivors of child sexual abuse",
      "link": "https://alabamareflector.com/2026/02/04/repub/states-move-to-ban-ndas-that-silence-survivors-of-child-sexual-abuse/",
      "thumbnail": "",
      "description": "Alabama state Sen. Matt Woods, a Republican, speaks to a colleague on the floor of the Alabama Senate in January. The Senate passed a bill Woods sponsored that would prohibit civil courts from issuing nondisclosure agree..."
    },
    {
      "title": "Family of Renee Good, citizens hurt by DHS detail violence to Democratic panel",
      "link": "https://alabamareflector.com/2026/02/04/repub/family-of-renee-good-citizens-hurt-by-dhs-detail-violence-to-democratic-panel/",
      "thumbnail": "",
      "description": "Brent Ganger, far left, and Luke Ganger, second from left, brothers of Renee Good, watch a forum on Department of Homeland Security use of force organized by congressional Democrats on Feb. 3, 2026. Good was killed by a ..."
    },
    {
      "title": "Alabama Senate passes bill banning stricter state environmental rules than federal government",
      "link": "https://alabamareflector.com/2026/02/04/alabama-senate-passes-bill-banning-stricter-state-environmental-regulations-than-federal-government/",
      "thumbnail": "",
      "description": "Sen. Donnie Chesteen, R-Geneva, left, talking to Sen. Rodger Smitherman, D-Birmingham, on the floor of the Alabama Senate in the Alabama Statehouse in Montgomery, Alabama, on Feb. 3, 2026. The Senate passed Chesteen's bi..."
    },
    {
      "title": "Alabama House OKs bill restricting some self-defense arguments in court cases",
      "link": "https://alabamareflector.com/2026/02/04/alabama-house-oks-bill-restricting-some-self-defense-arguments-in-court-cases/",
      "thumbnail": "",
      "description": "Rep. David Faulkner, R-Mountain Brook, speaks during a debate in the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House of Representatives Tuesday passed ..."
    },
    {
      "title": "Alabama House approves bill banning foreign campaign contributions",
      "link": "https://alabamareflector.com/briefs/alabama-house-approves-bill-banning-foreign-campaign-contributions/",
      "thumbnail": "",
      "description": "Rep. James Lomax, R-Huntsville, stands on the floor of the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House of Representatives Tuesday approved a bill sponsored..."
    },
    {
      "title": "Kristin Nelson wins House District 38 special election in Chambers, Lee counties",
      "link": "https://alabamareflector.com/2026/02/03/kristin-nelson-wins-house-district-38-special-election-in-chambers-lee-counties/",
      "thumbnail": "",
      "description": "Republican voters in Chambers and Lee counties chose Kristin Nelson as their nominee in the House District 38 special election. Nelson will face Democratic candidate Hazel Floyd on Feb. 3. (photo courtesy of candidate)Ch..."
    },
    {
      "title": "Trump doubles down on calling for the feds to take over state elections",
      "link": "https://alabamareflector.com/2026/02/03/repub/trump-doubles-down-on-calling-for-the-feds-to-take-over-state-elections/",
      "thumbnail": "",
      "description": "President Donald Trump gives a speech at the World Economic Forum on Jan. 21, 2026 in Davos, Switzerland. (Photo by Chip Somodevilla/Getty Images)President Donald Trump restated a call Tuesday for federal control over el..."
    },
    {
      "title": "US House Democrats call for Kristi Noem’s firing in rally outside ICE headquarters",
      "link": "https://alabamareflector.com/2026/02/03/repub/us-house-democrats-call-for-kristi-noems-firing-in-rally-outside-ice-headquarters/",
      "thumbnail": "",
      "description": "Rep. Delia Ramirez, D-Ill., a member of the U.S. House Subcommittee on Border Security and Enforcement and of the Congressional Hispanic Caucus, speaks outside of U.S. Immigration and Customs Enforcement headquarters in ..."
    },
    {
      "title": "Bill extending death penalty to child sexual assault passes Alabama Senate committee",
      "link": "https://alabamareflector.com/2026/02/03/bill-extending-death-penalty-to-child-sexual-assault-passes-alabama-senate-committee/",
      "thumbnail": "",
      "description": "Sen. April Weaver, R-Alabaster, walks to her seat in the Alabama Senate on May 1, 2025 at the Alabama Statehouse in Montgomery, Alabama. The Senate Judiciary Committee Tuesday approved a bill that would allow prosecutors..."
    },
    {
      "title": "Trump signs funding bill, setting up immigration enforcement debate",
      "link": "https://alabamareflector.com/2026/02/03/repub/us-house-sends-funding-bill-to-trump-setting-up-immigration-enforcement-debate/",
      "thumbnail": "",
      "description": "President Donald Trump signs a government funding bill in the Oval Office of the White House on Feb. 3, 2026. (Photo by Alex Wong/Getty Images)WASHINGTON — The partial government shutdown that began this weekend ended Tu..."
    }
  ],
  "lastUpdated": "2026-02-04T18:37:05.911Z"
}