{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Stock trading by members of Congress could be banned in bipartisan push",
      "link": "https://alabamareflector.com/2025/11/19/repub/stock-trading-by-members-of-congress-could-be-banned-in-bipartisan-push/",
      "thumbnail": "",
      "description": "Traders work as the market opens on the floor of the New York Stock Exchange on Nov. 18, 2025 in New York City. (Photo by Spencer Platt/Getty Images)WASHINGTON — At least 25 bills have been introduced this Congress to fu..."
    },
    {
      "title": "Immigration officers targeting Latinos causing unlawful arrests, group says",
      "link": "https://alabamareflector.com/2025/11/19/repub/immigration-officers-targeting-latinos-causing-unlawful-arrests-group-says/",
      "thumbnail": "",
      "description": "Masked federal immigration officers talk while they patrol at the Jacob K. Javitz Federal Building in New York City on Oct. 16, 2025. (Photo by Michael M. Santiago/Getty Images)&nbsp;WASHINGTON — Federal immigration offi..."
    },
    {
      "title": "Alabama study commission explores resources for first responders with PTSD",
      "link": "https://alabamareflector.com/2025/11/19/alabama-study-commission-explores-resources-for-first-responders-with-ptsd/",
      "thumbnail": "",
      "description": "Operators work at Crisis Center, a United Way associated resource serving individuals in Central Alabama who may be experiencing personal crisis and mental health issues, in Birmingham on July 3, 2023. Alabama Department..."
    },
    {
      "title": "FDA’s abortion pill safety review under growing scrutiny",
      "link": "https://alabamareflector.com/2025/11/19/repub/fdas-abortion-pill-safety-review-under-growing-scrutiny/",
      "thumbnail": "",
      "description": "U.S. Health and Human Services Secretary Robert F. Kennedy Jr., shown here in September, cited a white paper funded and self-published without peer review by anti-abortion groups as grounds for federal scrutiny of a key ..."
    },
    {
      "title": "Alabama Public Television to maintain PBS programming",
      "link": "https://alabamareflector.com/2025/11/19/alabama-public-television-to-maintain-pbs-programming/",
      "thumbnail": "",
      "description": "A person holds up a sign supporting PBS during the Alabama Educational Television Commission's meeting on Nov. 18, 2025 in Birmingham. The AETC voted to maintain PBS programming through the end of their contract in June ..."
    },
    {
      "title": "Bessemer officials approve data center construction despite environmental concerns",
      "link": "https://alabamareflector.com/2025/11/19/bessemer-officials-approve-data-center-construction-despite-environmental-concerns/",
      "thumbnail": "",
      "description": "A plan for a data center is displayed before Bessemer City Council members during a hearing on Nov. 18, 2025 in Bessemer, Alabama. The council voted to approve rezoning for a data center that drew criticism from resident..."
    },
    {
      "title": "Kristin Nelson wins House District 38 GOP nomination",
      "link": "https://alabamareflector.com/2025/11/18/kristin-nelson-wins-house-district-38-gop-nomination/",
      "thumbnail": "",
      "description": "Republican voters in Chambers and Lee counties chose Kristin Nelson as their nominee in the House District 38 special election. Nelson will face Democratic candidate Hazel Floyd in a Feb. 3 general election. (photo court..."
    },
    {
      "title": "Shortage of rural doctors won’t end anytime soon, report says",
      "link": "https://alabamareflector.com/2025/11/18/repub/shortage-of-rural-doctors-wont-end-anytime-soon-report-says/",
      "thumbnail": "",
      "description": "A farmhouse sits along a gravel road near Elgin, Iowa. For at least the next dozen years, rural areas will continue to have only about two-thirds of the primary care physicians they need, according to a new report. (Phot..."
    },
    {
      "title": "Trump administration urged by US House Dems to act on health insurance claim denials",
      "link": "https://alabamareflector.com/2025/11/18/repub/trump-administration-urged-by-us-house-dems-to-act-on-health-insurance-claim-denials/",
      "thumbnail": "",
      "description": "Health insurance claim form. (krisanapong detraphiphat/Getty Images)WASHINGTON — Two leading Democrats on a U.S. House panel called on the head of an agency within the U.S. Department of Labor responsible for protecting ..."
    },
    {
      "title": "Trump administration unveils plan to try to dismantle Department of Education",
      "link": "https://alabamareflector.com/2025/11/18/repub/breaking-trump-administration-unveils-plan-to-try-to-dismantle-department-of-education/",
      "thumbnail": "",
      "description": "The Lyndon Baines Johnson Department of Education Building in Washington, D.C., pictured on Nov. 25, 2024. (Photo by Shauneen Miranda/States Newsroom)This report has been updated. WASHINGTON — President Donald Trump’s ad..."
    }
  ],
  "lastUpdated": "2025-11-19T22:37:32.071Z"
}