{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "As Trump pushes voting restrictions, states have a rarely used option to push back",
      "link": "https://alabamareflector.com/2026/02/22/repub/as-trump-pushes-voting-restrictions-states-have-a-rarely-used-option-to-push-back/",
      "thumbnail": "",
      "description": "Voters leave a polling place in Louisiana during the November 2024 election. The Trump administration is pushing federal legislation that would require individuals to prove their citizenship to register to vote. (Photo b..."
    },
    {
      "title": "The Selma home that Martin Luther King Jr. made his ‘safe landing spot’ is now in Michigan",
      "link": "https://alabamareflector.com/2026/02/21/repub/the-selma-home-that-martin-luther-king-jr-made-his-safe-landing-spot-is-now-in-michigan/",
      "thumbnail": "",
      "description": "The Selma, Ala. Jackson Home, a civil rights landmark, has been acquired by The Henry Ford at Greenfield Village | The Henry Ford at Greenfield Village photoThis is the third in a series of articles by Michigan Advance t..."
    },
    {
      "title": "Governors say Trump told them he won’t force immigration enforcement surges on states",
      "link": "https://alabamareflector.com/2026/02/20/repub/governors-say-trump-told-them-he-wont-force-immigration-enforcement-surges-on-states/",
      "thumbnail": "",
      "description": "President Donald Trump delivers remarks during a working breakfast with governors in the State Dining Room at the White House on Feb. 20, 2026 in Washington, D.C. (Photo by Kevin Dietsch/Getty Images)WASHINGTON — Preside..."
    },
    {
      "title": "Trump vows new tariffs, attacks Supreme Court justices after ruling",
      "link": "https://alabamareflector.com/2026/02/20/repub/trump-vows-new-tariffs-attacks-supreme-court-justices-after-ruling/",
      "thumbnail": "",
      "description": "President Donald Trump speaks during a press briefing at the White House Feb. 20, 2026 in Washington, D.C., after the U.S. Supreme Court ruled against his use of emergency powers to implement international trade tariffs...."
    },
    {
      "title": "What passed in the Alabama Legislature: Feb. 17-19, 2026",
      "link": "https://alabamareflector.com/2026/02/20/what-passed-in-the-alabama-legislature-feb-17-19-2026/",
      "thumbnail": "",
      "description": "Rep. Margie Wilcox, R-Mobile, throws a Moon Pie to a House staffer on Feb. 17, 2026, in the Alabama House of Representatives chamber in Montgomery, Alabama. Tuesday was Mardi Gras, a holiday in Mobile and Baldwin countie..."
    },
    {
      "title": "US Supreme Court rules against Trump’s tariffs in 6-3 opinion, dealing blow to trade agenda",
      "link": "https://alabamareflector.com/2026/02/20/repub/us-supreme-court-rules-against-trumps-tariffs-in-6-3-opinion/",
      "thumbnail": "",
      "description": "The U.S. Supreme Court on Oct. 9, 2024. (Photo by Jane Norman/States Newsroom)WASHINGTON — The U.S. Supreme Court dealt a major blow to President Donald Trump’s trade agenda Friday, ruling the tariffs he issued under the..."
    },
    {
      "title": "Experts: Ending Alabama PSC elections will likely do little to lower power bills",
      "link": "https://alabamareflector.com/2026/02/20/experts-ending-alabama-psc-elections-will-likely-do-little-to-lower-power-bills/",
      "thumbnail": "",
      "description": "The Alabama House of Representatives is considering legislation that would end elections to the Alabama Public Service Commission and replace it with an appointed body. Supporters said it could lower Alabama's high power..."
    },
    {
      "title": "Alabama Senate passes bill requiring ‘sexual risk avoidance’ education",
      "link": "https://alabamareflector.com/2026/02/20/senate-passes-bill-requiring-sexual-risk-avoidance-education/",
      "thumbnail": "",
      "description": "Sen. Shay Shelnutt, R-Trussville, speaks on the floor of the Alabama Senate on Feb. 19, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate passed Shelnutt's bill Thursday requiring \"sexual risk avoidace\" s..."
    },
    {
      "title": "Dems push to revert to earlier immigration policy to rein in Trump’s crackdown",
      "link": "https://alabamareflector.com/2026/02/19/repub/dems-push-to-revert-to-earlier-immigration-policy-to-rein-in-trumps-crackdown/",
      "thumbnail": "",
      "description": "Federal agents stage at a front gate as Reps. Ilhan Omar, Kelly Morrison and Rep. Angie Craig, all Minnesota Democrats, attempt to enter the regional Immigration and Customs Enforcement headquarters at the Bishop Henry W..."
    },
    {
      "title": "Gov. Kay Ivey signs controversial environmental regulation bill into law",
      "link": "https://alabamareflector.com/2026/02/19/gov-kay-ivey-signs-controversial-environmental-regulation-bill-into-law/",
      "thumbnail": "",
      "description": "Gov. Kay Ivey delivers the State of the State Address at the Alabama State Capitol on Tuesday, Jan. 13, 2026, in Montgomery, Ala. Ivey Tuesday signed a controversial bill that would prevent the state from having stricter..."
    }
  ],
  "lastUpdated": "2026-02-22T14:19:02.896Z"
}