{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "House committee approves bill to allow local agencies to enforce immigration laws",
      "link": "https://alabamareflector.com/2026/01/29/house-committee-approves-bill-to-allow-local-agencies-to-enforce-immigration-laws/",
      "thumbnail": "",
      "description": "Rep. Ernie Yarbrough, R-Trinity, speaking to a colleague on the floor of the Alabama House of Representatives on Jan. 21, 2026, in Montgomery, Alabama, in the Alabama State House. The House Judiciary passed a bill he spo..."
    },
    {
      "title": "Alabama Senate committee considers bill requiring physicians 24/7 at emergency rooms",
      "link": "https://alabamareflector.com/2026/01/29/senate-committee-considers-bill-requiring-24-7-physicians-at-emergency-rooms/",
      "thumbnail": "",
      "description": "Sen. Larry Stutts, R-Tuscambia, listening to a colleague at a Senate Health Care Committee meeting on Jan. 28, 2026, at the Alabama State House in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)An Alabama Senate co..."
    },
    {
      "title": "App store age verification bill advances in Alabama Senate",
      "link": "https://alabamareflector.com/2026/01/29/app-store-age-verification-bill-advances-in-alabama-senate/",
      "thumbnail": "",
      "description": "Rep. Chris Sells, R-Greenville, speaks to a colleague on the floor of the Alabama House of Representatives on Feb. 12, 2025 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)An Alabama Sena..."
    },
    {
      "title": "US Senate Dems demand mask ban, body camera requirement, IDs for immigration agents",
      "link": "https://alabamareflector.com/2026/01/28/repub/us-senate-dems-demand-mask-ban-body-camera-requirement-ids-for-immigration-agents/",
      "thumbnail": "",
      "description": "A masked U.S. Immigration and Customs Enforcement agent knocks on a car window in Minnesota on Jan. 12, 2026. (Photo by Nicole Neri/Minnesota Reformer)WASHINGTON — U.S. Senate Democrats on Wednesday detailed the “common ..."
    },
    {
      "title": "Rehabilitation service delays in Alabama prisons draw criticism from lawmakers",
      "link": "https://alabamareflector.com/2026/01/28/rehabilitation-service-delays-in-alabama-prisons-draw-criticism-from-lawmakers/",
      "thumbnail": "",
      "description": "An inmate in the custody of the Department of Corrections. Lawmakers expressed concerns Wednesday over the process for how people in prison receive rehabilitation services, especially substance abuse. (File)Legislators t..."
    },
    {
      "title": "Alabama House committee approves bill requiring job accommodations for breastfeeding mothers",
      "link": "https://alabamareflector.com/briefs/alabama-house-committee-approves-bill-requiring-job-accommodations-for-breastfeeding-mothers/",
      "thumbnail": "",
      "description": "Rep. Juandalynn Givan, D-Birmingham, speaking to the House Health Committee on Jan. 28, 2026, at the Alabama State House in Montgomery, Alabama. The committee unanimously approved Givan's bill requiring employers to make..."
    },
    {
      "title": "Alabama Senate bill would allow counties and cities to fire library boards",
      "link": "https://alabamareflector.com/2026/01/28/alabama-senate-bill-would-allow-counties-and-cities-to-fire-library-boards/",
      "thumbnail": "",
      "description": "Sen. Chris Elliott, R-Josephine (right) speaks to Sen. Lance Bell, R-Pell City (left) on the floor of the Alabama Senate on Jan. 20, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate County and Municipal ..."
    },
    {
      "title": "Senate committee OKs bill exempting some K-12, higher ed construction projects from inspections",
      "link": "https://alabamareflector.com/2026/01/28/senate-committee-oks-bill-exempting-some-k-12-higher-ed-construction-projects-from-inspections/",
      "thumbnail": "",
      "description": "Sen. Larry Stutts, R-Tuscumbia, walks on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)An Alabama Senate Committee passed a bill Wednesd..."
    },
    {
      "title": "State lawmakers stand ready to help ICE — or impede it",
      "link": "https://alabamareflector.com/2026/01/28/repub/state-lawmakers-stand-ready-to-help-ice-or-impede-it/",
      "thumbnail": "",
      "description": "People gather near the spot where federal agents shot and killed Alex Pretti on Jan. 24, the third shooting in Minneapolis in as many weeks. Lawmakers in more than a dozen states have introduced a wave of bills aimed at ..."
    },
    {
      "title": "Attack on US Rep. Ilhan Omar follows major uptick in threats against members of Congress",
      "link": "https://alabamareflector.com/2026/01/28/repub/attack-on-us-rep-ilhan-omar-follows-major-uptick-in-threats-against-members-of-congress/",
      "thumbnail": "",
      "description": "U.S. Rep. Ilhan Omar, D-Minn., left, and Rep. Angie Craig, D-Minn., stand outside the regional ICE headquarters at the Bishop Henry Whipple Federal Building on Jan. 10, 2026 in Minneapolis, Minnesota. &nbsp;A man squirte..."
    }
  ],
  "lastUpdated": "2026-01-29T17:04:04.952Z"
}