{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Planned Parenthood ends suit against Trump administration over serving Medicaid patients",
      "link": "https://alabamareflector.com/2026/02/02/repub/planned-parenthood-ends-suit-against-trump-administration-over-serving-medicaid-patients/",
      "thumbnail": "",
      "description": "A Planned Parenthood clinic in Salt Lake City on Wednesday, July 31, 2024. (Photo by McKenzie Romero/Utah News Dispatch)WASHINGTON — A federal judge on Monday closed the lawsuit Planned Parenthood filed last summer after..."
    },
    {
      "title": "Noem: Body cameras to be deployed to immigration agents, starting in Minneapolis",
      "link": "https://alabamareflector.com/2026/02/02/repub/noem-body-cameras-to-be-deployed-to-immigration-agents-starting-in-minneapolis/",
      "thumbnail": "",
      "description": "U.S. Secretary of Homeland Security Kristi Noem at a roundtable discussion with local ranchers and employees from U.S. Customs and Border Protection on Jan. 7, 2026 in Brownsville, Texas. (Photo by Michael Gonzalez/Getty..."
    },
    {
      "title": "Trump urges US House to avert ‘another long, pointless and destructive’ shutdown",
      "link": "https://alabamareflector.com/2026/02/02/repub/trump-urges-us-house-to-avert-another-long-pointless-and-destructive-shutdown/",
      "thumbnail": "",
      "description": "Speaker Mike Johnson, R-La., answers reporters’ questions after holding a press conference on Tuesday, Jan. 13, 2026. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — The U.S. House is expected to vote as soon as Tu..."
    },
    {
      "title": "Alabama GOP dismisses residency challenges against Tommy Tuberville, John Wahl",
      "link": "https://alabamareflector.com/2026/02/02/alabama-gop-dismisses-residency-challenges-against-tommy-tuberville-john-wahl/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, greets a crowd at an Alabama Republican Party fundraiser on Aug. 4, 2023. The Alabama Republican Party has dismissed challenges filed against Tuberville's eligibility for governor a..."
    },
    {
      "title": "Judge blocks DHS policy to keep House Dems from visiting detention facilities unannounced",
      "link": "https://alabamareflector.com/2026/02/02/repub/judge-blocks-dhs-policy-to-keep-house-dems-from-visiting-detention-facilities-unannounced/",
      "thumbnail": "",
      "description": "U.S. House Democrats, from left, Kelly Morrison, Ilhan Omar and Rep. Angie Craig, all of Minnesota, arrive outside of the regional Immigration and Customs Enfrocement headquarters at the Bishop Henry Whipple Federal Buil..."
    },
    {
      "title": "States that once led in child vaccination fall as they expand exemptions",
      "link": "https://alabamareflector.com/2026/02/02/repub/states-that-once-led-in-child-vaccination-fall-as-they-expand-exemptions/",
      "thumbnail": "",
      "description": "A sign at a University of Utah health clinic warns visitors about the spread of measles. Under the Trump administration, federal health officials have cut back the number of recommended vaccines, and more states are offe..."
    },
    {
      "title": "Report: Alabama population growth slowing amid immigration crackdown",
      "link": "https://alabamareflector.com/2026/02/02/report-alabama-population-growth-slowing-amid-immigration-crackdown/",
      "thumbnail": "",
      "description": "A citizen stands with sign during a protest against state immigration policies in Birmingham, Alabama, on Saturday February 22, 2025. A report from the Public Affairs Research Council of Alabama (PARCA) found immigration..."
    },
    {
      "title": "What Tommy Tuberville’s residency issues say about Alabama",
      "link": "https://alabamareflector.com/2026/02/02/what-tommy-tubervilles-residency-issues-say-about-alabama/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, addresses media questions in a press gaggle following his speech at the Montgomery Area Chamber of Commerce on Thursday, Oct. 16, 2025. Republican gubernatorial candidate Ken McFeet..."
    },
    {
      "title": "Alabama House votes to amend contract language for math, science teacher incentives",
      "link": "https://alabamareflector.com/2026/02/02/alabama-house-votes-to-amend-contract-language-for-math-science-teacher-incentives/",
      "thumbnail": "",
      "description": "Rep. Terri Collins, R-Decatur, speaks on the floor of the Alabama House of Representatives on Jan. 29, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House on Thursday approved a bill sponsored by Col..."
    },
    {
      "title": "Demand grows for doulas who can help moms with addiction",
      "link": "https://alabamareflector.com/2026/02/01/repub/demand-grows-for-doulas-who-can-help-moms-with-addiction/",
      "thumbnail": "",
      "description": "Founder of Eggbaby Doula Services Aleece Weaver, right, demonstrates the work she does with pregnant clients. Weaver does pro bono doula care with clients in recovery at Utah perinatal recovery clinic SUPeRAD. Peer recov..."
    }
  ],
  "lastUpdated": "2026-02-03T03:52:59.854Z"
}