{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Federal judge blocks Pentagon attempt to demote Sen. Mark Kelly over illegal orders video",
      "link": "https://alabamareflector.com/2026/02/12/repub/federal-judge-blocks-pentagon-attempt-to-demote-sen-mark-kelly-over-illegal-orders-video/",
      "thumbnail": "",
      "description": "Arizona Democratic Sen. Mark Kelly outside the District of Columbia federal courthouse where his lawsuit against the Department of Defense was heard on Feb. 3, 2026. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — ..."
    },
    {
      "title": "Department of Homeland Security shutdown nears, as US Senate remains stuck on funding",
      "link": "https://alabamareflector.com/2026/02/12/repub/department-of-homeland-security-shutdown-nears-as-us-senate-remains-stuck-on-funding/",
      "thumbnail": "",
      "description": "U.S. Senate Majority Leader John Thune, R-S.D., speaks with reporters on Capitol Hill on Friday, Sept. 19, 2025. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — The Department of Homeland Security is headed for a s..."
    },
    {
      "title": "Criminal justice is a top issue in state legislatures this year",
      "link": "https://alabamareflector.com/2026/02/12/repub/criminal-justice-is-a-top-issue-in-state-legislatures-this-year/",
      "thumbnail": "",
      "description": "Barbed wire and fences surround the Charles H. Hickey Jr. School, a juvenile detention center in Maryland. Juvenile justice is one of the focuses of criminal justice legislation nationwide this year, including in Marylan..."
    },
    {
      "title": "Alabama House approves harsher punishments for driving under the influence",
      "link": "https://alabamareflector.com/briefs/alabama-house-approves-harsher-punishments-for-driving-under-the-influence/",
      "thumbnail": "",
      "description": "Rep. Margie Wilcox, R-Mobile, speaks on the floor of the Alabama House of Representatives on Feb. 5, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House of Representatives passed her bill that increases the ..."
    },
    {
      "title": "Alabama House pulls bill ending Public Service Commission elections prior to vote",
      "link": "https://alabamareflector.com/2026/02/12/alabama-house-pulls-bill-ending-public-service-commission-elections-prior-to-vote/",
      "thumbnail": "",
      "description": "Rep. Chip Brown, R-Hollinger's Island, speaks to reporters in the Alabama House of Representatives on Feb. 12, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House Thursday pulled a bill sponsored by ..."
    },
    {
      "title": "Alabama House bill would allow probation for incarcerated pregnant women",
      "link": "https://alabamareflector.com/2026/02/12/alabama-house-bill-would-allow-probation-for-incarcerated-pregnant-women/",
      "thumbnail": "",
      "description": "Rep. Rolanda Hollis, D-Birmingham, speaks on the phone in the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House Judiciary Committee passed a bill sponsored by Ho..."
    },
    {
      "title": "Two House Democrats push for gambling, lottery bills as session nears halfway point",
      "link": "https://alabamareflector.com/2026/02/12/two-house-democrats-push-for-gambling-lottery-bills-as-session-nears-halfway-point/",
      "thumbnail": "",
      "description": "Alabama House Democrats Neil Rafferty, D-Birmingham (left); Phillip Ensler, D-Montgomery (center) and Kelvin Lawrence, D-Montgomery (right) at a press conference in the Alabama State House on February 11, 2026. Ensler an..."
    },
    {
      "title": "Bill creating treat-in-place ambulance program passes Alabama House committee",
      "link": "https://alabamareflector.com/2026/02/12/bill-creating-treat-in-place-ambulance-program-passes-alabama-house-committee/",
      "thumbnail": "",
      "description": "Rep. Ed Oliver, R-Dadeville, speaks to a colleague on the floor of the Alabama House of Representatives on Feb. 5, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House Health Committee passed Oliver's bill, w..."
    },
    {
      "title": "In Baldwin County, the vulnerable have just one ‘Safer Place’",
      "link": "https://alabamareflector.com/2026/02/12/in-baldwin-county-the-vulnerable-have-just-one-safer-place/",
      "thumbnail": "",
      "description": "A homeless man sleeping on the ground is seen in this 2018 photo. Alabama's Safer Places Act of 2021 aims to improve shelter from inclement weather around the state. (Getty Images)As a polar vortex dragged frigid, wet Ar..."
    },
    {
      "title": "US House approves bill mandating proof of citizenship for voting in federal elections",
      "link": "https://alabamareflector.com/2026/02/11/repub/us-house-approves-bill-mandating-proof-of-citizenship-for-voting-in-federal-elections/",
      "thumbnail": "",
      "description": "Booths await voters at the Pennington County Administration Building during early voting on Jan. 19, 2026, for a municipal election in Rapid City, South Dakota. (Photo by Seth Tupper/South Dakota Searchlight)WASHINGTON —..."
    }
  ],
  "lastUpdated": "2026-02-13T03:58:35.185Z"
}