{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Kristin Nelson wins House District 38 GOP nomination",
      "link": "https://alabamareflector.com/2025/11/18/kristin-nelson-wins-house-district-38-gop-nomination/",
      "thumbnail": "",
      "description": "Republican voters in Chambers and Lee counties chose Kristin Nelson as their nominee in the House District 38 special election. Nelson will face Democratic candidate Hazel Floyd in a Feb. 3 general election. (photo court..."
    },
    {
      "title": "Shortage of rural doctors won’t end anytime soon, report says",
      "link": "https://alabamareflector.com/2025/11/18/repub/shortage-of-rural-doctors-wont-end-anytime-soon-report-says/",
      "thumbnail": "",
      "description": "A farmhouse sits along a gravel road near Elgin, Iowa. For at least the next dozen years, rural areas will continue to have only about two-thirds of the primary care physicians they need, according to a new report. (Phot..."
    },
    {
      "title": "Trump administration urged by US House Dems to act on health insurance claim denials",
      "link": "https://alabamareflector.com/2025/11/18/repub/trump-administration-urged-by-us-house-dems-to-act-on-health-insurance-claim-denials/",
      "thumbnail": "",
      "description": "Health insurance claim form. (krisanapong detraphiphat/Getty Images)WASHINGTON — Two leading Democrats on a U.S. House panel called on the head of an agency within the U.S. Department of Labor responsible for protecting ..."
    },
    {
      "title": "Trump administration unveils plan to try to dismantle Department of Education",
      "link": "https://alabamareflector.com/2025/11/18/repub/breaking-trump-administration-unveils-plan-to-try-to-dismantle-department-of-education/",
      "thumbnail": "",
      "description": "The Lyndon Baines Johnson Department of Education Building in Washington, D.C., pictured on Nov. 25, 2024. (Photo by Shauneen Miranda/States Newsroom)This report has been updated. WASHINGTON — President Donald Trump’s ad..."
    },
    {
      "title": "US Senate agrees with overwhelming House vote to force release of Epstein files",
      "link": "https://alabamareflector.com/2025/11/18/repub/us-house-overwhelmingly-votes-to-force-release-of-epstein-files/",
      "thumbnail": "",
      "description": "Sky Roberts, left, brother of Virginia Giuffre, who was abused by Jeffrey Epstein, and his wife Amanda Roberts hold up a photo of Giuffre during a news conference on the Epstein Files Transparency Act outside the U.S. Ca..."
    },
    {
      "title": "Federal judge approves new Alabama Senate map redrawing Montgomery districts",
      "link": "https://alabamareflector.com/2025/11/18/federal-judge-approves-new-alabama-senate-map-redrawing-montgomery-districts/",
      "thumbnail": "",
      "description": "Alabama Senate convenes for a session, Feb. 25, 2025. A federal judge Monday ordered the implementation of a remedial plan to fulfill her order for a second majority-minority district, or something close to it, in Montgo..."
    },
    {
      "title": "Members of Democratic caucus press ICE for answers on detainment of pregnant women",
      "link": "https://alabamareflector.com/2025/11/18/repub/members-of-democratic-caucus-press-ice-for-answers-on-detainment-of-pregnant-women/",
      "thumbnail": "",
      "description": "A woman is detained by federal agents after exiting a hearing in immigration court at the Jacob K. Javits Federal Building on Sept. 3, 2025 in New York City. (Photo by Michael M. Santiago/Getty Images)WASHINGTON — More t..."
    },
    {
      "title": "Black and Hispanic students see gains on Alabama report card",
      "link": "https://alabamareflector.com/2025/11/18/black-and-hispanic-students-see-gains-on-alabama-report-card/",
      "thumbnail": "",
      "description": "Cassandra Compton, a teacher in the Sumter County School System, teaches a group of elementary students in the Sumter Central High School in York, Alabama on June 26, 2025, Black and Hispanic students showed gains on the..."
    },
    {
      "title": "A voter’s guide to the House District 38 special GOP primary runoff",
      "link": "https://alabamareflector.com/2025/11/18/a-voters-guide-to-the-house-district-38-special-gop-primary-runoff/",
      "thumbnail": "",
      "description": "Garrett Dixon (left) and Kristin Nelson will face off in a special GOP primary runoff election for House District 38 in Chambers and Lee counties on Nov. 18. The winner of the runoff will face Democratic candidate Hazel ..."
    },
    {
      "title": "Judge cites ‘profound investigative missteps’ in court case against James Comey",
      "link": "https://alabamareflector.com/2025/11/17/repub/judge-cites-profound-investigative-missteps-in-court-case-against-james-comey/",
      "thumbnail": "",
      "description": "Former FBI Director James Comey testifies before the Senate Intelligence Committee in the Hart Senate Office Building on Capitol Hill on June 8, 2017 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images)WASHINGTON..."
    }
  ],
  "lastUpdated": "2025-11-19T06:53:10.119Z"
}