{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Experts: Ending Alabama PSC elections will likely do little to lower power bills",
      "link": "https://alabamareflector.com/2026/02/20/experts-ending-alabama-psc-elections-will-likely-do-little-to-lower-power-bills/",
      "thumbnail": "",
      "description": "The Alabama House of Representatives is considering legislation that would end elections to the Alabama Public Service Commission and replace it with an appointed body. Supporters said it could lower Alabama's high power..."
    },
    {
      "title": "Alabama Senate passes bill requiring ‘sexual risk avoidance’ education",
      "link": "https://alabamareflector.com/2026/02/20/senate-passes-bill-requiring-sexual-risk-avoidance-education/",
      "thumbnail": "",
      "description": "Sen. Shay Shelnutt, R-Trussville, speaks on the floor of the Alabama Senate on Feb. 19, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate passed Shelnutt's bill Thursday requiring \"sexual risk avoidace\" s..."
    },
    {
      "title": "Dems push to revert to earlier immigration policy to rein in Trump’s crackdown",
      "link": "https://alabamareflector.com/2026/02/19/repub/dems-push-to-revert-to-earlier-immigration-policy-to-rein-in-trumps-crackdown/",
      "thumbnail": "",
      "description": "Federal agents stage at a front gate as Reps. Ilhan Omar, Kelly Morrison and Rep. Angie Craig, all Minnesota Democrats, attempt to enter the regional Immigration and Customs Enforcement headquarters at the Bishop Henry W..."
    },
    {
      "title": "Gov. Kay Ivey signs controversial environmental regulation bill into law",
      "link": "https://alabamareflector.com/2026/02/19/gov-kay-ivey-signs-controversial-environmental-regulation-bill-into-law/",
      "thumbnail": "",
      "description": "Gov. Kay Ivey delivers the State of the State Address at the Alabama State Capitol on Tuesday, Jan. 13, 2026, in Montgomery, Ala. Ivey Tuesday signed a controversial bill that would prevent the state from having stricter..."
    },
    {
      "title": "Alabama Senate passes bill easing voting rights restoration for those convicted of felonies",
      "link": "https://alabamareflector.com/2026/02/19/alabama-senate-passes-bill-easing-voting-rights-restoration-for-those-convicted-of-felonies/",
      "thumbnail": "",
      "description": "Sen. Linda Coleman-Madison, D-Birmingham, speaks with a colleague on the floor of the Alabama Senate on Feb. 10, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate passed Coleman-Madison's bill that would ..."
    },
    {
      "title": "Alabama State Health Officer: ‘Fully expect’ to see measles in the state",
      "link": "https://alabamareflector.com/2026/02/19/alabama-state-health-officer-fully-expect-to-see-measles-in-the-state/",
      "thumbnail": "",
      "description": "Dr. Scott Harris, Alabama State Health Officer, at the Oversight Commission on Opioid Settlement Funds meeting on Feb. 18, 2026, in the Alabama Statehouse in Montgomery, Alabama. Harris said Thursday the state is prepari..."
    },
    {
      "title": "Legislation allowing firings of library board members moves closer to Alabama House vote",
      "link": "https://alabamareflector.com/2026/02/19/alabama-house-committee-oks-bill-allowing-firing-of-library-board-members-with-changes/",
      "thumbnail": "",
      "description": "Sen. Chris Elliott, R-Josephine (right) speaks with Sen. Clyde Chambliss, R-Prattville (left) and Steve Livingston, R-Scottsboro (center) on the floor of the Alabama Senate on Feb. 17, 2026, in Montgomery, Alabama. The H..."
    },
    {
      "title": "Organ donors would get guaranteed leave, insurance protections under Alabama House bill",
      "link": "https://alabamareflector.com/2026/02/19/organ-donors-would-get-guaranteed-leave-insurance-protections-under-alabama-house-bill/",
      "thumbnail": "",
      "description": "House Minority Leader Anthony Daniels, D-Huntsville, speaks to House Speaker Pro Tem Chris Pringle, R-Mobile, on the floor of the Alabama House of Representatives on Jan. 13, 2026. An Alabama House committee Wednesday ap..."
    },
    {
      "title": "Bill making bail for immigrants without status more difficult passes Alabama House committee",
      "link": "https://alabamareflector.com/2026/02/19/bill-making-bail-for-immigrants-without-status-more-difficult-passes-alabama-house-committee/",
      "thumbnail": "",
      "description": "Rep. Chad Robertson, R-Heflin, stands on the floor of the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House Judiciary Committee Wednesday approved legislation sp..."
    },
    {
      "title": "Some states are helping to make Obamacare plans more affordable",
      "link": "https://alabamareflector.com/2026/02/18/repub/some-states-are-helping-to-make-obamacare-plans-more-affordable/",
      "thumbnail": "",
      "description": "Colorado Republican state Sen. Rod Pelton, left, and Senate President James Coleman, a Democrat, speak during the sixth day of the special legislative session in August 2025. Colorado is among the states using state fund..."
    }
  ],
  "lastUpdated": "2026-02-20T14:35:10.375Z"
}