{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Many Dems refuse to vote to fund ICE as US House passes 4 spending bills",
      "link": "https://alabamareflector.com/2026/01/22/repub/many-dems-refuse-to-vote-to-fund-ice-as-us-house-passes-4-spending-bills/",
      "thumbnail": "",
      "description": "Federal agents block in and stop a woman to ask her for another person’s whereabouts Monday, Jan. 19, 2026 in south Minneapolis. (Photo by Nicole Neri/Minnesota Reformer)WASHINGTON — The House Thursday passed four approp..."
    },
    {
      "title": "Alabama Legislature passes bills banning NDAs against sexual abuse survivors",
      "link": "https://alabamareflector.com/2026/01/22/alabama-legislature-passes-bills-banning-ndas-against-sexual-abuse-survivors/",
      "thumbnail": "",
      "description": "Sen. Matt Woods, R-Jasper, speaks to a colleague on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate Wednesday passed a bill sponsored by Woods that prohibits ..."
    },
    {
      "title": "Alabama Legislature alters schedule amid winter weather threats",
      "link": "https://alabamareflector.com/2026/01/22/alabama-legislature-alters-schedule-amid-winter-weather-threats/",
      "thumbnail": "",
      "description": "Senate President Pro Tem Garlan Gudger, R-Cullman, stands on the floor of the Alabama Senate on Jan. 20, 2026 in the Alabama Statehouse in Montgomery, Alabama. Gudger and House Speaker Nathaniel Ledbetter altered the Leg..."
    },
    {
      "title": "Bill would criminalize withholding or giving false information in some law enforcement stops",
      "link": "https://alabamareflector.com/2026/01/22/bill-would-criminalize-withholding-or-giving-false-information-in-some-law-enforcement-stops/",
      "thumbnail": "",
      "description": "Rep. Ron Bolton, R-Northport, stands on the floor of the Alabama House of Representatives on April 8, 2025 at the Alabama Statehouse in Montgomery, Alabama. A House committee Wednesday approved a bill from Bolton making ..."
    },
    {
      "title": "ACLU says pregnant immigrant in medical distress deported through Atlanta airport",
      "link": "https://alabamareflector.com/2026/01/22/repub/aclu-says-pregnant-immigrant-in-medical-distress-deported-through-atlanta-airport/",
      "thumbnail": "",
      "description": "People travel through Hartsfield-Jackson Atlanta International Airport on Nov. 7, 2025 in Atlanta, Georgia. (Photo by Megan Varner/Getty Images)WASHINGTON — U.S. Immigration and Customs Enforcement officials placed an as..."
    },
    {
      "title": "Alabama House Committee passes bill to limit screen time for young children",
      "link": "https://alabamareflector.com/2026/01/22/alabama-house-committee-passes-bill-that-limits-screen-time-for-children/",
      "thumbnail": "",
      "description": "Rep. Jeana Ross, R-Guntersville, reading a bill on the floor of the Alabama House of Representatives on Jan. 15, 2026, in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)An Alabama House committee Wednesday passed a..."
    },
    {
      "title": "Alabama immigration bill draws criticism at House committee meeting",
      "link": "https://alabamareflector.com/2026/01/22/alabama-immigration-bill-draws-criticism-at-house-committee-meeting/",
      "thumbnail": "",
      "description": "Members of immigrant rights groups gather outside the Alabama Statehouse on Wednesday, Jan. 21, 2026 following a public hearing on a bill allowing law enforcement to assist with federal immigration enforcement. Critics s..."
    },
    {
      "title": "Alabama colleges, universities would have to report state and federal spending under bill",
      "link": "https://alabamareflector.com/2026/01/22/alabama-colleges-universities-would-have-to-report-state-and-federal-spending-under-bill/",
      "thumbnail": "",
      "description": "Rep. Danny Garrett, R-Trussville, on the floor of the Alabama House of Representatives on May 14, 2025, in the Alabama State House in Montgomery, Alabama. (Anna Barrett/Alabama Reflector) A House committee Wednesday pass..."
    },
    {
      "title": "Even conservative Supreme Court justices cool to Trump dismissal of the Fed’s Lisa Cook",
      "link": "https://alabamareflector.com/2026/01/21/repub/even-conservative-supreme-court-justices-cool-to-trump-dismissal-of-the-feds-lisa-cook/",
      "thumbnail": "",
      "description": "Federal Reserve Governor Lisa Cook leaves the U.S. Supreme Court on Jan. 21, 2026 in Washington, D.C, after the court heard oral arguments in Trump v. Cook. (Photo by Kevin Dietsch/Getty Images)WASHINGTON — U.S. Supreme ..."
    },
    {
      "title": "US House panel says Clintons should be held in contempt of Congress over Epstein subpoena",
      "link": "https://alabamareflector.com/2026/01/21/repub/us-house-panel-says-clintons-should-be-held-in-contempt-of-congress-over-epstein-subpoena/",
      "thumbnail": "",
      "description": "Former President Bill Clinton and former Secretary of State Hillary Clinton arrive to attend the inauguration of President Donald Trump on Jan. 20, 2025 in Washington, D.C. (Photo by Shawn Thew-Pool/Getty Images)The U.S...."
    }
  ],
  "lastUpdated": "2026-01-23T04:26:39.843Z"
}