{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "As health costs spike, a sour and divided Congress escapes one shutdown to face another",
      "link": "https://alabamareflector.com/2025/11/13/repub/as-health-costs-spike-a-sour-and-divided-congress-escapes-one-shutdown-to-face-another/",
      "thumbnail": "",
      "description": "Senate Minority Leader Chuck Schumer, D-N.Y., left, accompanied by Sen. Cory Booker, D-N.J., points to a poster depicting rising medical costs if Congress allows the Affordable Care Act tax credits to expire in December ..."
    },
    {
      "title": "Higher gun ownership rates lead to more gun homicides of pregnant women, new study says",
      "link": "https://alabamareflector.com/2025/11/13/repub/higher-gun-ownership-rates-lead-to-more-gun-homicides-of-pregnant-women-new-study-says/",
      "thumbnail": "",
      "description": "A California Highway Patrol officer puts a confiscated firearm into an evidence box after arresting a suspect last month in Oakland, Calif. Homicide rates among pregnant women increase with the rate of firearm ownership,..."
    },
    {
      "title": "Alabama infant mortality rate improves, but remains higher than national average",
      "link": "https://alabamareflector.com/2025/11/13/alabama-infant-mortality-rate-improves-but-remains-higher-than-national-average/",
      "thumbnail": "",
      "description": "Alabama State Health Officer Dr. Scott Harris speaking at ADPH's meeting on Nov. 13, 2025, in the RSA Regions Tower in Montgomery, Alabama. The state's infant mortality rate improved in 2024 from 2023, but still remains ..."
    },
    {
      "title": "Alabama State Board of Education delays vote for social studies, arts education textbooks",
      "link": "https://alabamareflector.com/briefs/alabama-state-board-of-education-delays-vote-for-social-studies-arts-education-textbooks/",
      "thumbnail": "",
      "description": "State Superintendent Eric Mackey speaking to reporters on March 13, 2025, at the board's March meeting in Montgomery, Alabama. The board unanimously approved state intervention in the Dallas County School System. (Anna B..."
    },
    {
      "title": "Trump administration to mostly pay full SNAP benefits ‘within 24 hours’ of shutdown end",
      "link": "https://alabamareflector.com/2025/11/13/repub/trump-administration-to-mostly-pay-full-snap-benefits-within-24-hours-of-shutdown-end/",
      "thumbnail": "",
      "description": "A sign explaining delays in the Supplemental Nutrition Assistance Program during the government shutdown is displayed at a Sprouts grocery store in Bountiful, Utah, on Wednesday, Nov. 12, 2025. (McKenzie Romero/Utah News..."
    },
    {
      "title": "Alabama community colleges to seek salary increases for instructors",
      "link": "https://alabamareflector.com/2025/11/13/alabama-community-colleges-to-seek-salary-increases-for-instructors/",
      "thumbnail": "",
      "description": "Jimmy H. Baker, the chancellor of the Alabama Community College System, presents the ACCS' budget proposal to legislators on March 7, 2023. Baker said Wednesday ACCS will seek pay raises for instructors for the 2027 fisc..."
    },
    {
      "title": "Alabama rural hospital funding board approves grants for 50 state hospitals",
      "link": "https://alabamareflector.com/2025/11/13/alabama-rural-hospital-funding-board-approves-funding-for-50-state-hospitals/",
      "thumbnail": "",
      "description": "Vaughan Regional Medical Center in Selma, AL, on Tuesday, Sep. 3, 2024 in Selma, Ala. Vaughn RMC is one of 50 rural hospitals that are eligible to receive funds through the Rural Hospital Investment Program. (Will McLell..."
    },
    {
      "title": "Black homicide victims’ families most likely to be denied compensation",
      "link": "https://alabamareflector.com/2025/11/12/repub/black-homicide-victims-families-most-likely-to-be-denied-compensation/",
      "thumbnail": "",
      "description": "Police tape off a street in Grand Blanc, Mich., after a shooting and fire at a church. Victims of crime often face a maze of legal and administrative barriers, making it hard to secure compensation or other support. (Pho..."
    },
    {
      "title": "Government reopens after 43 days: Trump signs bill ending record shutdown",
      "link": "https://alabamareflector.com/2025/11/12/repub/us-house-expected-to-clear-bill-reopening-the-government-after-record-shattering-shutdown/",
      "thumbnail": "",
      "description": "Furloughed federal workers stand in line for hours ahead of a special food distribution by the Capital Area Food Bank and No Limits Outreach Ministries on Barlowe Road in Hyattsville, Maryland, on Tuesday, Oct. 28, 2025...."
    },
    {
      "title": "Alabama lawmakers drafting bill tying some higher ed funding to outcomes",
      "link": "https://alabamareflector.com/2025/11/12/alabama-lawmakers-drafting-bill-tying-some-higher-ed-funding-to-outcomes/",
      "thumbnail": "",
      "description": "House Ways and Means Education Committee Chair Danny Garrett, R-Trussville, asks a question as Senate Finance and Taxation Education Committee Chair Arthur Orr, R-Decatur, listens during a budget presentation to lawmaker..."
    }
  ],
  "lastUpdated": "2025-11-14T03:36:40.483Z"
}