{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Walz orders MN National Guard to prepare for possible deployment following ICE killing",
      "link": "https://alabamareflector.com/2026/01/08/repub/walz-orders-mn-national-guard-to-prepare-for-possible-deployment-following-ice-killing/",
      "thumbnail": "",
      "description": "Gov. Tim Walz speaks at the State Emergency Operations Center in Blaine, MN after a woman is killed by a U.S. Immigration and Customs Enforcement officer in Minneapolis on Wednesday Jan. 7, 2025. (Photo by Alyssa Chen/Mi..."
    },
    {
      "title": "ADPH investigating possible flu connection in two pediatric deaths",
      "link": "https://alabamareflector.com/2026/01/08/alabama-department-of-public-health-investigating-two-pediatric-deaths-for-flu-cause/",
      "thumbnail": "",
      "description": "A person holding vials of flu and Covid-19 vaccine. Alabama district health officer Dr. Wes Stubblefield said in an interview that the department is investigating two pediatric deaths in relation to influenza. (File)The ..."
    },
    {
      "title": "Alabama Democratic congressional candidates say they’re optimistic for 2026",
      "link": "https://alabamareflector.com/2026/01/08/democratic-congressional-candidates-say-theyre-optimistic-for-2026/",
      "thumbnail": "",
      "description": "U.S. Democratic congressional candidates Mark Wheeler, Dakarai Larriett, Keith Pilkington, Amanda Pusczek, Andrew Sneed, Lee McInnis and Clyde Jones stand behind Tabitha Isner, vice-chair of the Alabama Democratic Party ..."
    },
    {
      "title": "Alabama veterans board to push for financial benefit bills for veterans",
      "link": "https://alabamareflector.com/2026/01/08/alabama-vets-board-to-push-for-financial-benefit-bills-for-veterans/",
      "thumbnail": "",
      "description": "The rotunda of the Alabama State Capitol, as seen on Nov. 14, 2025 in Montgomery, Alabama. A subcommittee of the State Board of Veterans Affairs Wednesday endorsed legislation that would extend financial benefits to vete..."
    },
    {
      "title": "Rubio to meet with Danish officials amid Greenland push by Trump administration",
      "link": "https://alabamareflector.com/2026/01/07/repub/rubio-to-meet-with-danish-officials-amid-greenland-push-by-trump-administration/",
      "thumbnail": "",
      "description": "Senate Minority Leader Chuck Schumer, D-N.Y., speaks with Secretary of State Marco Rubio as Defense Secretary Pete Hegseth stands to the side in the U.S. Senate basement following a classified briefing on President Donal..."
    },
    {
      "title": "Dems demand investigation of fatal Minneapolis ICE shooting as Trump claims self-defense",
      "link": "https://alabamareflector.com/2026/01/07/repub/dems-demand-investigation-of-fatal-minneapolis-ice-shooting-as-trump-claims-self-defense/",
      "thumbnail": "",
      "description": "People gather around the south Minneapolis site where a U.S. Immigration and Customs Enforcement officer fatally shot a woman on Wednesday, Jan. 7, 2026. (Photo by Nicole Neri/Minnesota Reformer)WASHINGTON — President Do..."
    },
    {
      "title": "ICE officer fatally shoots driver through car window in Minneapolis",
      "link": "https://alabamareflector.com/2026/01/07/repub/ice-officer-fatally-shoots-driver-through-car-window-in-minneapolis/",
      "thumbnail": "",
      "description": "The crashed SUV after an ICE agent shot the driver at point-blank range through the window. The driver died, according to the Department of Homeland Security. (Photo by Nicole Neri/Minnesota Reformer)Leer en español. An ..."
    },
    {
      "title": "Democratic state AGs will lead opposition to Trump in new year",
      "link": "https://alabamareflector.com/2026/01/07/repub/democratic-state-ags-will-lead-opposition-to-trump-in-new-year/",
      "thumbnail": "",
      "description": "Democratic attorneys general held their first of a series of town halls on March 5, 2025, in Phoenix to discuss how they are standing up to President Donald Trump. From left to right: Minnesota Attorney General Keith Ell..."
    },
    {
      "title": "Report: Alabama’s low tax collections hurting education, government services",
      "link": "https://alabamareflector.com/2026/01/07/report-alabamas-low-tax-collections-hurting-education-government-services/",
      "thumbnail": "",
      "description": "The Alabama State Capitol in Montgomery, Alabama, as seen on Nov. 14, 2025. (Brian Lyman/Alabama Reflector) Alabama’s tax collections remain among the lowest in the nation, making it harder for local governments to fund ..."
    },
    {
      "title": "Alabama physicians group says federal funds could address doctor shortage",
      "link": "https://alabamareflector.com/2026/01/07/alabama-physicians-group-says-federal-grant-could-address-doctor-shortage/",
      "thumbnail": "",
      "description": "A vacant hallway at Vaughan Regional Medical Center in Selma, Alabama, on Tuesday, Sep. 3, 2024 in Selma, Alabama. A statewide physician shortage could be remedied with money from Alabama's allocation from the Rural Heal..."
    }
  ],
  "lastUpdated": "2026-01-08T15:17:37.908Z"
}