{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama State Board of Education OKs hiring changes for nutrition program directors",
      "link": "https://alabamareflector.com/briefs/alabama-state-board-of-education-approves-changes-for-hiring-child-nutrition-program-directors/",
      "thumbnail": "",
      "description": "Left to right: Jackie Zeigler, Tracie West, Kelly Mooney, Eric Mackey, Gov. Kay Ivey, Marie Manning, Yvette Richardson, Tonya Chestnut, Wayne Reynolds The Alabama State Board of Education votes on a resolution at the boa..."
    },
    {
      "title": "Alabama K-12 system sees improvements on state report card",
      "link": "https://alabamareflector.com/2025/11/14/alabama-k-12-system-sees-improvements-on-state-report-card/",
      "thumbnail": "",
      "description": "Alabama State Superintendent Eric Mackey talks to Alabama State Board of Education members about enrollment numbers at their monthly meeting on Oct. 9, 2025. Alabama public school performance increased slightly last year..."
    },
    {
      "title": "Chambers, Lee county voters to choose GOP nominee for special House election",
      "link": "https://alabamareflector.com/2025/11/14/chambers-lee-county-voters-to-choose-gop-nominee-in-special-house-election-in-runoff/",
      "thumbnail": "",
      "description": "Garrett Dixon (left) and Kristin Nelson will face off in a special GOP primary runoff election for House District 38 in Chambers and Lee counties on Nov. 18. The winner of the runoff will face Democratic candidate Hazel ..."
    },
    {
      "title": "Air travel, SNAP benefits, back pay at issue as federal government slowly reopens",
      "link": "https://alabamareflector.com/2025/11/14/repub/air-travel-snap-benefits-back-pay-at-issue-as-federal-government-slowly-reopens/",
      "thumbnail": "",
      "description": "Planes line up on the tarmac at LaGuardia Airport on Nov. 10, 2025 in New York City. (Photo by Spencer Platt/Getty Images)WASHINGTON — The record 43-day government shutdown that ended Wednesday night scrambled air travel..."
    },
    {
      "title": "As health costs spike, a sour and divided Congress escapes one shutdown to face another",
      "link": "https://alabamareflector.com/2025/11/13/repub/as-health-costs-spike-a-sour-and-divided-congress-escapes-one-shutdown-to-face-another/",
      "thumbnail": "",
      "description": "Senate Minority Leader Chuck Schumer, D-N.Y., left, accompanied by Sen. Cory Booker, D-N.J., points to a poster depicting rising medical costs if Congress allows the Affordable Care Act tax credits to expire in December ..."
    },
    {
      "title": "Higher gun ownership rates lead to more gun homicides of pregnant women, new study says",
      "link": "https://alabamareflector.com/2025/11/13/repub/higher-gun-ownership-rates-lead-to-more-gun-homicides-of-pregnant-women-new-study-says/",
      "thumbnail": "",
      "description": "A California Highway Patrol officer puts a confiscated firearm into an evidence box after arresting a suspect last month in Oakland, Calif. Homicide rates among pregnant women increase with the rate of firearm ownership,..."
    },
    {
      "title": "Alabama infant mortality rate improves, but remains higher than national average",
      "link": "https://alabamareflector.com/2025/11/13/alabama-infant-mortality-rate-improves-but-remains-higher-than-national-average/",
      "thumbnail": "",
      "description": "Alabama State Health Officer Dr. Scott Harris speaking at ADPH's meeting on Nov. 13, 2025, in the RSA Regions Tower in Montgomery, Alabama. The state's infant mortality rate improved in 2024 from 2023, but still remains ..."
    },
    {
      "title": "Alabama State Board of Education delays vote for social studies, arts education textbooks",
      "link": "https://alabamareflector.com/briefs/alabama-state-board-of-education-delays-vote-for-social-studies-arts-education-textbooks/",
      "thumbnail": "",
      "description": "State Superintendent Eric Mackey speaking to reporters on March 13, 2025, at the board's March meeting in Montgomery, Alabama. The board unanimously approved state intervention in the Dallas County School System. (Anna B..."
    },
    {
      "title": "Trump administration to mostly pay full SNAP benefits ‘within 24 hours’ of shutdown end",
      "link": "https://alabamareflector.com/2025/11/13/repub/trump-administration-to-mostly-pay-full-snap-benefits-within-24-hours-of-shutdown-end/",
      "thumbnail": "",
      "description": "A sign explaining delays in the Supplemental Nutrition Assistance Program during the government shutdown is displayed at a Sprouts grocery store in Bountiful, Utah, on Wednesday, Nov. 12, 2025. (McKenzie Romero/Utah News..."
    },
    {
      "title": "Alabama community colleges to seek salary increases for instructors",
      "link": "https://alabamareflector.com/2025/11/13/alabama-community-colleges-to-seek-salary-increases-for-instructors/",
      "thumbnail": "",
      "description": "Jimmy H. Baker, the chancellor of the Alabama Community College System, presents the ACCS' budget proposal to legislators on March 7, 2023. Baker said Wednesday ACCS will seek pay raises for instructors for the 2027 fisc..."
    }
  ],
  "lastUpdated": "2025-11-14T17:34:30.550Z"
}