{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Climate, health groups challenge EPA repeal of major greenhouse gas regulation",
      "link": "https://alabamareflector.com/2026/02/18/repub/climate-health-groups-challenge-epa-repeal-of-major-greenhouse-gas-regulation/",
      "thumbnail": "",
      "description": "Marathon Petroleum Company’s Salt Lake City Refinery in Salt Lake City on Jan. 3, 2024. (Photo by Spenser Heaps for Utah News Dispatch)A coalition of public health and environmental groups filed a suit Wednesday challeng..."
    },
    {
      "title": "Alabama Opioid Settlement Fund to receive $43.1 million in 2026 supplemental budget",
      "link": "https://alabamareflector.com/2026/02/18/alabama-opioid-settlement-fund-to-receive-43-1-million-in-2026-supplemental-budget/",
      "thumbnail": "",
      "description": "Rep. Rex Reynolds, R-Huntsville, speaking at the Oversight Commission on Opioid Settlement Funds meeting on Feb. 18, 2026, in the Alabama Statehouse in Montgomery, Alabama. The commission on Wednesday approved a plan to ..."
    },
    {
      "title": "Alabama House Majority Leader steps down to run for Alabama GOP chair",
      "link": "https://alabamareflector.com/2026/02/18/alabama-house-majority-leader-steps-down-to-run-for-alabama-gop-chair/",
      "thumbnail": "",
      "description": "Rep. Scott Stadthagen, R-Hartselle, standing on the floor of the Alabama House of Representatives on Feb. 17, 2026, in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)Rep. Scott Stadthagen, R-Hartselle, said in a st..."
    },
    {
      "title": "Alabama House bill increases time for law enforcement to collect DNA evidence",
      "link": "https://alabamareflector.com/briefs/alabama-house-bill-increases-time-for-law-enforcement-to-collect-dna-evidence/",
      "thumbnail": "",
      "description": "Rep. Joe Lovvorn, R-Auburn, standing on the floor of the Alabama House of Representatives on Jan. 15, 2026, in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)The House Public Safety and Homeland Security Committee ..."
    },
    {
      "title": "Alabama House passes bill that could weaken state environmental protections",
      "link": "https://alabamareflector.com/2026/02/18/alabama-house-passes-bill-that-could-weaken-state-environmental-protections/",
      "thumbnail": "",
      "description": "Rep. Troy Stubbs, R-Wetumpka, speaks in the Alabama House of Representatives on March 19, 2024 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House of Representatives passed a bill Tuesday carried by Stubb..."
    },
    {
      "title": "Alabama House passes bill increasing safety requirements for camps",
      "link": "https://alabamareflector.com/2026/02/18/alabama-house-passes-bill-increasing-safety-requirements-for-camps/",
      "thumbnail": "",
      "description": "Rep. David Faulkner, R-Mountain Brook, annotating a document at his desk in the Alabama House of Representatives chambers in Montgomery, Alabama, on Feb. 17, 2026. The Alabama House of Representatives Tuesday approved a ..."
    },
    {
      "title": "Southern Poverty Law Center warns Fayette about sanctions over garbage bills",
      "link": "https://alabamareflector.com/2026/02/18/southern-poverty-law-center-warns-fayette-about-sanctions-over-garbage-bills/",
      "thumbnail": "",
      "description": "A sign marking the Southern Poverty Law Center outside the organization's headquarters in Montgomery, Alabama on February 8, 2023. SPLC sent a letter to the city of Fayette last week demanding that it stop threatening to..."
    },
    {
      "title": "Alabama Senate passes bill requiring English proficiency for commercial drivers",
      "link": "https://alabamareflector.com/briefs/alabama-senate-passes-bill-requiring-english-proficiency-for-commercial-drivers/",
      "thumbnail": "",
      "description": "Sen. Lance Bell, R-Pell City, listening to debate on the floor of the Alabama Senate on Feb. 17, 2026, in Montgomery, Alabama. The Senate passed Bell's bill Tuesday that requires all commercial drivers to be proficient i..."
    },
    {
      "title": "Alabama Senate OKs bill allowing health insurers to reorganize under nonprofit holding companies",
      "link": "https://alabamareflector.com/2026/02/17/alabama-senate-oks-bill-allowing-health-insurers-to-reorganize-under-nonprofit-holding-companies/",
      "thumbnail": "",
      "description": "Sen. Andrew Jones, R-Centre, discussing a bill on the floor of the Alabama Senate on Feb. 17, 2026, in Montgomery, Alabama. The Senate passed his bill on Tuesday that would allow allow health insurers in Alabama to reorg..."
    },
    {
      "title": "Communities fight ICE detention centers, but have few tools to stop them",
      "link": "https://alabamareflector.com/2026/02/17/repub/communities-fight-ice-detention-centers-but-have-few-tools-to-stop-them/",
      "thumbnail": "",
      "description": "A vacant warehouse in Kansas City, Mo., was among a growing number of properties across the country planned for conversion into a federal immigration detention center. After weeks of public pressure, the private develope..."
    }
  ],
  "lastUpdated": "2026-02-18T20:29:37.141Z"
}