{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama lawmaker wants signing days for military recruits, trade school students",
      "link": "https://alabamareflector.com/2025/12/25/alabama-lawmaker-wants-signing-days-for-military-recruits-trade-school-students/",
      "thumbnail": "",
      "description": "Rep. Chad Robertson, R-Heflin, listens to a presentation on the floor of the Alabama House of Representatives on April 3, 2025 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)An Alabama l..."
    },
    {
      "title": "National Guard shooting case moved to federal court as prosecutors weigh death penalty",
      "link": "https://alabamareflector.com/2025/12/24/repub/national-guard-shooting-case-moved-to-federal-court-as-prosecutors-weigh-death-penalty/",
      "thumbnail": "",
      "description": "FBI Director Kash Patel, left, looks at photos of the two West Virginia National Guard soldiers shot in Washington, D.C., on Nov. 27, 2025. (Photo by Andrew Leyden/Getty Images)WASHINGTON — The man accused of shooting tw..."
    },
    {
      "title": "NY federal officials submit 1 million more pages of Epstein files",
      "link": "https://alabamareflector.com/2025/12/24/repub/ny-federal-officials-submit-1-million-more-pages-of-epstein-files/",
      "thumbnail": "",
      "description": "Then-U.S. Attorney for the Southern District of New York Geoffrey Berman announces charges against Jeffrey Epstein on July 8, 2019, in New York City. &nbsp;(Photo by Stephanie Keith/Getty Images)WASHINGTON — Federal pros..."
    },
    {
      "title": "GOP redistricting could backfire as urban, immigrant areas turn back to Democrats",
      "link": "https://alabamareflector.com/2025/12/24/repub/gop-redistricting-could-backfire-as-urban-immigrant-areas-turn-back-to-democrats/",
      "thumbnail": "",
      "description": "A person places flowers in front of a photograph of Mother Cabrini, patron saint of immigrants, during an interfaith service on behalf of immigrants in November in Miami. GOP reversals in this year’s elections, including..."
    },
    {
      "title": "Where Alabama Medicaid enrollees get contraceptives",
      "link": "https://alabamareflector.com/2025/12/24/where-alabama-medicaid-enrollees-get-contraceptives/",
      "thumbnail": "",
      "description": "A recent KFF report showed that Alabama Medicaid enrollees leads the nation in receiving contraceptives from public health departments. Alabama Public Health Officer Dr. Scott Harris said he is not surprised because of t..."
    },
    {
      "title": "Trump administration to garnish wages for defaulted student loans",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-administration-to-garnish-wages-for-defaulted-student-loans/",
      "thumbnail": "",
      "description": "The U.S. Education Department said it will start garnishing wages from student borrowers in default. (Catherine Lane/Getty Images)WASHINGTON — President Donald Trump’s administration will start garnishing the wages of st..."
    },
    {
      "title": "US Supreme Court in defeat for Trump blocks deployment of National Guard in Chicago",
      "link": "https://alabamareflector.com/2025/12/23/repub/us-supreme-court-in-defeat-for-trump-blocks-deployment-of-national-guard-in-chicago/",
      "thumbnail": "",
      "description": "Members of the Texas National Guard are seen at the Elwood Army Reserve Training Center on Oct. 7, 2025 in Elwood, Illinois. (Photo by Scott Olson/Getty Images)President Donald Trump for now has not met the requirements ..."
    },
    {
      "title": "Trump administration officially ends veteran abortion access",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-administration-officially-ends-veteran-abortion-access/",
      "thumbnail": "",
      "description": "The U.S. Department of Justice has instructed the U.S. Department of Veterans Affairs to stop providing any abortion care or abortion counseling, even in cases of rape or incest. The policy change comes from the Project ..."
    },
    {
      "title": "Trump appears in several files of latest Epstein release",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-appears-in-several-files-of-latest-epstein-release/",
      "thumbnail": "",
      "description": "A photograph of President Donald Trump and late sex offender Jeffrey Epstein is displayed after being unofficially installed in a bus shelter. (Leon Neal/Getty Images).WASHINGTON — The U.S. Department of Justice early Tu..."
    },
    {
      "title": "Homeless youth say they need more from schools, social services",
      "link": "https://alabamareflector.com/2025/12/23/repub/homeless-youth-say-they-need-more-from-schools-social-services/",
      "thumbnail": "",
      "description": "A homeless teen, holding a sign “Only 19, alone on the street,” asks for help in Manhattan in New York City. A report from the Covenant House and researchers at the University of California, Berkeley finds that schools a..."
    }
  ],
  "lastUpdated": "2025-12-26T08:48:01.949Z"
}