{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Civil rights and immigrant advocacy groups seek records on immigrant detention in Alabama",
      "link": "https://alabamareflector.com/2025/12/31/civil-rights-and-immigrant-advocacy-groups-seek-records-on-immigrant-detention-in-alabama/",
      "thumbnail": "",
      "description": "Gina Martinez holds a photograph of her daughter Giovanna Hernandez Martinez after Mass on Sunday, August 10, 2025. Civil rights and immigrant advocacy groups have filed open records requests with law enforcement agencie..."
    },
    {
      "title": "Alaska, Montana, Oklahoma crack top five in first rural hospital funding allocation",
      "link": "https://alabamareflector.com/2025/12/30/repub/alaska-montana-oklahoma-crack-top-five-in-first-rural-hospital-funding-allocation/",
      "thumbnail": "",
      "description": "A vacant hallway at Vaughan Regional Medical Center in Selma, Alabama, on Tuesday, Sep. 3, 2024 in Selma, Alabama. (Will McLelland for Alabama Reflector)WASHINGTON — President Donald Trump’s administration unveiled Monda..."
    },
    {
      "title": "Even after parole, some Alabamians can remain on supervision for the rest of their lives",
      "link": "https://alabamareflector.com/2025/12/30/even-after-parole-some-alabamians-can-remain-on-supervision-for-the-rest-of-their-lives/",
      "thumbnail": "",
      "description": "An inmate in the custody of the Department of Corrections. A new report highlights the challenges facing 1,200 Alabamians paroled after being sentenced to life in prison. Some of those who have been released and led prod..."
    },
    {
      "title": "Deportations, tariffs, court clashes, record shutdown mark a historic year in Washington, D.C.",
      "link": "https://alabamareflector.com/2025/12/30/repub/deportations-tariffs-court-clashes-record-shutdown-mark-a-historic-year-in-washington-d-c/",
      "thumbnail": "",
      "description": "President Donald Trump holds up the \"One, Big Beautiful Bill\" Act that he signed into law on the South Lawn of the White House on July 4, 2025, in Washington, D.C. (Photo by Alex Brandon - Pool/Getty Images)WASHINGTON — ..."
    },
    {
      "title": "Pre-filed bill would allow Alabamians with disabilities to receive absentee ballot help",
      "link": "https://alabamareflector.com/2025/12/29/pre-filed-bill-would-allow-alabamians-with-disabilities-to-receive-absentee-ballot-help/",
      "thumbnail": "",
      "description": "Rep. Adline Clarke, D-Mobile, speaks during a debate in the Alabama House of Representatives on Feb. 12, 2025 at the Alabama Statehouse in Montgomery, Alabama. Clarke has pre-filed a bill for the 2026 legislative session..."
    },
    {
      "title": "The big Alabama political issues awaiting in the new year",
      "link": "https://alabamareflector.com/2025/12/29/the-big-alabama-political-issues-awaiting-us-in-the-new-year/",
      "thumbnail": "",
      "description": "The Alabama State Capitol in Montgomery, Alabama, as seen on Nov. 14, 2025. The Alabama Legislature will return for its 2026 regular session on Jan. 13, and should face questions about funding the state's two public heal..."
    },
    {
      "title": "Report: Alabama cut environmental funding in half over 14 years",
      "link": "https://alabamareflector.com/2025/12/28/report-alabama-cut-environmental-funding-in-half-over-14-years/",
      "thumbnail": "",
      "description": "An unlined coal ash pond in western Jefferson County, Alabama. A report released earlier this month found that Alabama cut environmental spending 49% between 2010 and 2024. (Lee Hedgepeth/Inside Climate News)This article..."
    },
    {
      "title": "How much of Project 2025 has actually been accomplished this year?",
      "link": "https://alabamareflector.com/2025/12/27/how-much-of-project-2025-has-actually-been-accomplished-this-year/",
      "thumbnail": "",
      "description": "Kevin Roberts, president of The Heritage Foundation, speaks during a news conference on Capitol Hill. An analysis by The 19th has found that the Trump administration has implemented several of the goals in Project 2025, ..."
    },
    {
      "title": "One Big Beautiful Bill Act complicates state health care affordability efforts",
      "link": "https://alabamareflector.com/2025/12/26/repub/one-big-beautiful-bill-act-complicates-state-health-care-affordability-efforts/",
      "thumbnail": "",
      "description": "Medical bills are spread out on the kitchen table of a cancer patient in Salem, Va. (Photo by Don Petersen/The Associated Press)This article first appeared on KFF Health News. As Congress debates whether to extend the te..."
    },
    {
      "title": "Alabama lawmaker proposes banning use of West Bank in government documents",
      "link": "https://alabamareflector.com/2025/12/26/alabama-lawmaker-proposes-banning-use-of-west-bank-in-government-documents/",
      "thumbnail": "",
      "description": "Rep. Mark Gidley, R-Hokes Bluff, listens to a presentation in the Alabama House of Representatives on April 3, 2025 at the Alabama Statehouse in Montgomery, Alabama. Gidley pre-filed a bill that would prohibit the use of..."
    }
  ],
  "lastUpdated": "2025-12-31T19:10:57.164Z"
}