{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Demand grows for doulas who can help moms with addiction",
      "link": "https://alabamareflector.com/2026/02/01/repub/demand-grows-for-doulas-who-can-help-moms-with-addiction/",
      "thumbnail": "",
      "description": "Founder of Eggbaby Doula Services Aleece Weaver, right, demonstrates the work she does with pregnant clients. Weaver does pro bono doula care with clients in recovery at Utah perinatal recovery clinic SUPeRAD. Peer recov..."
    },
    {
      "title": "Bills cracking down on abortion pills advance in states that already ban most abortions",
      "link": "https://alabamareflector.com/2026/01/31/repub/bills-cracking-down-on-abortion-pills-advance-in-states-that-already-ban-most-abortions/",
      "thumbnail": "",
      "description": "Republican Indiana Sen. Tyler Johnson introduces his abortion-inducing drugs bill in committee on Jan. 21, 2026. Johnson, an emergency room physician, is sponsoring legislation that would allow Hoosiers to sue people inv..."
    },
    {
      "title": "DOJ releases 3 million pages of Epstein files, taking in 180,000 images and 2,000 videos",
      "link": "https://alabamareflector.com/2026/01/30/repub/doj-releases-3-million-pages-of-epstein-files-taking-in-180000-images-and-2000-videos/",
      "thumbnail": "",
      "description": "U.S. Attorney for the Southern District of New York Geoffrey Berman announces charges against Jeffrey Epstein on July 8, 2019 in New York City. (Photo by Stephanie Keith/Getty Images)WASHINGTON — The U.S. Department of J..."
    },
    {
      "title": "Former Alabama GOP chair faces residency challenge in lieutenant governor bid",
      "link": "https://alabamareflector.com/2026/01/30/former-alabama-gop-chair-faces-residency-challenge-in-lieutenant-governor-bid/",
      "thumbnail": "",
      "description": "Former Alabama Republican Party Chair John Wahl speaks with reporters on Tuesday, Jan. 27, 2026 at a news conference at AL GOP headquarters announcing his run for lieutenant governor. Former state representative Gil Isbe..."
    },
    {
      "title": "Partial federal government shutdown begins, amid hopes it won’t last long",
      "link": "https://alabamareflector.com/2026/01/30/repub/with-us-senate-still-tied-up-over-spending-deal-partial-shutdown-begins-at-midnight/",
      "thumbnail": "",
      "description": "The U.S. Capitol in Washington, D.C., surrounded by snow and ice, on Wednesday, Jan. 28, 2026. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — The federal government began a partial shutdown early Saturday, even th..."
    },
    {
      "title": "What passed in the Alabama Legislature: Jan. 27-29, 2026",
      "link": "https://alabamareflector.com/2026/01/30/what-passed-in-the-alabama-legislature-jan-27-29-2026/",
      "thumbnail": "",
      "description": "Alabama House Speaker Nathaniel Ledbetter, R-Rainsville (right) speaks with Sen. Donnie Chesteen, R-Geneva, in the Alabama House of Representatives on Jan. 29, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Bria..."
    },
    {
      "title": "Rising health costs could shift midterm voters toward Democrats, survey shows",
      "link": "https://alabamareflector.com/2026/01/30/repub/rising-health-costs-could-shift-midterm-voters-toward-democrats-survey-shows/",
      "thumbnail": "",
      "description": "A KFF poll released on Jan. 29, 2026 found health costs on the minds of voters in advance of the midterms. (Photo by Yin Yang/Getty Images)Americans feel their health care costs are going up faster than other household e..."
    },
    {
      "title": "Marijuana bill sparks unusual floor debate among Alabama House Democrats",
      "link": "https://alabamareflector.com/2026/01/30/marijuana-bill-leads-to-divisive-debate-among-house-democrats/",
      "thumbnail": "",
      "description": "Rep. Patrick Sellers, D-Pleasant Grove (left) speaks to Rep. Kelvin Datcher, D-Birmingham (right) on the floor of the Alabama House of Representatives on Jan. 27, 2026 at the Alabama Statehouse in Montgomery, Alabama. (B..."
    },
    {
      "title": "Alabama House votes to repeal requirement for UA School of Social Work",
      "link": "https://alabamareflector.com/2026/01/30/alabama-house-votes-to-repeal-requirement-for-ua-school-of-social-work/",
      "thumbnail": "",
      "description": "An aerial view of the University of Alabama campus in Tuscaloosa, Alabama. The Alabama House of Representatives on Thursday voted to repeal a 1965 law that required the University of Alabama to host a standalone school o..."
    },
    {
      "title": "Alabama Senate budget chair still unsure if Legislature can honor agency requests",
      "link": "https://alabamareflector.com/2026/01/30/alabama-senate-budget-chair-still-unsure-if-legislature-can-honor-agency-requests/",
      "thumbnail": "",
      "description": "House Ways and Means General Fund Chair Rex Reynolds, R-Huntsville (left) listens as Senate Finance and Taxation General Fund Chair Greg Albritton, R-Atmore (right) speaks during a budget hearing at the Alabama Statehous..."
    }
  ],
  "lastUpdated": "2026-02-02T07:43:53.837Z"
}