{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama Senate passes bill requiring English proficiency for commercial drivers",
      "link": "https://alabamareflector.com/briefs/alabama-senate-passes-bill-requiring-english-proficiency-for-commercial-drivers/",
      "thumbnail": "",
      "description": "Sen. Lance Bell, R-Pell City, listening to debate on the floor of the Alabama Senate on Feb. 17, 2026, in Montgomery, Alabama. The Senate passed Bell's bill Tuesday that requires all commercial drivers to be proficient i..."
    },
    {
      "title": "Alabama Senate OKs bill allowing health insurers to reorganize under nonprofit holding companies",
      "link": "https://alabamareflector.com/2026/02/17/alabama-senate-oks-bill-allowing-health-insurers-to-reorganize-under-nonprofit-holding-companies/",
      "thumbnail": "",
      "description": "Sen. Andrew Jones, R-Centre, discussing a bill on the floor of the Alabama Senate on Feb. 17, 2026, in Montgomery, Alabama. The Senate passed his bill on Tuesday that would allow allow health insurers in Alabama to reorg..."
    },
    {
      "title": "Communities fight ICE detention centers, but have few tools to stop them",
      "link": "https://alabamareflector.com/2026/02/17/repub/communities-fight-ice-detention-centers-but-have-few-tools-to-stop-them/",
      "thumbnail": "",
      "description": "A vacant warehouse in Kansas City, Mo., was among a growing number of properties across the country planned for conversion into a federal immigration detention center. After weeks of public pressure, the private develope..."
    },
    {
      "title": "A ‘servant leader’ honored: The nation pays tribute to Jesse Jackson, civil rights icon",
      "link": "https://alabamareflector.com/2026/02/17/repub/a-servant-leader-honored-the-nation-pays-tribute-to-jesse-jackson-civil-rights-icon/",
      "thumbnail": "",
      "description": "The Rev. Jesse L. Jackson Sr. at an encampment dubbed \"Resurrection City,\" at the close of the Poor People's March at the National Mall in Washington D.C., in May 1968. (Photo by Pix/Michael Ochs Archives/Getty Images)WA..."
    },
    {
      "title": "Federal judge rules ICE can’t take Kilmar Abrego Garcia back into custody",
      "link": "https://alabamareflector.com/2026/02/17/repub/federal-judge-rules-ice-cant-take-kilmar-abrego-garcia-back-into-custody/",
      "thumbnail": "",
      "description": "Kilmar Abrego Garcia speaks to people who held a prayer vigil and rally on his behalf outside the Immigration and Customs Enforcement building in Baltimore, Maryland, on Aug. 25, 2025. Lydia Walther Rodriguez with CASA i..."
    },
    {
      "title": "In call, Alabama Power lobbyist sought nonprofit’s support for bill ending PSC elections",
      "link": "https://alabamareflector.com/2026/02/17/in-call-alabama-power-lobbyist-sought-nonprofits-support-for-ending-psc-elections/",
      "thumbnail": "",
      "description": "The logo for Alabama Power, as seen on January 24, 2023. In January, a lobbyist for Alabama Power contacted a nonprofit to see if they would support legislation to end popular elections for the Public Service Commission...."
    },
    {
      "title": "High housing costs, shortages propel movement on reform in Congress",
      "link": "https://alabamareflector.com/2026/02/17/repub/high-housing-costs-shortages-propel-movement-on-reform-in-congress/",
      "thumbnail": "",
      "description": "New home under construction. (Dan Reynolds Photography/Getty Images)WASHINGTON — Republicans, Democrats and the White House are methodically, calmly inching toward a common goal: agreeing on a thick package of laws that ..."
    },
    {
      "title": "Alabama House bill would create sales tax holiday for guns",
      "link": "https://alabamareflector.com/2026/02/17/alabama-house-bill-would-create-sales-tax-holiday-for-guns/",
      "thumbnail": "",
      "description": "Rep. Chris Sells, R-Greenville, speaks to a colleague on the floor of the Alabama House of Representatives on Feb. 12, 2025 at the Alabama Statehouse in Montgomery, Alabama. A House committee last week approved a bill sp..."
    },
    {
      "title": "Small business owners squeezed by Trump tariffs await Supreme Court decision",
      "link": "https://alabamareflector.com/2026/02/17/repub/small-business-owners-squeezed-by-trump-tariffs-await-supreme-court-decision/",
      "thumbnail": "",
      "description": "Tristan Wright, founder and president of Lost Boy Cider, stands near his production line on Feb. 6, 2026, in Alexandria, Virginia. (Photo by Ashley Murray/States Newsroom)WASHINGTON — Aluminum cans rolling off Virginia c..."
    },
    {
      "title": "Federal judge orders the restoration of exhibits on slavery to the President’s House in Philadelphia",
      "link": "https://alabamareflector.com/2026/02/16/repub/federal-judge-orders-the-restoration-of-exhibits-on-slavery-to-the-presidents-house-in-philadelphia/",
      "thumbnail": "",
      "description": "Tourists inspect a display entitled 'The Dirty Business of Slavery' at the President's House on August 9, 2025 in Philadelphia. (Photo by Matthew Hatcher/Getty Images)In a scathing opinion, U.S. District Court Judge Cynt..."
    }
  ],
  "lastUpdated": "2026-02-18T09:38:27.542Z"
}