{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama senator holds contracts in protest of local governments’ lawsuit over Internet sales tax",
      "link": "https://alabamareflector.com/2025/12/05/alabama-legislative-committee-holds-contracts-over-sales-tax-lawsuit/",
      "thumbnail": "",
      "description": "Sen. Greg Albritton, R-Atmore, speaks on the phone during a session of the Alabama Senate on April 3, 2025 at the Alabama Statehouse in Montgomery, Alabama. Albritton Thursday put a hold on four legal services contracts,..."
    },
    {
      "title": "U.S. work authorizations for legal immigrants slashed from 5 years to 18 months",
      "link": "https://alabamareflector.com/2025/12/05/repub/u-s-work-authorizations-for-legal-immigrants-slashed-from-5-years-to-18-months/",
      "thumbnail": "",
      "description": "Farm workers harvesting yellow bell peppers near Gilroy, California. (Nnehring/Getty Images)WASHINGTON — The Trump administration Thursday announced new restrictions for immigrants, reducing the work authorization period..."
    },
    {
      "title": "Signalgate report says Hegseth created a risk to national security with cellphone messages",
      "link": "https://alabamareflector.com/2025/12/04/repub/signalgate-report-says-hegseth-created-a-risk-to-national-security-with-cellphone-messages/",
      "thumbnail": "",
      "description": "U.S. Rep. Raja Krishnamoorthi, D-Ill., points to text messages by Defense Secretary Pete Hegseth during an annual worldwide threats assessment hearing at the Longworth House Office Building on March 26, 2025 in Washingto..."
    },
    {
      "title": "Man arrested in January 2021 pipe bomb case targeting party headquarters",
      "link": "https://alabamareflector.com/2025/12/04/repub/man-arrested-in-january-2021-pipe-bomb-case-targeting-party-headquarters/",
      "thumbnail": "",
      "description": "Attorney General Pam Bondi spoke on the arrest of Brian J. Cole Jr. from Department of Justice headquarters in Washington, D.C., on Thursday, Dec. 4, 2025. Standing behind Bondi, from left to right, Metropolitan Police D..."
    },
    {
      "title": "Health subsidies would continue for 3 years under Dem bill to be voted on in US Senate",
      "link": "https://alabamareflector.com/2025/12/04/repub/health-subsidies-would-continue-for-3-years-under-dem-bill-to-be-voted-on-in-us-senate/",
      "thumbnail": "",
      "description": "U.S. Senate Minority Leader Chuck Schumer, D-N.Y., and House Minority Leader Hakeem Jeffries, D-N.Y., speak with reporters during a press conference in the U.S. Capitol building in Washington, D.C., on Wednesday, Dec. 3,..."
    },
    {
      "title": "Medicare’s new AI experiment sparks alarm among doctors, lawmakers",
      "link": "https://alabamareflector.com/2025/12/04/repub/medicares-new-ai-experiment-sparks-alarm-among-doctors-lawmakers/",
      "thumbnail": "",
      "description": "Older men play cards in a park in New York City's Chinatown in 2024. Medicare, the public health insurance for older Americans, is piloting a new prior authorization program powered by artificial intelligence that some p..."
    },
    {
      "title": "High tensions around law enforcement, ICE tactics on display in heated US House hearing",
      "link": "https://alabamareflector.com/2025/12/04/repub/high-tensions-around-law-enforcement-ice-tactics-on-display-in-heated-us-house-hearing/",
      "thumbnail": "",
      "description": "Federal agents, including members of the Department of Homeland Security, the Border Patrol, and police, attempt to keep protesters back outside a downtown U.S. Immigration and Customs Enforcement facility on Oct. 4, 202..."
    },
    {
      "title": "Campus outrage mounts after the University of Alabama suspends student magazines",
      "link": "https://alabamareflector.com/2025/12/04/campus-outrage-mounts-after-the-university-of-alabama-suspends-student-magazines/",
      "thumbnail": "",
      "description": "A sunset over the Denny Chimes on the campus of the University of Alabama in Tuscaloosa, Alabama on Monday, Jan. 13, 2024. The university's decision on Monday to suspend two student-run publications has sparked outrage a..."
    },
    {
      "title": "US Senate panel seeks speedy bipartisan deal on health insurance subsidies",
      "link": "https://alabamareflector.com/2025/12/04/repub/us-senate-panel-seeks-speedy-bipartisan-deal-on-health-insurance-subsidies/",
      "thumbnail": "",
      "description": "Louisiana Republican U.S. Sen. Bill Cassidy talks with reporters in the Dirksen Senate office building on Wednesday, Dec. 3, 2025. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — The U.S. Senate committee that over..."
    },
    {
      "title": "Most ACA marketplace users can’t afford potential increases, poll shows",
      "link": "https://alabamareflector.com/2025/12/04/repub/most-aca-marketplace-users-cant-afford-potential-increases-poll-shows/",
      "thumbnail": "",
      "description": "The website of Connect for Health Colorado, the state's health insurance marketplace, is pictured on Aug. 27, 2025. (Photo by Chase Woodruff/Colorado Newsline)WASHINGTON — Americans who purchase their health insurance th..."
    }
  ],
  "lastUpdated": "2025-12-05T17:38:12.640Z"
}