{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Indiana Senate Republicans reject Trump’s plea for gerrymandered maps",
      "link": "https://alabamareflector.com/2025/12/11/repub/indiana-senate-republicans-reject-trumps-plea-for-gerrymandered-maps/",
      "thumbnail": "",
      "description": "Sen. Mike Gaskill, R-Pendleton, argues in support of a redistricting bill in the Senate Chamber on Dec. 11, 2025. (Photo by Casey Smith/Indiana Capital Chronicle)The Republican-dominated Indiana Senate spurned months of ..."
    },
    {
      "title": "University of Alabama alumni organization beats fundraising goal for suspended student magazines",
      "link": "https://alabamareflector.com/2025/12/11/university-of-alabama-alumni-organization-beats-fundraising-goal-for-suspended-student-magazines/",
      "thumbnail": "",
      "description": "Bryant-Denny Stadium at the University of Alabama as seen on Nov. 20, 2025, in Tuscaloosa, Alabama. A University of Alabama alumni association said Thursday it had beaten a fundraising goal for two student magazines susp..."
    },
    {
      "title": "US Senate hits stalemate on solution to spiraling health insurance costs",
      "link": "https://alabamareflector.com/2025/12/11/repub/us-senate-hits-stalemate-on-solution-to-spiraling-health-insurance-costs/",
      "thumbnail": "",
      "description": "Senate Majority Leader John Thune, R-S.D., center, joined by Senate Majority Whip John Barrasso, R-Wyo., left, and Sen. James Lankford, R-Okla., speaks to reporters following a Senate Republican policy luncheon at the U...."
    },
    {
      "title": "Kilmar Abrego Garcia leaves ICE custody as Trump administration vows to fight release",
      "link": "https://alabamareflector.com/2025/12/11/repub/trump-administration-disputes-court-order-for-release-of-abrego-garcia-from-ice-custody/",
      "thumbnail": "",
      "description": "Kilmar Abrego Garcia speaks to a crowd holding a prayer vigil and rally on his behalf outside the ICE building in Baltimore, Maryland, on Aug. 25, 2025. Lydia Walther Rodriguez with CASA interprets for him. (Photo by Wil..."
    },
    {
      "title": "Republicans in Congress eye more power for states to remove voters",
      "link": "https://alabamareflector.com/2025/12/11/repub/republicans-in-congress-eye-more-power-for-states-to-remove-voters/",
      "thumbnail": "",
      "description": "A voter fills out a ballot during Tuesday’s mayoral runoff election in Miami. Republican lawmakers in Congress are interested in changing a federal law, the 1993 National Voter Registration Act, that some conservatives s..."
    },
    {
      "title": "Public lands group files suit over new national park pass that features Trump",
      "link": "https://alabamareflector.com/2025/12/11/repub/public-lands-group-files-suit-over-new-national-park-pass-that-features-trump/",
      "thumbnail": "",
      "description": "A 2026 America the Beautiful Annual Pass to gain entry to U.S. national parks. (Photo from federal court documents)WASHINGTON — A public lands advocacy group sued the Trump administration in federal court Wednesday over ..."
    },
    {
      "title": "SC gets approval to restrict SNAP funds for soda, candy",
      "link": "https://alabamareflector.com/2025/12/11/repub/sc-gets-approval-to-restrict-snap-funds-for-soda-candy/",
      "thumbnail": "",
      "description": "A man shops for groceries at a Chicago supermarket. South Carolina received approval to remove sugary beverages and food items from its grocery assistance program Wednesday, Dec. 10, 2025. (Scott Olson/Getty Images)COLUM..."
    },
    {
      "title": "US House GOP promises vote on reducing health care premiums, but few specifics disclosed",
      "link": "https://alabamareflector.com/2025/12/10/repub/us-house-gop-promises-vote-on-reducing-health-care-premiums-but-few-specifics-disclosed/",
      "thumbnail": "",
      "description": "U.S. House Speaker Mike Johnson, R-La., talks with reporters during a press conference on Wednesday, Dec. 10, 2025. Also pictured from left are Republican Conference Chairwoman Lisa McClain of Michigan, Majority Whip Tom..."
    },
    {
      "title": "Supreme Court hears arguments over intellectual disabilities in Alabama death penalty case",
      "link": "https://alabamareflector.com/2025/12/10/supreme-court-hears-arguments-over-intellectual-disability-in-alabama-death-penalty-case/",
      "thumbnail": "",
      "description": "The U.S. Supreme Court on Oct. 9, 2024. The U.S. Supreme Court Wednesday heard arguments in an Alabama death penalty case, in which the state is challenging lower court determinations that Joseph Clifton Smith, convicted..."
    },
    {
      "title": "Missouri Sen. Hawley amps up pressure campaign on FDA chief to limit medication abortion",
      "link": "https://alabamareflector.com/2025/12/10/repub/missouri-sen-hawley-amps-up-pressure-campaign-on-fda-chief-to-limit-medication-abortion/",
      "thumbnail": "",
      "description": "U.S. Sen. Josh Hawley, R-Mo., talks to reporters at the U.S. Capitol on Saturday, June 28, 2025. (Photo by Ashley Murray/States Newsroom)WASHINGTON — Missouri U.S. Sen. Josh Hawley is ratcheting up pressure on the U.S. F..."
    }
  ],
  "lastUpdated": "2025-12-12T07:17:25.849Z"
}