{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Abortion patients most often rely on independent clinics, but more closed in 2025, report shows",
      "link": "https://alabamareflector.com/2025/12/09/repub/abortion-patients-most-often-rely-on-independent-clinics-but-more-closed-in-2025-report-shows/",
      "thumbnail": "",
      "description": "Abortion-rights advocate Kristin Hadyl helps a car navigate past protesters toward&nbsp; A Preferred Women’s Health Center of Atlanta in Forest Park, Georgia, in August 2023. Independent clinics are facing fresh challeng..."
    },
    {
      "title": "No due process guarantee in fast-track removal proceedings, Trump administration argues",
      "link": "https://alabamareflector.com/2025/12/09/repub/no-due-process-guarantee-in-fast-track-removal-proceedings-trump-administration-argues/",
      "thumbnail": "",
      "description": "The front entrance of the E. Barrett Prettyman U.S. Courthouse in Washington, D.C., which houses the U.S. Court of Appeals for the D.C. Circuit. (Jennifer Shutt/States Newsroom)WASHINGTON — The Trump administration Tuesd..."
    },
    {
      "title": "Epstein co-conspirator grand jury records to be unsealed in New York under court order",
      "link": "https://alabamareflector.com/2025/12/09/repub/epstein-co-conspirator-grand-jury-records-to-be-unsealed-in-new-york-under-court-order/",
      "thumbnail": "",
      "description": "Then-U.S. Attorney for the Southern District of New York Geoffrey Berman announces charges against Jeffrey Epstein on July 8, 2019 in New York City. &nbsp;(Photo by Stephanie Keith/Getty Images)WASHINGTON — A Manhattan f..."
    },
    {
      "title": "Voting by mail faces uncertain moment ahead of midterm elections",
      "link": "https://alabamareflector.com/2025/12/09/repub/voting-by-mail-faces-uncertain-moment-ahead-of-midterm-elections/",
      "thumbnail": "",
      "description": "Workers sort mail-in ballots in October 2024 in San Jose, Calif. The U.S. Supreme Court has agreed to take a case that could require mail ballots to arrive by the close of polls on Election Day. (Photo by Justin Sullivan..."
    },
    {
      "title": "Leaders of 2 major anti-abortion groups call for Trump’s FDA chief to be fired",
      "link": "https://alabamareflector.com/2025/12/09/repub/leader-of-major-anti-abortion-group-calls-for-trumps-fda-chief-to-be-fired/",
      "thumbnail": "",
      "description": "Dr. Martin Makary testifies during his confirmation hearing to lead the Food and Drug Administration before the Senate Committee on Health, Education, Labor, and Pensions Committee at the Dirksen Senate Office Building o..."
    },
    {
      "title": "University of Alabama alumni organize fundraiser for suspended student magazines",
      "link": "https://alabamareflector.com/2025/12/09/university-of-alabama-alumni-organize-fundraiser-for-suspended-student-magazines/",
      "thumbnail": "",
      "description": "A sign for the University of Alabama on University Blvd. in Tuscaloosa, AL Saturday August 24, 2024. University of Alabama alumni have organized a fundraiser to help two student publications suspended by the university f..."
    },
    {
      "title": "Nonprofits, women’s health organizations launch Alabama Birth Equity Initiative",
      "link": "https://alabamareflector.com/2025/12/09/nonprofits-womens-health-organizations-launch-alabama-birth-equity-initiative/",
      "thumbnail": "",
      "description": "The Yellowhammer Fund and other nonprofits are launching the Alabama Birth Equity Initiative, with the goal of improving infant and maternal outcomes in Alabama. Alabama's infant mortality rate has been higher than the n..."
    },
    {
      "title": "Hospital-at-home program extended by US House, awaits Senate consideration",
      "link": "https://alabamareflector.com/2025/12/09/repub/hospital-at-home-program-extended-by-us-house-awaits-senate-consideration/",
      "thumbnail": "",
      "description": "Harry Gordon, 70, seated, gets IV antibiotics at his home in southern New Jersey last spring as part of a Medicare program for home treatment that expired during the federal government shutdown. It faces another pause in..."
    },
    {
      "title": "US Education Department civil rights staff returning to work to tackle complaint backlog",
      "link": "https://alabamareflector.com/2025/12/08/repub/us-education-department-civil-rights-staff-returning-to-work-to-tackle-complaint-backlog/",
      "thumbnail": "",
      "description": "The Lyndon Baines Johnson Department of Education Building on Nov. 25, 2024. (Photo by Shauneen Miranda/States Newsroom)WASHINGTON — The U.S. Education Department is bringing back hundreds of employees in its Office for ..."
    },
    {
      "title": "US Supreme Court seems ready to back Trump in case of fired FTC commissioner",
      "link": "https://alabamareflector.com/2025/12/08/repub/us-supreme-court-seems-ready-to-back-trump-in-case-of-fired-ftc-commissioner/",
      "thumbnail": "",
      "description": "Federal Trade Commissioner Rebecca Slaughter participates in a privacy roundtable at CES 2020 at the Las Vegas Convention Center on Jan. 7, 2020 in Las Vegas, Nevada. (Photo by David Becker/Getty Images)WASHINGTON — The ..."
    }
  ],
  "lastUpdated": "2025-12-10T04:50:56.578Z"
}