{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "In NCAA letter, Michigan congresswoman warns against private equity in college sports",
      "link": "https://alabamareflector.com/2026/01/20/repub/in-ncaa-letter-michigan-congresswoman-warns-against-private-equity-in-college-sports/",
      "thumbnail": "",
      "description": "U.S. Rep. Haley Stevens (D-Birmingham) addresses residents in Detroit at the Durfee Innovation Society to unveil her policy agenda for Black and brown communities across Michigan as she continues her bid for the U.S. Sen..."
    },
    {
      "title": "Trump administration sues another state for sensitive voter data",
      "link": "https://alabamareflector.com/2026/01/20/repub/trump-administration-sues-another-state-for-sensitive-voter-data/",
      "thumbnail": "",
      "description": "A voter casts a paper ballot in Virginia. Despite two recent legal setbacks, the Trump administration has sued the Virginia elections commissioner in its quest to obtain sensitive voter data. (Photo by Markus Schmidt/Vir..."
    },
    {
      "title": "ICE is using Medicaid data to find out where immigrants live",
      "link": "https://alabamareflector.com/2026/01/20/repub/ice-is-using-medicaid-data-to-find-out-where-immigrants-live/",
      "thumbnail": "",
      "description": "A masked U.S. Immigration and Customs Enforcement agent knocks on a car window in Minnesota on Jan. 12. A new court ruling allows ICE to use Medicaid data, alarming some states and advocates who warn it could have a chil..."
    },
    {
      "title": "Alabama House Democrats to prioritize affordability, voting access",
      "link": "https://alabamareflector.com/2026/01/20/alabama-house-democrats-to-prioritize-affordability-voting-access/",
      "thumbnail": "",
      "description": "House Minority Leader Anthony Daniels, D-Hutnsville, speaks at a press conference on Alabama House Democrats priorities for 2026 legislative session at the Alabama Statehouse on Jan. 20, 2026 in Montgomery, Alabama. Demo..."
    },
    {
      "title": "DHS policy to block unannounced lawmaker visits upheld, for now, on technical grounds",
      "link": "https://alabamareflector.com/2026/01/20/repub/dhs-policy-to-block-unannounced-lawmaker-visits-upheld-for-now-on-technical-grounds/",
      "thumbnail": "",
      "description": "Minnesota Democratic U.S. Reps. Kelly Morrison, Ilhan Omar and Rep. Angie Craig arrive outside the regional Immigration and Customs Enforcement headquarters at the Bishop Henry Whipple Federal Building in Minneapolis on ..."
    },
    {
      "title": "Trump says people will ‘find out’ how far he’s willing to go to acquire Greenland",
      "link": "https://alabamareflector.com/2026/01/20/repub/trump-threats-against-greenland-uk-norway-escalate-in-advance-of-major-economic-forum/",
      "thumbnail": "",
      "description": "People hold Greenlandic flags as they gather to march in protest against U.S. President Donald Trump and his announced intent to acquire Greenland on Jan. 17, 2026 in Nuuk, Greenland. (Photo by Sean Gallup/Getty Images)W..."
    },
    {
      "title": "Amid Internet sales tax fight, Alabama senator proposes cutting cities’ tax revenue",
      "link": "https://alabamareflector.com/2026/01/20/amid-internet-sales-tax-fight-alabama-senator-proposes-cutting-cities-tax-revenue/",
      "thumbnail": "",
      "description": "Sen. Greg Albritton, R-Atmore, speaks on the phone during a session of the Alabama Senate on April 3, 2025 at the Alabama Statehouse in Montgomery, Alabama. Albritton, who has sharply criticized a lawsuit from Alabama ci..."
    },
    {
      "title": "Far fewer people buy Obamacare coverage as insurance premiums spike",
      "link": "https://alabamareflector.com/2026/01/20/repub/far-fewer-people-buy-obamacare-coverage-as-insurance-premiums-spike/",
      "thumbnail": "",
      "description": "A patient registers for care at a mobile dental and medical clinic in August 2025. Nationwide, the number of people buying health plans on Obamacare insurance marketplaces is down by about 833,000 compared with a year ag..."
    },
    {
      "title": "One year of Donald Trump: Alarms sound over relentless expansion of presidential powers",
      "link": "https://alabamareflector.com/2026/01/20/repub/one-year-of-donald-trump-alarms-sound-over-relentless-expansion-of-presidential-powers/",
      "thumbnail": "",
      "description": "President Donald Trump tours the assembly line at the Ford River Rouge Complex on Jan. 13, 2026 in Dearborn, Michigan. (Photo by Anna Moneymaker/Getty Images)WASHINGTON — President Donald Trump promised during his bid fo..."
    },
    {
      "title": "Alabama Senate passes bill eliminating cost-sharing for prostate cancer screening",
      "link": "https://alabamareflector.com/2026/01/19/senate-passes-bill-eliminating-cost-sharing-for-prostate-cancer-screening/",
      "thumbnail": "",
      "description": "Sens. Arthur Orr, R-Decatur (left) and Steve Livingston, R-Scottsboro (right) look at a phone on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate passed Living..."
    }
  ],
  "lastUpdated": "2026-01-21T11:43:20.126Z"
}