{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Judge cites ‘profound investigative missteps’ in court case against James Comey",
      "link": "https://alabamareflector.com/2025/11/17/repub/judge-cites-profound-investigative-missteps-in-court-case-against-james-comey/",
      "thumbnail": "",
      "description": "Former FBI Director James Comey testifies before the Senate Intelligence Committee in the Hart Senate Office Building on Capitol Hill on June 8, 2017 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images)WASHINGTON..."
    },
    {
      "title": "Data center growth drives locals to fight for more say",
      "link": "https://alabamareflector.com/2025/11/17/repub/data-center-growth-drives-locals-to-fight-for-more-say/",
      "thumbnail": "",
      "description": "An aerial view shows a data center situated near single-family homes in Stone Ridge, Va., last year. Local communities around the country are seeking more input on where and how data centers are built. (Photo by Nathan H..."
    },
    {
      "title": "Trump in about-face urges US House Republicans to vote to release Epstein files",
      "link": "https://alabamareflector.com/2025/11/17/repub/trump-in-about-face-urges-us-house-republicans-to-vote-to-release-epstein-files/",
      "thumbnail": "",
      "description": "Women who say they were abused by disgraced financier and sex trafficker Jeffrey Epstein raise their hands as attorney Bradley Edwards speaks at a news conference outside the U.S. Capitol on Sept. 3, 2025 in Washington, ..."
    },
    {
      "title": "Latest FEMA acting administrator steps down, with no permanent chief tapped by Trump",
      "link": "https://alabamareflector.com/2025/11/17/repub/latest-fema-acting-administrator-steps-down-with-no-permanent-chief-tapped-by-trump/",
      "thumbnail": "",
      "description": "The Federal Emergency Management Agency building in Washington, D.C., is pictured on Nov. 25, 2024. (Photo by Shauneen Miranda/States Newsroom)WASHINGTON — David Richardson, the senior official performing the duties of t..."
    },
    {
      "title": "Ahead of APT vote on dropping PBS programs, Gov. Kay Ivey urges caution",
      "link": "https://alabamareflector.com/2025/11/17/ahead-of-apt-vote-on-dropping-pbs-programs-gov-kay-ivey-urges-caution/",
      "thumbnail": "",
      "description": "Wayne Reid, the executive director of Alabama Public Television, speaks with a colleague at the Alabama Educational Television Commission meeting on July 29, 2025, in Birmingham, Alabama. Gov. Kay Ivey Monday urged the A..."
    },
    {
      "title": "Trump administration’s FAA chief clears normal operations in the skies post-shutdown",
      "link": "https://alabamareflector.com/2025/11/17/repub/trump-administrations-faa-chief-clears-normal-operations-in-the-skies-post-shutdown/",
      "thumbnail": "",
      "description": "Ronald Reagan Washington National Airport in Arlington, Virginia. (Photo by Tim Brown/Getty Images)The Federal Aviation Administration early Monday lifted an order that airlines cut domestic flights to 40 major U.S. airp..."
    },
    {
      "title": "‘Confused, angry:’ APLS revokes Fairhope Public Library’s remaining 2025 state funds amid dispute",
      "link": "https://alabamareflector.com/2025/11/17/confused-angry-apls-revokes-fairhope-public-librarys-2025-state-aid-amid-book-dispute/",
      "thumbnail": "",
      "description": "Fairhope Public Library Board Chair Randal Wright reads a prepared statement before the Alabama Public Library Service on Thursday, September 18, 2025. APLS said the Fairhope Public Library has forfeited state money susp..."
    },
    {
      "title": "Alabama can never spend enough money on a prison",
      "link": "https://alabamareflector.com/2025/11/17/alabama-can-never-spend-enough-money-on-a-prison/",
      "thumbnail": "",
      "description": "The American flag flying at Holman Correctional Facility on Oct. 22, 2019. A state senator last week said the price tag on a new men's prison in Elmore County had grown to $1.2 billion, eating up nearly all the money the..."
    },
    {
      "title": "Obesity requires comprehensive care, specialist tells Alabama task force",
      "link": "https://alabamareflector.com/2025/11/17/obesity-requires-comprehensive-care-specialist-tells-alabama-task-force/",
      "thumbnail": "",
      "description": "Katherine Saunders, a physician specializing in obesity, speaking to the Chronic Weight Management and Type 2 Diabetes Task Force on Nov. 13, 2025, in the Alabama State House in Montgomery, Alabama. She tole the task for..."
    },
    {
      "title": "New obstacles for proposed Bessemer data center: the Northern Beltline and a fish",
      "link": "https://alabamareflector.com/2025/11/16/new-obstacles-for-proposed-bessemer-data-center-the-northern-beltline-and-a-fish/",
      "thumbnail": "",
      "description": "A specimen of the Birmingham darter documented by Yale biologist Thomas Near and his research team. A biologist says a proposed data center for Bessemer could put the fish at risk of extinction. (Courtesy Konstantinos An..."
    }
  ],
  "lastUpdated": "2025-11-18T05:39:47.250Z"
}