{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Where Alabama Medicaid enrollees get contraceptives",
      "link": "https://alabamareflector.com/2025/12/24/where-alabama-medicaid-enrollees-get-contraceptives/",
      "thumbnail": "",
      "description": "A recent KFF report showed that Alabama Medicaid enrollees leads the nation in receiving contraceptives from public health departments. Alabama Public Health Officer Dr. Scott Harris said he is not surprised because of t..."
    },
    {
      "title": "Trump administration to garnish wages for defaulted student loans",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-administration-to-garnish-wages-for-defaulted-student-loans/",
      "thumbnail": "",
      "description": "The U.S. Education Department said it will start garnishing wages from student borrowers in default. (Catherine Lane/Getty Images)WASHINGTON — President Donald Trump’s administration will start garnishing the wages of st..."
    },
    {
      "title": "US Supreme Court in defeat for Trump blocks deployment of National Guard in Chicago",
      "link": "https://alabamareflector.com/2025/12/23/repub/us-supreme-court-in-defeat-for-trump-blocks-deployment-of-national-guard-in-chicago/",
      "thumbnail": "",
      "description": "Members of the Texas National Guard are seen at the Elwood Army Reserve Training Center on Oct. 7, 2025 in Elwood, Illinois. (Photo by Scott Olson/Getty Images)President Donald Trump for now has not met the requirements ..."
    },
    {
      "title": "Trump administration officially ends veteran abortion access",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-administration-officially-ends-veteran-abortion-access/",
      "thumbnail": "",
      "description": "The U.S. Department of Justice has instructed the U.S. Department of Veterans Affairs to stop providing any abortion care or abortion counseling, even in cases of rape or incest. The policy change comes from the Project ..."
    },
    {
      "title": "Trump appears in several files of latest Epstein release",
      "link": "https://alabamareflector.com/2025/12/23/repub/trump-appears-in-several-files-of-latest-epstein-release/",
      "thumbnail": "",
      "description": "A photograph of President Donald Trump and late sex offender Jeffrey Epstein is displayed after being unofficially installed in a bus shelter. (Leon Neal/Getty Images).WASHINGTON — The U.S. Department of Justice early Tu..."
    },
    {
      "title": "Homeless youth say they need more from schools, social services",
      "link": "https://alabamareflector.com/2025/12/23/repub/homeless-youth-say-they-need-more-from-schools-social-services/",
      "thumbnail": "",
      "description": "A homeless teen, holding a sign “Only 19, alone on the street,” asks for help in Manhattan in New York City. A report from the Covenant House and researchers at the University of California, Berkeley finds that schools a..."
    },
    {
      "title": "Alabama state appeals court upholds dismissal of lawsuit over prison labor",
      "link": "https://alabamareflector.com/2025/12/23/alabama-state-appeals-court-upholds-dismissal-of-lawsuit-over-prison-labor/",
      "thumbnail": "",
      "description": "A gate opens at Holman Correctional Facility in Atmore, Alabama on October 22, 2019. A state appeals court Friday upheld the dismissal of a lawsuit brought by Alabama inmates alleging labor conditions in the state's corr..."
    },
    {
      "title": "New PARCA report: Change in federal reporting could cloud Hispanic student enrollment picture",
      "link": "https://alabamareflector.com/2025/12/23/new-parca-report-suggests-possible-explanation-for-hispanic-latino-student-enrollment-decline/",
      "thumbnail": "",
      "description": "Students arrive for the first day of school at a Minnesota elementary school. Four-day school weeks are gaining in popularity, especially in rural districts. But researchers say the evidence on four-day weeks is unclear...."
    },
    {
      "title": "Louisiana Gov. Jeff Landry selected by Trump to be special envoy to Greenland",
      "link": "https://alabamareflector.com/2025/12/23/repub/louisiana-gov-jeff-landry-selected-by-trump-to-be-special-envoy-to-greenland/",
      "thumbnail": "",
      "description": "Gov. Jeff Landry holds a copy of the Louisiana tax code during his speech to the Legislature at the State Capitol in Baton Rouge on Wednesday, Nov. 6, 2024, the opening day of a special session in which he is asking lawm..."
    },
    {
      "title": "Kilmar Abrego Garcia to remain free from immigration custody for now",
      "link": "https://alabamareflector.com/2025/12/22/repub/kilmar-abrego-garcia-to-remain-free-from-immigration-custody-for-now/",
      "thumbnail": "",
      "description": "Simon Sandoval-Moshenberg, an attorney for Kilmar Abrego Garcia, speaks following a hearing in federal court in Greenbelt, Maryland, on Dec. 22, 2025. (Photo by Ashley Murray/States Newsroom)GREENBELT, Md. — U.S. Distric..."
    }
  ],
  "lastUpdated": "2025-12-24T15:40:49.166Z"
}