{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "An ever-larger share of ICE’s arrested immigrants have no criminal record",
      "link": "https://alabamareflector.com/2025/12/13/repub/an-ever-larger-share-of-ices-arrested-immigrants-have-no-criminal-record/",
      "thumbnail": "",
      "description": "There were 105 immigration arrests in October at a horse racetrack in Wilder, Idaho. Idaho saw one of the country’s largest increases in immigration arrests this year through mid-October compared with the same period in ..."
    },
    {
      "title": "Doug Jones kicks off Alabama gubernatorial campaign with vision of ‘crowded table’",
      "link": "https://alabamareflector.com/2025/12/12/doug-jones-kicks-off-alabama-gubernatorial-campaign-with-vision-of-crowded-table/",
      "thumbnail": "",
      "description": "Former U.S. Sen. Doug Jones speaking at his gubernatorial campaign kickoff event on Dec. 12, 2025, in Birmingham, Alabama. Jones made campaign promises and attacked likely GOP opponent U.S. Sen. Tommy Tuberville during a..."
    },
    {
      "title": "US House GOP preps health care bill for vote before new year",
      "link": "https://alabamareflector.com/2025/12/12/repub/us-house-gop-preps-health-care-bill-for-vote-before-new-year/",
      "thumbnail": "",
      "description": "U.S. House Speaker Mike Johnson, R-La., talks with reporters during a press conference on Wednesday, Dec. 10, 2025. Also pictured are, from left,&nbsp;Republican Conference Chairwoman Lisa McClain of Michigan, Majority W..."
    },
    {
      "title": "Health insurance costs weigh on budget for Alabama Commission on Higher Education",
      "link": "https://alabamareflector.com/2025/12/12/health-insurance-costs-weigh-on-budget-for-alabama-commission-on-higher-education/",
      "thumbnail": "",
      "description": "Jim Purcell, executive director of the Alabama Commission on Higher Education (ACHE), speaks to legislators during a budget presentation on Feb. 5, 2025 at the Alabama Statehouse in Montgomery, Alabama. ACHE will request..."
    },
    {
      "title": "Alabama community college trustees approve $10 fee increase",
      "link": "https://alabamareflector.com/briefs/alabama-community-college-trustees-approve-10-fee-increase/",
      "thumbnail": "",
      "description": "The seal of the Alabama Community College System on display at ACCS' administrative building in Montgomery, Alabama on February 8, 2023. The ACCS Board of Trustees Wednesday approved a $10 increase in an administrative f..."
    },
    {
      "title": "Unemployment rose in half the states in September",
      "link": "https://alabamareflector.com/2025/12/12/repub/unemployment-rose-in-half-the-states-in-september/",
      "thumbnail": "",
      "description": "Recruiters talk to students at a 2024 job fair at South Dakota Mines University in Rapid City. South Dakota had the lowest unemployment rate in the nation, 2%, in September. (Photo courtesy of South Dakota Mines Universi..."
    },
    {
      "title": "Alabama Medical Cannabis Commission approves licenses for dispensaries",
      "link": "https://alabamareflector.com/2025/12/12/alabama-medical-cannabis-commission-approves-licenses-for-dispensaries/",
      "thumbnail": "",
      "description": "Rex Vaughn, chair of the Alabama Medical Cannabis Commission, speaking to reporters after the commission's meeting on Dec. 11, 2025, in the Alabama State House in Montgomery, Alabama. The commission approved three dispen..."
    },
    {
      "title": "Alabama committee announces grants to help veterans suffering from mental illness",
      "link": "https://alabamareflector.com/2025/12/12/alabama-committee-announces-grants-to-help-veterans-suffering-from-mental-illness/",
      "thumbnail": "",
      "description": "Kimberly Boswell, commissioner of the Alabama Department of Mental Health, chairs the Veterans Mental Health Steering Committee on March 26, 2025 in Montgomery, Alabama. The committee awarded grants Thursday to five orga..."
    },
    {
      "title": "In Trump rebuke, US House approves bill to overturn collective bargaining limit",
      "link": "https://alabamareflector.com/2025/12/12/repub/in-trump-rebuke-us-house-approves-bill-to-overturn-collective-bargaining-limit/",
      "thumbnail": "",
      "description": "Protesters rally outside of the Theodore Roosevelt Federal Building headquarters of the U.S. Office of Personnel Management on Feb. 5, 2025, in Washington, D.C. &nbsp;(Photo by Alex Wong/Getty Images)WASHINGTON — The U.S..."
    },
    {
      "title": "Indiana Senate Republicans reject Trump’s plea for gerrymandered maps",
      "link": "https://alabamareflector.com/2025/12/11/repub/indiana-senate-republicans-reject-trumps-plea-for-gerrymandered-maps/",
      "thumbnail": "",
      "description": "Sen. Mike Gaskill, R-Pendleton, argues in support of a redistricting bill in the Senate Chamber on Dec. 11, 2025. (Photo by Casey Smith/Indiana Capital Chronicle)The Republican-dominated Indiana Senate spurned months of ..."
    }
  ],
  "lastUpdated": "2025-12-14T01:08:36.006Z"
}