{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Death of US House member from California narrows already slim GOP majority",
      "link": "https://alabamareflector.com/2026/01/06/repub/death-of-us-house-member-from-california-narrows-already-slim-gop-majority/",
      "thumbnail": "",
      "description": "The U.S. Capitol in Washington, D.C., on Thursday, April 18, 2024. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — U.S. California Republican Rep. Doug LaMalfa has died and Indiana Republican Rep. Jim Baird was inj..."
    },
    {
      "title": "Alabama lawmakers push to make state Imagination Library Program permanent",
      "link": "https://alabamareflector.com/2026/01/06/alabama-lawmakers-push-for-imagination-library-program/",
      "thumbnail": "",
      "description": "Sen. Wes Kitchens, R-Arab, speaks on the floor of the Alabama Senate on May 8, 2024 at the Alabama Statehouse in Montgomery, Alabama. Kitchens and Rep. Terri Collins, R-Decatur, have sponsored legislation that would codi..."
    },
    {
      "title": "Report on PTSD in Alabama first responders to address communication, gaps in care",
      "link": "https://alabamareflector.com/2026/01/06/report-on-ptsd-in-alabama-first-responders-to-address-communication-gaps-in-care/",
      "thumbnail": "",
      "description": "Rep. Allen Treadaway, R-Morris, speaking to reporters on Jan. 5, 2026, after a meeting in the Alabama State House in Montgomery, Alabama. Treadaway will submit the findings of the Interim Study Commission on PTSD in Firs..."
    },
    {
      "title": "How George Wallace and Bull Connor set the stage for Alabama’s sky-high electric rates",
      "link": "https://alabamareflector.com/2026/01/06/how-george-wallace-and-bull-connor-set-the-stage-for-alabamas-sky-high-electric-rates/",
      "thumbnail": "",
      "description": "Former Alabama Gov. George Wallace is seen in this undated photo. Starting in his 1970 gubernatorial campaign, Wallace targeted Alabama Power, accusing the utility of charging high rates and leading to battles over elect..."
    },
    {
      "title": "Freestanding birth centers are closing as maternity care gaps grow",
      "link": "https://alabamareflector.com/2026/01/05/repub/freestanding-birth-centers-are-closing-as-maternity-care-gaps-grow/",
      "thumbnail": "",
      "description": "Sarah Simmons, a midwife and co-owner of Maple Street Birth Center in rural Okanogan County, Wash., holds a newborn. Freestanding birth centers can address maternal health inequities, but many are facing mounting financi..."
    },
    {
      "title": "Pentagon will try to penalize Arizona Sen. Mark Kelly for illegal orders video",
      "link": "https://alabamareflector.com/2026/01/05/repub/pentagon-will-try-to-penalize-arizona-sen-mark-kelly-for-illegal-orders-video/",
      "thumbnail": "",
      "description": "Arizona Democratic Sen. Mark Kelly speaks with reporters in the Mansfield Room of the U.S. Capitol building in Washington, D.C., on Monday, Dec. 1, 2025. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — The Defense ..."
    },
    {
      "title": "Alabama Rep. Terri Collins to retire after four terms",
      "link": "https://alabamareflector.com/2026/01/05/alabama-rep-terri-collins-to-retire-after-four-terms/",
      "thumbnail": "",
      "description": "Rep. Terri Collins, R-Decatur, discusses a bill aimed at allowing in vitro fertilization processes to proceed in the Alabama House of Representatives in the Alabama Statehouse on Feb. 29, 2024 in Montgomery, Alabama. Col..."
    },
    {
      "title": "Alabama lawmaker pushes for screen time limits for children",
      "link": "https://alabamareflector.com/2026/01/05/alabama-lawmaker-pushes-for-screen-time-limits-for-children/",
      "thumbnail": "",
      "description": "Rep. Jeana Ross, R-Guntersville, speaks to the Alabama House of Representatives on May 8, 2024 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)An Alabama lawmaker has pre-filed a bill for..."
    },
    {
      "title": "Alabama’s disconnect between campaigning and governing is back",
      "link": "https://alabamareflector.com/2026/01/05/alabamas-disconnect-between-campaigning-and-governing-is-back/",
      "thumbnail": "",
      "description": "The Alabama Senate chamber on Tuesday, June 6, 2023. Six candidates are seeking the office of Alabama lieutenant governor. The lieutenant governor presides over the Alabama Senate but has little power over the chamber. (..."
    },
    {
      "title": "USPS says mail-in ballots might not get postmark on same day they’re dropped off",
      "link": "https://alabamareflector.com/2026/01/05/repub/usps-says-mail-in-ballots-might-not-get-postmark-on-same-day-theyre-dropped-off/",
      "thumbnail": "",
      "description": "A U.S. Postal Service employee sorts packages inside the Los Angeles Mail Processing &amp; Distribution Center in December. A new USPS rule on postmarks took effect on Dec. 24 that says mail might not be postmarked on th..."
    }
  ],
  "lastUpdated": "2026-01-06T20:43:22.074Z"
}