{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "States will keep pushing AI laws despite Trump’s efforts to stop them",
      "link": "https://alabamareflector.com/2025/12/16/repub/states-will-keep-pushing-ai-laws-despite-trumps-efforts-to-stop-them/",
      "thumbnail": "",
      "description": "A billboard advertises an artificial intelligence company in San Francisco in September. California is among the states leading the way on AI regulations, but an executive order signed by President Donald Trump seeks to ..."
    },
    {
      "title": "Lawmaker views on Caribbean strikes unchanged after Hegseth briefing",
      "link": "https://alabamareflector.com/2025/12/16/repub/lawmaker-views-on-caribbean-strikes-unchanged-after-hegseth-briefing/",
      "thumbnail": "",
      "description": "Secretary of Defense Pete Hegseth and Secretary of State Marco Rubio speak to reporters on Dec. 16, 2025, following a closed-door briefing with all senators about U.S. military action in the Caribbean Sea and eastern Pac..."
    },
    {
      "title": "No US House vote to extend health care subsidies, Speaker Johnson says",
      "link": "https://alabamareflector.com/2025/12/16/repub/no-us-house-vote-to-extend-health-care-subsidies-speaker-johnson-says/",
      "thumbnail": "",
      "description": "U.S. House Speaker Mike Johnson, R-La., talks with reporters inside the U.S. Capitol on Tuesday, Oct. 21, 2025. (Photo by Jennifer Shutt/States Newsroom)WASHINGTON — U.S. House Speaker Mike Johnson said Tuesday he will n..."
    },
    {
      "title": "Delayed jobs report: Unemployment ticks up to 4.6%, jobs up 64K",
      "link": "https://alabamareflector.com/2025/12/16/repub/delayed-jobs-report-unemployment-ticks-up-to-4-6-jobs-up-64000/",
      "thumbnail": "",
      "description": "Recruiters discuss jobs with students at a July 2024 jobs fair at St. Edward's University in Austin, Texas. A new jobs report shows jobs nationwide rebounded after October losses, with a 64,000 gain in November. (Photo C..."
    },
    {
      "title": "Tommy Tuberville’s anti-Muslim attacks land senator on civil rights group’s extremist list",
      "link": "https://alabamareflector.com/2025/12/16/tommy-tubervilles-anti-muslim-attacks-land-him-on-civil-rights-groups-extremist-list/",
      "thumbnail": "",
      "description": "Alabama Sen. Tommy Tuberville addresses media questions in a press gaggle following his speech at the Montgomery Area Chamber of Commerce on Thursday, Oct. 16, 2025. Tuberville has accelerated attacks on Muslim Americans..."
    },
    {
      "title": "About 130,000 Alabamians at risk of losing health care without ACA tax credits",
      "link": "https://alabamareflector.com/2025/12/16/130000-alabamians-at-risk-of-losing-health-care-without-tax-credits/",
      "thumbnail": "",
      "description": "Two protesters holding signs that read \"Cuts to Medicaid are policy murder!\" at the Alabama Poor People’s Campaign Moral Monday protest on Sept. 29, 2025, on the front steps of the Alabama State Capitol in Montgomery, Al..."
    },
    {
      "title": "Republicans could gain nearly 200 state legislative seats in voting rights case, report finds",
      "link": "https://alabamareflector.com/2025/12/15/repub/republicans-could-gain-nearly-200-state-legislative-seats-in-voting-rights-case-report-finds/",
      "thumbnail": "",
      "description": "Voters walk to a polling place at a school gym in New Orleans. Republicans could gain scores of state legislative seats if the U.S. Supreme Court weakens a federal voting rights law, a new analysis finds. (Photo by Stacy..."
    },
    {
      "title": "Trump ‘very strongly’ considering loosening federal marijuana regulations",
      "link": "https://alabamareflector.com/2025/12/15/repub/trump-very-strongly-considering-loosening-federal-marijuana-regulations/",
      "thumbnail": "",
      "description": "A small cannabis plant. (Photo by Getty Images)President Donald Trump’s administration is looking “very strongly” at reclassifying cannabis from the strictest category of controlled substances, Trump said Monday. In a br..."
    },
    {
      "title": "Mountain Brook woman killed in mass shooting at Brown University",
      "link": "https://alabamareflector.com/2025/12/15/victim-in-brown-university-shooting-identified-as-mountain-brook-resident/",
      "thumbnail": "",
      "description": "Ella Cook, 19, a resident of Mountain Brook, was killed in a mass shooting at Brown University on Dec. 13, 2025. (Photo via LinkedIn)A woman from Mountain Brook was one of two people killed in a mass shooting at Brown Un..."
    },
    {
      "title": "Arrests nationwide have fallen to historic lows, report finds",
      "link": "https://alabamareflector.com/2025/12/15/repub/arrests-nationwide-have-fallen-to-historic-lows-report-finds/",
      "thumbnail": "",
      "description": "Federal and local law enforcement officers arrest a man in Washington, D.C., in August. The number of arrests nationwide fell sharply in 2020 and have stayed down since then, according to a new report from the nonpartisa..."
    }
  ],
  "lastUpdated": "2025-12-16T21:14:12.320Z"
}