{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Members of Democratic caucus press ICE for answers on detainment of pregnant women",
      "link": "https://alabamareflector.com/2025/11/18/repub/members-of-democratic-caucus-press-ice-for-answers-on-detainment-of-pregnant-women/",
      "thumbnail": "",
      "description": "A woman is detained by federal agents after exiting a hearing in immigration court at the Jacob K. Javitz Federal Building on Sept. 3, 2025 in New York City. (Photo by Michael M. Santiago/Getty Images)WASHINGTON — More t..."
    },
    {
      "title": "Black and Hispanic students see gains on Alabama report card",
      "link": "https://alabamareflector.com/2025/11/18/black-and-hispanic-students-see-gains-on-alabama-report-card/",
      "thumbnail": "",
      "description": "Cassandra Compton, a teacher in the Sumter County School System, teaches a group of elementary students in the Sumter Central High School in York, Alabama on June 26, 2025, Black and Hispanic students showed gains on the..."
    },
    {
      "title": "A voter’s guide to the House District 38 special GOP primary runoff",
      "link": "https://alabamareflector.com/2025/11/18/a-voters-guide-to-the-house-district-38-special-gop-primary-runoff/",
      "thumbnail": "",
      "description": "Garrett Dixon (left) and Kristin Nelson will face off in a special GOP primary runoff election for House District 38 in Chambers and Lee counties on Nov. 18. The winner of the runoff will face Democratic candidate Hazel ..."
    },
    {
      "title": "Judge cites ‘profound investigative missteps’ in court case against James Comey",
      "link": "https://alabamareflector.com/2025/11/17/repub/judge-cites-profound-investigative-missteps-in-court-case-against-james-comey/",
      "thumbnail": "",
      "description": "Former FBI Director James Comey testifies before the Senate Intelligence Committee in the Hart Senate Office Building on Capitol Hill on June 8, 2017 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images)WASHINGTON..."
    },
    {
      "title": "Data center growth drives locals to fight for more say",
      "link": "https://alabamareflector.com/2025/11/17/repub/data-center-growth-drives-locals-to-fight-for-more-say/",
      "thumbnail": "",
      "description": "An aerial view shows a data center situated near single-family homes in Stone Ridge, Va., last year. Local communities around the country are seeking more input on where and how data centers are built. (Photo by Nathan H..."
    },
    {
      "title": "Trump in about-face urges US House Republicans to vote to release Epstein files",
      "link": "https://alabamareflector.com/2025/11/17/repub/trump-in-about-face-urges-us-house-republicans-to-vote-to-release-epstein-files/",
      "thumbnail": "",
      "description": "Women who say they were abused by disgraced financier and sex trafficker Jeffrey Epstein raise their hands as attorney Bradley Edwards speaks at a news conference outside the U.S. Capitol on Sept. 3, 2025 in Washington, ..."
    },
    {
      "title": "Latest FEMA acting administrator steps down, with no permanent chief tapped by Trump",
      "link": "https://alabamareflector.com/2025/11/17/repub/latest-fema-acting-administrator-steps-down-with-no-permanent-chief-tapped-by-trump/",
      "thumbnail": "",
      "description": "The Federal Emergency Management Agency building in Washington, D.C., is pictured on Nov. 25, 2024. (Photo by Shauneen Miranda/States Newsroom)WASHINGTON — David Richardson, the senior official performing the duties of t..."
    },
    {
      "title": "Ahead of APT vote on dropping PBS programs, Gov. Kay Ivey urges caution",
      "link": "https://alabamareflector.com/2025/11/17/ahead-of-apt-vote-on-dropping-pbs-programs-gov-kay-ivey-urges-caution/",
      "thumbnail": "",
      "description": "Wayne Reid, the executive director of Alabama Public Television, speaks with a colleague at the Alabama Educational Television Commission meeting on July 29, 2025, in Birmingham, Alabama. Gov. Kay Ivey Monday urged the A..."
    },
    {
      "title": "Trump administration’s FAA chief clears normal operations in the skies post-shutdown",
      "link": "https://alabamareflector.com/2025/11/17/repub/trump-administrations-faa-chief-clears-normal-operations-in-the-skies-post-shutdown/",
      "thumbnail": "",
      "description": "Ronald Reagan Washington National Airport in Arlington, Virginia. (Photo by Tim Brown/Getty Images)The Federal Aviation Administration early Monday lifted an order that airlines cut domestic flights to 40 major U.S. airp..."
    },
    {
      "title": "‘Confused, angry:’ APLS revokes Fairhope Public Library’s remaining 2025 state funds amid dispute",
      "link": "https://alabamareflector.com/2025/11/17/confused-angry-apls-revokes-fairhope-public-librarys-2025-state-aid-amid-book-dispute/",
      "thumbnail": "",
      "description": "Fairhope Public Library Board Chair Randal Wright reads a prepared statement before the Alabama Public Library Service on Thursday, September 18, 2025. APLS said the Fairhope Public Library has forfeited state money susp..."
    }
  ],
  "lastUpdated": "2025-11-18T18:53:39.185Z"
}