{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Death penalty in Alabama would expand under House committee-approved bills",
      "link": "https://alabamareflector.com/2026/01/15/alabama-house-committee-approves-bills-that-would-expand-death-penalty/",
      "thumbnail": "",
      "description": "Rep. Matt Simpson, R-Daphne, stands on the floor of the Alabama House of Representatives on Feb. 8, 2024 in Montgomery, Alabama. The House Judiciary Committee passed two bills sponsored by Simpson to expand the circumsta..."
    },
    {
      "title": "Alabama House committee approves bill to criminalize organ harvesting",
      "link": "https://alabamareflector.com/2026/01/15/alabama-house-committee-approves-bill-to-criminalize-organ-harvesting/",
      "thumbnail": "",
      "description": "Rep. Chris England, D-Tuscaloosa, checks his phone during a meeting of the Alabama House of Representatives on April 15, 2025 at the Alabama Statehouse in Montgomery, Alabama. The Alabama House Judiciary Committee Wednes..."
    },
    {
      "title": "Alabama House committee approves state Imagination Library Program bill",
      "link": "https://alabamareflector.com/2026/01/15/alabama-house-committee-approves-state-imagination-library-program-bill/",
      "thumbnail": "",
      "description": "Rep. Terri Collins, R-Decatur, chair of the House Education Policy Committee, listens to debate during a session of the Alabama House of Representatives on Tuesday, March 14, 2023. (Stew Milne for Alabama Reflector)A Hou..."
    },
    {
      "title": "Visa processing for immigrants from 75 nations frozen by Trump administration",
      "link": "https://alabamareflector.com/2026/01/14/repub/visa-processing-for-immigrants-from-75-nations-frozen-by-trump-administration/",
      "thumbnail": "",
      "description": "Exterior of the U.S. Department of State Harry S. Truman Building, in Washington, D.C., in May 2024. (Official State Department photo by Linda D. Epstein)WASHINGTON — The State Department announced Wednesday it would sus..."
    },
    {
      "title": "Democrats in Congress seek to impeach Homeland Security Secretary Kristi Noem",
      "link": "https://alabamareflector.com/2026/01/14/repub/democrats-in-congress-seek-to-impeach-homeland-security-secretary-kristi-noem/",
      "thumbnail": "",
      "description": "Homeland Security Secretary Kristi Noem arrives for a Senate Appropriations Committee hearing in the Dirksen Senate Office Building on Capitol Hill on May 8, 2025 in Washington, D.C. (Photo by Andrew Harnik/Getty Images)..."
    },
    {
      "title": "Ivey proposes $570 million ETF increase, $29 million cut to General Fund",
      "link": "https://alabamareflector.com/2026/01/14/ivey-proposes-570-million-etf-increase-29-million-cut-to-general-fund/",
      "thumbnail": "",
      "description": "Gov. Kay Ivey enters the Alabama State Capitol ahead of the State of the State address speech on Tuesday, Jan. 13, 2026, in Montgomery, Ala. Ivey's 2027 budget proposals would call for an additional $570 million for the ..."
    },
    {
      "title": "Alabama Senate committee OKs bill eliminating cost-sharing for prostate cancer screening",
      "link": "https://alabamareflector.com/2026/01/14/alabama-senate-committee-approves-bill-eliminating-cost-sharing-for-prostate-cancer-screening/",
      "thumbnail": "",
      "description": "Sen. Steve Livingston, R-Scottsboro, stands on the floor of the Alabama Senate on Feb. 13, 2025 at the Alabama Statehouse in Montgomery, Alabama. The Senate Banking and Insurance Committee Wednesday unanimously approved ..."
    },
    {
      "title": "Missouri trial could affect abortion access across the Midwest and South",
      "link": "https://alabamareflector.com/2026/01/14/repub/missouri-trial-could-affect-abortion-access-across-the-midwest-and-south/",
      "thumbnail": "",
      "description": "A trial over Missouri’s abortion regulations began Monday at the Jackson County Courthouse in Kansas City, Mo. Experts are watching the case, which could impact abortion access across the Midwest and South. (Photo by Kev..."
    },
    {
      "title": "Judge weighs Trump administration limits on congressional visits to immigration facilities",
      "link": "https://alabamareflector.com/2026/01/14/repub/judge-weighs-trump-administration-limits-on-congressional-visits-to-immigration-facilities/",
      "thumbnail": "",
      "description": "Federal agents stage at a front gate as Democratic Reps. Ilhan Omar, Kelly Morrison and Angie Craig of Minnesota attempt to enter the regional ICE headquarters at the Bishop Henry Whipple Federal Building on Jan. 10, 202..."
    },
    {
      "title": "Ivey calls for CHOOSE Act, death penalty expansion in last State of the State address",
      "link": "https://alabamareflector.com/2026/01/14/ivey-calls-for-choose-act-death-penalty-expansion-in-last-state-of-the-state-address/",
      "thumbnail": "",
      "description": "Gov. Kay Ivey delivers the State of the State Address at the Alabama State Capitol on Tuesday, Jan. 13, 2026, in Montgomery, Ala. Ivey called for the expansion of a voucher-like school program and broader use of the deat..."
    }
  ],
  "lastUpdated": "2026-01-15T15:51:26.113Z"
}