{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Senate committee OKs bill exempting some K-12, higher ed construction projects from inspections",
      "link": "https://alabamareflector.com/2026/01/28/senate-committee-oks-bill-exempting-some-k-12-higher-ed-construction-projects-from-inspections/",
      "thumbnail": "",
      "description": "Sen. Larry Stutts, R-Tuscumbia, walks on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)An Alabama Senate Committee passed a bill Wednesd..."
    },
    {
      "title": "State lawmakers stand ready to help ICE — or impede it",
      "link": "https://alabamareflector.com/2026/01/28/repub/state-lawmakers-stand-ready-to-help-ice-or-impede-it/",
      "thumbnail": "",
      "description": "People gather near the spot where federal agents shot and killed Alex Pretti on Jan. 24, the third shooting in Minneapolis in as many weeks. Lawmakers in more than a dozen states have introduced a wave of bills aimed at ..."
    },
    {
      "title": "Attack on US Rep. Ilhan Omar follows major uptick in threats against members of Congress",
      "link": "https://alabamareflector.com/2026/01/28/repub/attack-on-us-rep-ilhan-omar-follows-major-uptick-in-threats-against-members-of-congress/",
      "thumbnail": "",
      "description": "U.S. Rep. Ilhan Omar, D-Minn., left, and Rep. Angie Craig, D-Minn., stand outside the regional ICE headquarters at the Bishop Henry Whipple Federal Building on Jan. 10, 2026 in Minneapolis, Minnesota. &nbsp;A man squirte..."
    },
    {
      "title": "Alabama House votes to extend death penalty to child sexual assault",
      "link": "https://alabamareflector.com/2026/01/28/alabama-house-votes-to-extend-death-penalty-to-child-sexual-assault/",
      "thumbnail": "",
      "description": "Rep. Matt Simpson, R-Daphne, stands on the floor of the Alabama House of Representatives on Feb. 8, 2024 in Montgomery, Alabama. The Alabama House of Representatives on Tuesday approved a bill sponsored by Simpson to ext..."
    },
    {
      "title": "Screen time limits for young children approved by Alabama House",
      "link": "https://alabamareflector.com/2026/01/28/screen-time-limits-for-young-children-approved-by-alabama-house/",
      "thumbnail": "",
      "description": "Rep. Jeana Ross, R-Guntersville, speaks to a colleague in the Alabama House of Representatives on Jan. 27, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector) The Alabama House of Repre..."
    },
    {
      "title": "Democratic AGs stress importance of citizen-generated evidence in challenging ICE",
      "link": "https://alabamareflector.com/2026/01/27/repub/democratic-ags-stress-importance-of-citizen-generated-evidence-in-challenging-ice/",
      "thumbnail": "",
      "description": "Federal agents block in and stop a woman to ask her about another person’s whereabouts on Jan. 19, 2026, in south Minneapolis. Cellphone video taken by bystanders has contradicted the Trump administration’s account of so..."
    },
    {
      "title": "Terri Sewell, Shomari Figures among U.S. House Dems seeking Kristi Noem impeachment",
      "link": "https://alabamareflector.com/2026/01/27/repub/terri-sewell-shomari-figures-among-u-s-house-dems-seeking-kristi-noem-impeachment/",
      "thumbnail": "",
      "description": "U.S. Secretary of Homeland Security Kristi Noem at a roundtable discussion with local ranchers and employees from U.S. Customs and Border Protection on Jan. 7, 2026 in Brownsville, Texas. (Photo by Michael Gonzalez/Getty..."
    },
    {
      "title": "Homeland Security boss Noem in hot water after response to Minneapolis killings",
      "link": "https://alabamareflector.com/2026/01/27/repub/homeland-security-boss-noem-in-hot-water-after-response-to-minneapolis-killings/",
      "thumbnail": "",
      "description": "Hundreds gather around a growing memorial site at 26th Street and Nicollet Avenue South in Minneapolis, where federal agents shot and killed Alex Pretti Saturday, Jan. 24, 2026 earlier in the day. (Photo by Nicole Neri/M..."
    },
    {
      "title": "Former Alabama GOP chair John Wahl announces lieutenant governor run",
      "link": "https://alabamareflector.com/2026/01/27/former-alabama-gop-chair-john-wahl-announces-lieutenant-governor-run/",
      "thumbnail": "",
      "description": "Former Alabama Republican Party Chair John Wahl speaks with reporters on Tuesday, Jan. 27, 2026 at a news conference at AL GOP headquarters announcing his run for lieutenant governor. (Ralph Chapoco/Alabama Reflector)For..."
    },
    {
      "title": "McFeeters files residency challenge against Tommy Tuberville with Alabama GOP",
      "link": "https://alabamareflector.com/2026/01/27/mcfeeters-files-residency-challenge-against-tommy-tuberville-with-alabama-gop/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, speaks at the Alabama County Commission Association convention at the Perdido Beach Resort in Orange Beach, Alabama, on Aug. 20, 2025. Republican gubernatorial challenger Ken McFeet..."
    }
  ],
  "lastUpdated": "2026-01-28T21:22:21.643Z"
}