{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "As Supreme Court pulls back on gerrymandering, state courts may decide fate of maps",
      "link": "https://alabamareflector.com/2025/12/22/repub/as-supreme-court-pulls-back-on-gerrymandering-state-courts-may-decide-fate-of-maps/",
      "thumbnail": "",
      "description": "Missouri Capitol Police officers conduct security checks on boxes of petition signatures submitted to force a referendum vote on the state’s new congressional map. State courts in Missouri and other states may decide whe..."
    },
    {
      "title": "Alabama legislator files bills targeting the death penalty",
      "link": "https://alabamareflector.com/2025/12/22/alabama-legislator-files-bills-targeting-the-death-penalty/",
      "thumbnail": "",
      "description": "Rep. Chris England, D-Tuscaloosa, speaks to Rep. Steve Clouse, R-Ozark, on the floor of the Alabama House of Representatives on April 1, 2025 at the Alabama Statehouse in Montgomery, Alabama. England has filed two bills ..."
    },
    {
      "title": "Don’t ignore the threat that is Tommy Tuberville",
      "link": "https://alabamareflector.com/2025/12/22/dont-ignore-the-threat-that-is-tommy-tuberville/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, greets a crowd at an Alabama Republican Party fundraiser on Aug. 4, 2023. Tuberville last week called for the forced deportation of Muslims. (Stew Milne for Alabama Reflector)Tommy ..."
    },
    {
      "title": "Phillip Ensler’s lieutenant governor bid encouraged by Doug Jones",
      "link": "https://alabamareflector.com/2025/12/22/phillip-enslers-lieutenant-governor-bid-encouraged-by-doug-jones/",
      "thumbnail": "",
      "description": "Rep. Phillip Ensler, D-Montgomery, stands on the floor of the Alabama House of Representatives on April 29, 2025 at the Alabama Statehouse in Montgomery, Alabama. Ensler announced his campaign for lieutenant governor Fri..."
    },
    {
      "title": "Trump’s DOJ offers states confidential deal to remove voters flagged by feds",
      "link": "https://alabamareflector.com/2025/12/21/repub/trumps-doj-offers-states-confidential-deal-to-wipe-voters-flagged-by-feds-as-ineligible/",
      "thumbnail": "",
      "description": "A Tennessee voter casts his ballot in Nashville during a special election this month. The U.S. Department of Justice has sent confidential draft agreements on voter data sharing to more than a dozen states, including Ten..."
    },
    {
      "title": "Incarcerated women often don’t have enough period products",
      "link": "https://alabamareflector.com/2025/12/20/repub/incarcerated-women-often-dont-have-enough-period-products/",
      "thumbnail": "",
      "description": "Tampons are provided to people incarcerated in Arkansas state correctional facilities. Nationwide, many people in jails and prisons don’t have access to sufficient period products. (Photo courtesy of the Arkansas Departm..."
    },
    {
      "title": "US House passes bill to remove gray wolf from Endangered Species Act list",
      "link": "https://alabamareflector.com/2025/12/19/repub/us-house-passes-bill-to-remove-gray-wolf-from-endangered-species-act-list/",
      "thumbnail": "",
      "description": "A wolf makes its way across a road in Yellowstone National Park. (Jacob W. Frank/Courtesy of the U.S. National Park Service)The U.S. House on Thursday passed, 211-204, a bill to remove Endangered Species Act protections ..."
    },
    {
      "title": "Department of Justice releases new documents, photos as part of Epstein files",
      "link": "https://alabamareflector.com/2025/12/19/repub/criticism-erupts-after-doj-official-says-some-epstein-files-will-emerge-after-deadline/",
      "thumbnail": "",
      "description": "Former President Bill Clinton, rock star Mick Jagger and the late sex offender Jeffrey Epstein are seated at a table in this undated photo released as part of the Epstein files on Friday, Dec. 19, 2025, by the Department..."
    },
    {
      "title": "Trump administration moves to pause diversity visa program after Brown, MIT shootings",
      "link": "https://alabamareflector.com/2025/12/19/repub/trump-administration-moves-to-pause-diversity-visa-program-after-brown-mit-shootings/",
      "thumbnail": "",
      "description": "Brown University President Christina Paxson speaks to reporters gathered at the Providence Public Safety Complex on Dec. 16, 2025. Gov. Dan McKee, far left, and Providence Mayor Brett Smiley are also pictured. (Photo by ..."
    },
    {
      "title": "Suspected Brown mass shooter found dead in N.H. storage facility; linked to MIT physicist’s killing",
      "link": "https://alabamareflector.com/2025/12/19/repub/suspected-brown-mass-shooter-found-dead-in-n-h-storage-facility-linked-to-mit-physicists-killing/",
      "thumbnail": "",
      "description": "Claudio Manuel Neves Valente, the suspected Brown University shooter, is seen at the Alamo Rent a Car in Boston on Nov. 17, 2025. (Photos from Providence Police affidavit)“We got him.” With those three words from Ted Doc..."
    }
  ],
  "lastUpdated": "2025-12-22T18:51:08.054Z"
}