{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "McFeeters files residency challenge against Tommy Tuberville with Alabama GOP",
      "link": "https://alabamareflector.com/2026/01/27/mcfeeters-files-residency-challenge-against-tommy-tuberville-with-alabama-gop/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, speaks at the Alabama County Commission Association convention at the Perdido Beach Resort in Orange Beach, Alabama, on Aug. 20, 2025. Republican gubernatorial challenger Ken McFeet..."
    },
    {
      "title": "Alabama Cannabis Commission extends stay on proposed dispensaries",
      "link": "https://alabamareflector.com/2026/01/27/alabama-cannabis-commission-extends-stay-on-proposed-dispensaries/",
      "thumbnail": "",
      "description": "John McMillan, director of the Alabama Medical Cannabis Commission, speaking at the commission's meeting on Dec. 11, 2025, in the Alabama State House in Montgomery, Alabama. The commission extended a stay on a license fo..."
    },
    {
      "title": "These are the states where incomes grew the most, least in recent decades",
      "link": "https://alabamareflector.com/2026/01/27/repub/these-are-the-states-where-incomes-grew-the-most-least-in-recent-decades/",
      "thumbnail": "",
      "description": "Residential and commercial development in the Sugarhouse area of Salt Lake City is pictured in July 2024. A new study found Utah median household incomes increased at a higher rate than any other state over the past 50 y..."
    },
    {
      "title": "Limestone County judge places restrictions on Belle Mina quarry as case proceeds",
      "link": "https://alabamareflector.com/2026/01/27/limestone-county-judge-places-restrictions-on-mine-until-case-is-decided/",
      "thumbnail": "",
      "description": "A map of a limestone quarry near Belle Mina in Limestone County. A judge last week placed restrictions on the operations of the mine amid an ongoing lawsuit. (Southern Environmental Law Center)A Limestone county judge Fr..."
    },
    {
      "title": "GOP gubernatorial candidate plans to challenge Tommy Tuberville’s residency",
      "link": "https://alabamareflector.com/2026/01/27/gop-gubernatorial-candidate-plans-to-challenge-tommy-tubervilles-residency/",
      "thumbnail": "",
      "description": "U.S. Sen. Tommy Tuberville, R-Alabama, speaks to a crowd at an Alabama Republican Party fundraiser on Aug. 4, 2023. GOP gubernatorial candidate Ken McFeeters said Monday he plans to file a challenge to Tuberville's candi..."
    },
    {
      "title": "Alabama House passes bill aimed at curbing school bus driver shortage",
      "link": "https://alabamareflector.com/2026/01/27/alabama-house-passes-bill-to-curb-school-bus-driver-shortage/",
      "thumbnail": "",
      "description": "Rep. Kenneth Paschal, R-Pelham, speaks to a staffer on the floor of the Alabama House of Representatives on Feb. 13, 2024 in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)The Alabama House of Representatives Thursd..."
    },
    {
      "title": "As AI-generated fake content mars legal cases, states want guardrails",
      "link": "https://alabamareflector.com/2026/01/26/repub/as-ai-generated-fake-content-mars-legal-cases-states-want-guardrails/",
      "thumbnail": "",
      "description": "CoCounsel Legal is an artificial intelligence tool that acts as a virtual assistant for legal professionals. More people in the legal field are using AI to automate repetitive tasks and save time, but hallucinations have..."
    },
    {
      "title": "Congress hurtles toward partial shutdown after Alex Pretti killing in Minneapolis",
      "link": "https://alabamareflector.com/2026/01/26/repub/congress-hurtles-toward-partial-shutdown-after-alex-pretti-killing-in-minneapolis/",
      "thumbnail": "",
      "description": "Pictures of Alex Pretti sit in front of his home on Jan. 26, 2026 in Minneapolis, Minnesota. Pretti, an ICU nurse at a VA medical center, died Jan. 25, after being shot multiple times during a brief altercation with Bord..."
    },
    {
      "title": "US Senate Dems probe effect of Trump administration child care cutbacks on rural families",
      "link": "https://alabamareflector.com/2026/01/26/repub/us-senate-dems-probe-effect-of-trump-administration-child-care-cutbacks-on-rural-families/",
      "thumbnail": "",
      "description": "A September poll from&nbsp;First Five Years Fund, an advocacy group, found that 4 out of 5 rural Americans “say the ability of working parents to find and afford quality child care is either in a ‘state of crisis’ or ‘a ..."
    },
    {
      "title": "Homan heads to Minneapolis as White House, under siege, softens tone",
      "link": "https://alabamareflector.com/2026/01/26/repub/trump-sending-border-czar-homan-to-minnesota-in-aftermath-of-second-fatal-shooting/",
      "thumbnail": "",
      "description": "U.S. Border Czar Tom Homan speaks at the Tampa Convention Center on July 12, 2025. (Photo by Mitch Perry/Florida Phoenix)WASHINGTON — U.S. border czar Tom Homan is expected in Minneapolis by Monday evening, President Don..."
    }
  ],
  "lastUpdated": "2026-01-27T21:11:56.265Z"
}