{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama State Health Officer: ‘Fully expect’ to see measles in the state",
      "link": "https://alabamareflector.com/2026/02/19/alabama-state-health-officer-fully-expect-to-see-measles-in-the-state/",
      "thumbnail": "",
      "description": "Dr. Scott Harris, Alabama State Health Officer, at the Oversight Commission on Opioid Settlement Funds meeting on Feb. 18, 2026, in the Alabama Statehouse in Montgomery, Alabama. Harris said Thursday the state is prepari..."
    },
    {
      "title": "Legislation allowing firings of library board members moves closer to Alabama House vote",
      "link": "https://alabamareflector.com/2026/02/19/alabama-house-committee-oks-bill-allowing-firing-of-library-board-members-with-changes/",
      "thumbnail": "",
      "description": "Sen. Chris Elliott, R-Josephine (right) speaks with Sen. Clyde Chambliss, R-Prattville (left) and Steve Livingston, R-Scottsboro (center) on the floor of the Alabama Senate on Feb. 17, 2026, in Montgomery, Alabama. The H..."
    },
    {
      "title": "Organ donors would get guaranteed leave, insurance protections under Alabama House bill",
      "link": "https://alabamareflector.com/2026/02/19/organ-donors-would-get-guaranteed-leave-insurance-protections-under-alabama-house-bill/",
      "thumbnail": "",
      "description": "House Minority Leader Anthony Daniels, D-Huntsville, speaks to House Speaker Pro Tem Chris Pringle, R-Mobile, on the floor of the Alabama House of Representatives on Jan. 13, 2026. An Alabama House committee Wednesday ap..."
    },
    {
      "title": "Bill making bail for immigrants without status more difficult passes Alabama House committee",
      "link": "https://alabamareflector.com/2026/02/19/bill-making-bail-for-immigrants-without-status-more-difficult-passes-alabama-house-committee/",
      "thumbnail": "",
      "description": "Rep. Chad Robertson, R-Heflin, stands on the floor of the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. The House Judiciary Committee Wednesday approved legislation sp..."
    },
    {
      "title": "Some states are helping to make Obamacare plans more affordable",
      "link": "https://alabamareflector.com/2026/02/18/repub/some-states-are-helping-to-make-obamacare-plans-more-affordable/",
      "thumbnail": "",
      "description": "Colorado Republican state Sen. Rod Pelton, left, and Senate President James Coleman, a Democrat, speak during the sixth day of the special legislative session in August 2025. Colorado is among the states using state fund..."
    },
    {
      "title": "Alabama House committee OKs bill allowing colleges, universities to choose accreditors",
      "link": "https://alabamareflector.com/2026/02/18/alabama-house-committee-oks-bill-allowing-colleges-universities-to-choose-accreditors/",
      "thumbnail": "",
      "description": "Rep. Susan DuBose, R-Hoover, speaks to a colleague on the floor of the Alabama House of Representatives on Feb. 3, 2026 at the Alabama Statehouse in Montgomery, Alabama. A House committee Wednesday approved a bill sponos..."
    },
    {
      "title": "Climate, health groups challenge EPA repeal of major greenhouse gas regulation",
      "link": "https://alabamareflector.com/2026/02/18/repub/climate-health-groups-challenge-epa-repeal-of-major-greenhouse-gas-regulation/",
      "thumbnail": "",
      "description": "Marathon Petroleum Company’s Salt Lake City Refinery in Salt Lake City on Jan. 3, 2024. (Photo by Spenser Heaps for Utah News Dispatch)A coalition of public health and environmental groups filed a suit Wednesday challeng..."
    },
    {
      "title": "Alabama Opioid Settlement Fund to receive $43.1 million in 2026 supplemental budget",
      "link": "https://alabamareflector.com/2026/02/18/alabama-opioid-settlement-fund-to-receive-43-1-million-in-2026-supplemental-budget/",
      "thumbnail": "",
      "description": "Rep. Rex Reynolds, R-Huntsville, speaking at the Oversight Commission on Opioid Settlement Funds meeting on Feb. 18, 2026, in the Alabama Statehouse in Montgomery, Alabama. The commission on Wednesday approved a plan to ..."
    },
    {
      "title": "Paul Lee elected Alabama House Majority Leader after Scott Stadthagen steps down",
      "link": "https://alabamareflector.com/2026/02/18/alabama-house-majority-leader-steps-down-to-run-for-alabama-gop-chair/",
      "thumbnail": "",
      "description": "Rep. Paul Lee, R-Dothan, stands on the floor of the Alabama House of Representatives prior to the start of the session on Tuesday, March 14, 2023. House Republicans elected Lee House Majority Leader Wednesday after Rep. ..."
    },
    {
      "title": "Alabama House bill increases time for law enforcement to collect DNA evidence",
      "link": "https://alabamareflector.com/briefs/alabama-house-bill-increases-time-for-law-enforcement-to-collect-dna-evidence/",
      "thumbnail": "",
      "description": "Rep. Joe Lovvorn, R-Auburn, standing on the floor of the Alabama House of Representatives on Jan. 15, 2026, in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)The House Public Safety and Homeland Security Committee ..."
    }
  ],
  "lastUpdated": "2026-02-19T19:15:43.803Z"
}