{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Alabama Senate approves bill allowing firings of library board members",
      "link": "https://alabamareflector.com/2026/02/11/alabama-senate-approves-bill-allowing-firings-of-library-board-members/",
      "thumbnail": "",
      "description": "Sen. Chris Elliott, R-Josephine, (left) speaks with Sen. Vivian Davis Figures, D-Mobile (right) on the floor of the Alabama Senate on Feb. 10, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate Tuesday app..."
    },
    {
      "title": "All Democratic governors bow out of White House dinner after Trump snubs several",
      "link": "https://alabamareflector.com/2026/02/11/repub/all-democratic-governors-bow-out-of-white-house-dinner-after-trump-snubs-several/",
      "thumbnail": "",
      "description": "Maryland Gov. Wes Moore, a Democrat, said President Donald Trump \"uninvited\" him from a National Governors Association black-tie dinner at the White House planned during the group's annual meeting Feb. 19-21, 2026. (Phot..."
    },
    {
      "title": "Alabama Senate approves bill requiring breast cancer screening coverage for women over 40",
      "link": "https://alabamareflector.com/briefs/alabama-senate-approves-bill-requiring-breast-cancer-screening-coverage-for-women-over-40/",
      "thumbnail": "",
      "description": "Sen. Linda Coleman-Madison, D-Birmingham, speaks with a colleague on the floor of the Alabama Senate on Feb. 10, 2026 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector) The Alabama Senate p..."
    },
    {
      "title": "Alabama House approves bill allowing nurses, PAs to approve K-12 athletic physicals",
      "link": "https://alabamareflector.com/briefs/alabama-house-approves-bill-allowing-nurses-pas-to-approve-k-12-athletic-physicals/",
      "thumbnail": "",
      "description": "Rep. Ed Oliver, R-Dadeville, introduces a bill on unemployment compensation in the Alabama House of Representatives on Feb. 11, 2025 at the Alabama Statehouse in Montgomery, Alabama. (Brian Lyman/Alabama Reflector)The Al..."
    },
    {
      "title": "In rebuke of Trump, US House opens the door to votes against tariffs",
      "link": "https://alabamareflector.com/2026/02/11/repub/in-rebuke-of-trump-us-house-opens-the-door-to-votes-against-tariffs/",
      "thumbnail": "",
      "description": "The U.S. Capitol as seen from New Jersey Avenue SE on Jan. 6, 2025. &nbsp;(Photo by Ashley Murray/States Newsroom)WASHINGTON — A handful of House Republicans tanked a procedural vote Tuesday night that would have kept in..."
    },
    {
      "title": "Republicans on US House Homeland panel defend immigration tactics at tense hearing",
      "link": "https://alabamareflector.com/2026/02/10/repub/republicans-on-us-house-homeland-panel-defend-immigration-tactics-at-tense-hearing/",
      "thumbnail": "",
      "description": "Pictures of Alex Pretti sit in front of his Minneapolis home on Jan. 26, 2026. Pretti, an ICU nurse, died Jan. 25, after being shot multiple times during a brief altercation with Border Patrol agents in south Minneapolis..."
    },
    {
      "title": "Alabama House OKs bill giving tax credits to farmers for donating to foodbanks",
      "link": "https://alabamareflector.com/briefs/alabama-house-oks-bill-giving-tax-credits-to-farmers-for-donating-to-foodbanks/",
      "thumbnail": "",
      "description": "Rep. Ben Robbins, R-Sylacauga (left) speaks with Rep. Ginny Shaver, R-Leesburg, on Jan. 15, 2026 in the Alabama House of Representatives. (Anna Barrett/Alabama Reflector)The Alabama House of Representatives Tuesday passe..."
    },
    {
      "title": "House committee approves bill that would end elections of Public Service Commission members",
      "link": "https://alabamareflector.com/2026/02/10/house-committee-approves-bill-that-would-end-elections-of-public-service-commission-members/",
      "thumbnail": "",
      "description": "Rep. Chip Brown, R-Hollinger's Island, speaks with colleagues on the floor of the Alabama House of Representatives on Jan. 22, 2026 at the Alabama Statehouse in Montgomery, Alabama. An Alabama House committee Tuesday pas..."
    },
    {
      "title": "Mayors ignore, flatter or confront Trump to serve their cities",
      "link": "https://alabamareflector.com/2026/02/10/repub/mayors-ignore-flatter-or-confront-trump-to-serve-their-cities/",
      "thumbnail": "",
      "description": "Minneapolis Mayor Jacob Frey speaks at a news conference in December about the Trump administration's plans for immigration enforcement in the city. Frey encouraged other mayors last month to stand up to President Donald..."
    },
    {
      "title": "Bill that could weaken Alabama’s environmental regulations speeds through Legislature",
      "link": "https://alabamareflector.com/2026/02/10/bill-that-could-weaken-alabamas-environmental-regulations-speeds-through-legislature/",
      "thumbnail": "",
      "description": "Sen. Donnie Chesteen, R-Geneva, stands on the floor of the Alabama Senate on Jan. 22, 2026 at the Alabama Statehouse in Montgomery, Alabama. Chesteen said in an interview that Thursday's uncommon House Agriculture and Fo..."
    }
  ],
  "lastUpdated": "2026-02-11T15:30:45.187Z"
}