{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "How delays and bankruptcy let a nursing home chain avoid paying settlements for injuries and deaths",
      "link": "https://alabamareflector.com/2026/01/04/how-delays-and-bankruptcy-let-a-nursing-home-chain-avoid-paying-settlements-for-injuries-and-deaths/",
      "thumbnail": "",
      "description": "Genesis HealthCare reached a $650,000 settlement with Nellie Betancourt’s widower, Gabe Betancourt, and their daughter, Vanessa, in April after medical examiners said an injury Nellie sustained at a Genesis home in New M..."
    },
    {
      "title": "Trump says US ‘will run’ Venezuela during transition after capture of President Maduro",
      "link": "https://alabamareflector.com/2026/01/03/repub/trump-says-us-has-captured-venezuelan-president-maduro-in-large-scale-strike-trial-planned-in-ny/",
      "thumbnail": "",
      "description": "Smoke is seen over buildings after explosions and low-flying aircraft were heard on Jan. 3, 2026 in Caracas, Venezuela. According to some reports, explosions were heard in Caracas and other cities near airports and milit..."
    },
    {
      "title": "EPA, state lawmakers could consider regulating abortion pills as pollutants in 2026",
      "link": "https://alabamareflector.com/2026/01/03/repub/epa-state-lawmakers-could-consider-regulating-abortion-pills-as-pollutants-in-2026/",
      "thumbnail": "",
      "description": "State and federal proposals to regulate and restrict medication abortion are expected to continue in 2026 as abortion opponents claim, without strong evidence, that abortion medication is dangerous to patients and the en..."
    },
    {
      "title": "California is banning masks for federal agents. Here’s why it could lose in court.",
      "link": "https://alabamareflector.com/2026/01/02/repub/california-is-banning-masks-for-federal-agents-heres-why-it-could-lose-in-court/",
      "thumbnail": "",
      "description": "Neighbors confront Immigration and Customs Enforcement’s Special Response Team officers following an immigration raid at the Italian restaurant Buono Forchetta in San Diego on May 30, 2025. (Photo courtesy of Pedro Rios)..."
    },
    {
      "title": "Trump gives up on National Guard deployment in 3 cities",
      "link": "https://alabamareflector.com/2026/01/02/repub/trump-gives-up-on-national-guard-deployment-in-3-cities/",
      "thumbnail": "",
      "description": "California National Guard members stand guard at an entrance to the Wilshire Federal Building on June 13, 2025, in Los Angeles, California. (Photo by Mario Tama/Getty Images)WASHINGTON — President Donald Trump announced ..."
    },
    {
      "title": "Report: Reducing size of fines and fees increases likelihood of collecting them",
      "link": "https://alabamareflector.com/2026/01/02/report-reducing-size-of-fines-and-fees-increases-likelihood-of-collecting-them/",
      "thumbnail": "",
      "description": "Northport residents sand in line to enter the courtroom at the Northport Public Safety Building in Northport, Ala., on Wednesday, Aug. 30, 2023. A recent report found that with many fines and fees borne by poor people, a..."
    },
    {
      "title": "Alabama senator exploring new funding option for higher education institutions",
      "link": "https://alabamareflector.com/2026/01/01/alabama-senator-exploring-new-funding-option-for-higher-education-institutions/",
      "thumbnail": "",
      "description": "Senate Finance and Taxation Education committee Chair Arthur Orr, R-Decatur leads the committee's meeting on April 9, 2025 in Montgomery, Ala. Orr is exploring a new funding model for higher education. (Alander Rocha/Ala..."
    },
    {
      "title": "Civil rights and immigrant advocacy groups seek records on immigrant detention in Alabama",
      "link": "https://alabamareflector.com/2025/12/31/civil-rights-and-immigrant-advocacy-groups-seek-records-on-immigrant-detention-in-alabama/",
      "thumbnail": "",
      "description": "Gina Martinez holds a photograph of her daughter Giovanna Hernandez Martinez after Mass on Sunday, August 10, 2025. Civil rights and immigrant advocacy groups have filed open records requests with law enforcement agencie..."
    },
    {
      "title": "Alaska, Montana, Oklahoma crack top five in first rural hospital funding allocation",
      "link": "https://alabamareflector.com/2025/12/30/repub/alaska-montana-oklahoma-crack-top-five-in-first-rural-hospital-funding-allocation/",
      "thumbnail": "",
      "description": "A vacant hallway at Vaughan Regional Medical Center in Selma, Alabama, on Tuesday, Sep. 3, 2024 in Selma, Alabama. (Will McLelland for Alabama Reflector)WASHINGTON — President Donald Trump’s administration unveiled Monda..."
    },
    {
      "title": "Even after parole, some Alabamians can remain on supervision for the rest of their lives",
      "link": "https://alabamareflector.com/2025/12/30/even-after-parole-some-alabamians-can-remain-on-supervision-for-the-rest-of-their-lives/",
      "thumbnail": "",
      "description": "An inmate in the custody of the Department of Corrections. A new report highlights the challenges facing 1,200 Alabamians paroled after being sentenced to life in prison. Some of those who have been released and led prod..."
    }
  ],
  "lastUpdated": "2026-01-05T07:46:40.967Z"
}