{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "APLS to continue withholding Fairhope Library funds over ‘Handmaid’s Tale,’ other books",
      "link": "https://alabamareflector.com/2026/01/16/apls-to-continue-withholding-fairhope-library-funds-over-handmaids-tale-other-books/",
      "thumbnail": "",
      "description": "John Wahl, chair of the Alabama Public Library Service and the Alabama Republican Party speaks to attendees of a meeting on Jan. 15 2026. The APLS Board voted to continue denying state funds to Fairhope Public Library an..."
    },
    {
      "title": "Alabama House passes post-election audit bill",
      "link": "https://alabamareflector.com/2026/01/16/alabama-house-passes-post-election-audit-bill/",
      "thumbnail": "",
      "description": "Rep. Joe Lovvorn, R-Auburn, standing on the floor of the Alabama House of Representatives on Jan. 15, 2026, in Montgomery, Alabama. (Anna Barrett/Alabama Reflector)The Alabama House of Representatives Thursday passed a b..."
    },
    {
      "title": "Alabama Department of Corrections settles suit claiming neglect led to partial foot amputation",
      "link": "https://alabamareflector.com/2026/01/16/alabama-department-of-corrections-settles-suit-claiming-neglect-led-to-partial-foot-amputation/",
      "thumbnail": "",
      "description": "A prison dorm at Holman Correctional Facility on Oct. 23, 2019. The Alabama Department of Corrections has settled a lawsuit that alleged staff neglect led to a incarcerated person's feet being partially amputated. (File)..."
    },
    {
      "title": "In the car with the Minneapolis community patrols working to disrupt ICE operations",
      "link": "https://alabamareflector.com/2026/01/15/repub/in-the-car-with-the-minneapolis-community-patrols-working-to-disrupt-ice-operations/",
      "thumbnail": "",
      "description": "Three cars filled with federal agents stop in front of Elle Neubauer and another observer, surrounding the car and threatening arrest during an early morning watch observing ICE in South Minneapolis Monday, Jan. 12, 2026..."
    },
    {
      "title": "US Senate Dems launch midterm affordability push with focus on housing costs",
      "link": "https://alabamareflector.com/2026/01/15/repub/us-senate-dems-launch-midterm-affordability-push-with-focus-on-housing-costs/",
      "thumbnail": "",
      "description": "An aerial view of residential housing under construction at a planned community in Fontana, California, on Sept. 17, 2025. (Photo by Mario Tama/Getty Images)WASHINGTON — U.S. Senate Democrats began detailing their afford..."
    },
    {
      "title": "Court considers end to legal protection for nearly 1 million immigrants from Haiti, Venezuela",
      "link": "https://alabamareflector.com/2026/01/15/repub/court-considers-end-to-legal-protection-for-nearly-1-million-immigrants-from-haiti-venezuela/",
      "thumbnail": "",
      "description": "Department of Homeland Security Secretary Kristi Noem at a Nashville press conference on July 18, 2025, to discuss arrests of immigrants during recent Immigration and Customs Enforcement sweeps. (Photo by John Partipilo/..."
    },
    {
      "title": "Alabama House passes bill to make Imagination Library Program funding permanent",
      "link": "https://alabamareflector.com/2026/01/15/alabama-house-passes-bill-to-make-imagination-library-program-permanent/",
      "thumbnail": "",
      "description": "Reps. Terri Collins, R-Decatur (left) and Steve Clouse, R-Ozark (right) speak on the floor of the Alabama House of Representatives on Jan. 13, 2026. The House on Thursday approved a bill from Collins establishing state f..."
    },
    {
      "title": "Alabama Senate votes to repeal controversial Smith Lake annexation in Cullman",
      "link": "https://alabamareflector.com/2026/01/15/alabama-senate-votes-to-repeal-controversial-smith-lake-annexation-in-cullman/",
      "thumbnail": "",
      "description": "Senate President Pro Tem Garlan Gudger, R-Cullman, listens to a legislative staffer read a resolution on the floor of the Alabama Senate on Jan. 14, 2026 at the Alabama Statehouse in Montgomery, Alabama. The Senate repea..."
    },
    {
      "title": "War powers resolution fails in US Senate after 2 Republicans flip, Vance breaks tie",
      "link": "https://alabamareflector.com/2026/01/15/repub/war-powers-resolution-fails-in-us-senate-after-2-republicans-flip-vance-breaks-tie/",
      "thumbnail": "",
      "description": "U.S. Sen. Josh Hawley, R-Mo., talks to reporters at the U.S. Capitol on Saturday, June 28, 2025. (Photo by Ashley Murray/States Newsroom)WASHINGTON — Vice President JD Vance broke a tied Senate vote to block advancement ..."
    },
    {
      "title": "Trump threatens to use Insurrection Act and deploy military in Minnesota",
      "link": "https://alabamareflector.com/2026/01/15/repub/trump-threatens-to-use-insurrection-act-and-deploy-military-in-minnesota/",
      "thumbnail": "",
      "description": "Residents confront federal agents following a shooting incident on Jan. 14, 2026 in Minneapolis, Minnesota. &nbsp;(Photo by Scott Olson/Getty Images)WASHINGTON — President Donald Trump threatened on Thursday morning to s..."
    }
  ],
  "lastUpdated": "2026-01-16T13:53:14.909Z"
}