{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Kristin Nelson wins House District 38 special election in Chambers, Lee counties",
      "link": "https://alabamareflector.com/2026/02/03/kristin-nelson-wins-house-district-38-special-election-in-chambers-lee-counties/",
      "thumbnail": "",
      "description": "Republican voters in Chambers and Lee counties chose Kristin Nelson as their nominee in the House District 38 special election. Nelson will face Democratic candidate Hazel Floyd on Feb. 3. (photo courtesy of candidate)Ch..."
    },
    {
      "title": "Trump doubles down on calling for the feds to take over state elections",
      "link": "https://alabamareflector.com/2026/02/03/repub/trump-doubles-down-on-calling-for-the-feds-to-take-over-state-elections/",
      "thumbnail": "",
      "description": "President Donald Trump gives a speech at the World Economic Forum on Jan. 21, 2026 in Davos, Switzerland. (Photo by Chip Somodevilla/Getty Images)President Donald Trump restated a call Tuesday for federal control over el..."
    },
    {
      "title": "US House Democrats call for Kristi Noem’s firing in rally outside ICE headquarters",
      "link": "https://alabamareflector.com/2026/02/03/repub/us-house-democrats-call-for-kristi-noems-firing-in-rally-outside-ice-headquarters/",
      "thumbnail": "",
      "description": "Rep. Delia Ramirez, D-Ill., a member of the U.S. House Subcommittee on Border Security and Enforcement and of the Congressional Hispanic Caucus, speaks outside of U.S. Immigration and Customs Enforcement headquarters in ..."
    },
    {
      "title": "Bill extending death penalty to child sexual assault passes Alabama Senate committee",
      "link": "https://alabamareflector.com/2026/02/03/bill-extending-death-penalty-to-child-sexual-assault-passes-alabama-senate-committee/",
      "thumbnail": "",
      "description": "Sen. April Weaver, R-Alabaster, walks to her seat in the Alabama Senate on May 1, 2025 at the Alabama Statehouse in Montgomery, Alabama. The Senate Judiciary Committee Tuesday approved a bill that would allow prosecutors..."
    },
    {
      "title": "Trump signs funding bill, setting up immigration enforcement debate",
      "link": "https://alabamareflector.com/2026/02/03/repub/us-house-sends-funding-bill-to-trump-setting-up-immigration-enforcement-debate/",
      "thumbnail": "",
      "description": "President Donald Trump signs a government funding bill in the Oval Office of the White House on Feb. 3, 2026. (Photo by Alex Wong/Getty Images)WASHINGTON — The partial government shutdown that began this weekend ended Tu..."
    },
    {
      "title": "Rep. Matt Simpson taken ill",
      "link": "https://alabamareflector.com/briefs/rep-matt-simpson-taken-to-hospital/",
      "thumbnail": "",
      "description": "Rep. Matt Simpson, R-Daphne, speaks on the floor of the Alabama House of Representatives on Jan. 27, 2026 at the Alabama Statehouse in Montgomery, Alabama. Simpson was taken to a hospital for an unspecified illness after..."
    },
    {
      "title": "As school cellphone bans gain in popularity, lawmakers say it’s time to go bell-to-bell",
      "link": "https://alabamareflector.com/2026/02/03/repub/as-school-cellphone-bans-gain-in-popularity-lawmakers-say-its-time-to-go-bell-to-bell/",
      "thumbnail": "",
      "description": "Students at a public charter science academy sit at their desks during English class in Warr Acres, Okla., in August 2025. More states are considering joining Oklahoma in legislating strict bell-to-bell cellphone bans. (..."
    },
    {
      "title": "Alabama Legislature hears education budget proposals",
      "link": "https://alabamareflector.com/2026/02/03/alabama-legislature-hears-education-budget-proposals/",
      "thumbnail": "",
      "description": "House Ways and Means Education Committee Chair Danny Garrett, R-Trussville, asks a question as Senate Finance and Taxation Education Committee Chair Arthur Orr, R-Decatur, listens during a budget presentation to lawmaker..."
    },
    {
      "title": "Temporary legal status allowed for now for 350,000 Haitians as judge blasts Kristi Noem",
      "link": "https://alabamareflector.com/2026/02/03/repub/temporary-legal-status-allowed-for-now-for-350000-haitians-as-judge-blasts-kristi-noem/",
      "thumbnail": "",
      "description": "Pedestrians walk through the streets of the Little Haiti neighborhood on June 06, 2025 in Miami, Florida. (Photo by Joe Raedle/Getty Images)WASHINGTON — A federal judge late Monday blocked the termination of temporary pr..."
    },
    {
      "title": "The case for a standalone UA School of Social Work",
      "link": "https://alabamareflector.com/2026/02/03/the-case-for-a-standalone-ua-school-of-social-work/",
      "thumbnail": "",
      "description": "The Denny Chimes on the campus of the University of Alabama in Tuscaloosa, Alabama on Thursday, July 18, 2024. The Alabama House of Representatives last week passed a bill that would repeal a 1965 requiring the Universit..."
    }
  ],
  "lastUpdated": "2026-02-04T09:35:53.289Z"
}