{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Worried about surveillance, states enact privacy laws and restrict license plate readers",
      "link": "https://alabamareflector.com/2026/01/08/repub/worried-about-surveillance-states-enact-privacy-laws-and-restrict-license-plate-readers/",
      "thumbnail": "",
      "description": "A police officer uses the Flock Safety license plate reader system. Many left-leaning states and cities are trying to protect their residents’ personal information amid the Trump administration's immigration crackdown, b..."
    },
    {
      "title": "Feds ousts Minnesota investigators from ICE shooting probe",
      "link": "https://alabamareflector.com/2026/01/08/repub/fbi-ousts-minnesota-investigators-from-ice-shooting-probe/",
      "thumbnail": "",
      "description": "People laid candles and flowers at the spot where Renee Good's car stopped after she was fatally shot by an ICE officer, Wednesday, Jan. 7, 2025, in Minneapolis. (Photo by Nicole Neri/Minnesota Reformer)The Trump adminis..."
    },
    {
      "title": "US Senate with GOP support advances war powers resolution rebuking Trump on Venezuela",
      "link": "https://alabamareflector.com/2026/01/08/repub/us-senate-with-gop-support-advances-war-powers-resolution-rebuking-trump-on-venezuela/",
      "thumbnail": "",
      "description": "U.S. Sen. Rand Paul, R-Ky., speaks to reporters alongside U.S. Sen. Tim Kaine, D-Va., &nbsp;during a pen and pad meeting with reporters at the U.S. Capitol on Jan. 7, 2026 in Washington, DC. (Photo by Anna Moneymaker/Get..."
    },
    {
      "title": "Walz orders MN National Guard to prepare for possible deployment following ICE killing",
      "link": "https://alabamareflector.com/2026/01/08/repub/walz-orders-mn-national-guard-to-prepare-for-possible-deployment-following-ice-killing/",
      "thumbnail": "",
      "description": "Gov. Tim Walz speaks at the State Emergency Operations Center in Blaine, MN after a woman is killed by a U.S. Immigration and Customs Enforcement officer in Minneapolis on Wednesday Jan. 7, 2025. (Photo by Alyssa Chen/Mi..."
    },
    {
      "title": "ADPH investigating possible flu connection in two pediatric deaths",
      "link": "https://alabamareflector.com/2026/01/08/alabama-department-of-public-health-investigating-two-pediatric-deaths-for-flu-cause/",
      "thumbnail": "",
      "description": "A person holding vials of flu and Covid-19 vaccine. Alabama district health officer Dr. Wes Stubblefield said in an interview that the department is investigating two pediatric deaths in relation to influenza. (File)The ..."
    },
    {
      "title": "Alabama Democratic congressional candidates say they’re optimistic for 2026",
      "link": "https://alabamareflector.com/2026/01/08/democratic-congressional-candidates-say-theyre-optimistic-for-2026/",
      "thumbnail": "",
      "description": "U.S. Democratic congressional candidates Mark Wheeler, Dakarai Larriett, Keith Pilkington, Amanda Pusczek, Andrew Sneed, Lee McInnis and Clyde Jones stand behind Tabitha Isner, vice-chair of the Alabama Democratic Party ..."
    },
    {
      "title": "Alabama veterans board to push for financial benefit bills for veterans",
      "link": "https://alabamareflector.com/2026/01/08/alabama-vets-board-to-push-for-financial-benefit-bills-for-veterans/",
      "thumbnail": "",
      "description": "The rotunda of the Alabama State Capitol, as seen on Nov. 14, 2025 in Montgomery, Alabama. A subcommittee of the State Board of Veterans Affairs Wednesday endorsed legislation that would extend financial benefits to vete..."
    },
    {
      "title": "Rubio to meet with Danish officials amid Greenland push by Trump administration",
      "link": "https://alabamareflector.com/2026/01/07/repub/rubio-to-meet-with-danish-officials-amid-greenland-push-by-trump-administration/",
      "thumbnail": "",
      "description": "Senate Minority Leader Chuck Schumer, D-N.Y., speaks with Secretary of State Marco Rubio as Defense Secretary Pete Hegseth stands to the side in the U.S. Senate basement following a classified briefing on President Donal..."
    },
    {
      "title": "Dems demand investigation of fatal Minneapolis ICE shooting as Trump claims self-defense",
      "link": "https://alabamareflector.com/2026/01/07/repub/dems-demand-investigation-of-fatal-minneapolis-ice-shooting-as-trump-claims-self-defense/",
      "thumbnail": "",
      "description": "People gather around the south Minneapolis site where a U.S. Immigration and Customs Enforcement officer fatally shot a woman on Wednesday, Jan. 7, 2026. (Photo by Nicole Neri/Minnesota Reformer)WASHINGTON — President Do..."
    },
    {
      "title": "ICE officer fatally shoots driver through car window in Minneapolis",
      "link": "https://alabamareflector.com/2026/01/07/repub/ice-officer-fatally-shoots-driver-through-car-window-in-minneapolis/",
      "thumbnail": "",
      "description": "The crashed SUV after an ICE agent shot the driver at point-blank range through the window on Wednesday, Jan. 7, 2026. The driver died, according to the Department of Homeland Security. (Photo by Nicole Neri/Minnesota Re..."
    }
  ],
  "lastUpdated": "2026-01-08T20:43:48.498Z"
}