{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "US Education Department civil rights staff returning to work to tackle complaint backlog",
      "link": "https://alabamareflector.com/2025/12/08/repub/us-education-department-civil-rights-staff-returning-to-work-to-tackle-complaint-backlog/",
      "thumbnail": "",
      "description": "The Lyndon Baines Johnson Department of Education Building on Nov. 25, 2024. (Photo by Shauneen Miranda/States Newsroom)WASHINGTON — The U.S. Education Department is bringing back hundreds of employees in its Office for ..."
    },
    {
      "title": "US Supreme Court seems ready to back Trump in case of fired FTC commissioner",
      "link": "https://alabamareflector.com/2025/12/08/repub/us-supreme-court-seems-ready-to-back-trump-in-case-of-fired-ftc-commissioner/",
      "thumbnail": "",
      "description": "Federal Trade Commissioner Rebecca Slaughter participates in a privacy roundtable at CES 2020 at the Las Vegas Convention Center on Jan. 7, 2020 in Las Vegas, Nevada. (Photo by David Becker/Getty Images)WASHINGTON — The ..."
    },
    {
      "title": "New student loan rule could dissuade people from advanced nursing degrees",
      "link": "https://alabamareflector.com/2025/12/08/repub/new-student-loan-rule-could-dissuade-people-from-advanced-nursing-degrees/",
      "thumbnail": "",
      "description": "Nurse practitioner Carol Biocic treats a Marine Corps veteran at a podiatry clinic for veterans in 2023 in Chicago. New professional student loan caps might make it more difficult for people to pursue advanced nursing de..."
    },
    {
      "title": "Alabama trails some national vaccination rates amid misinformation, access struggles",
      "link": "https://alabamareflector.com/2025/12/08/alabama-sees-lower-vaccination-rates-amid-policy-debates-and-rising-hesitancy/",
      "thumbnail": "",
      "description": "A child gets an MMR vaccine at a clinic put on by Lubbock Public Health Department in Lubbock, Texas, in March. Alabama trails the nation in uptake of some vaccines, which experts say is a combination of misinformation o..."
    },
    {
      "title": "From cowardice to connivance at the University of Alabama",
      "link": "https://alabamareflector.com/2025/12/08/from-cowardice-to-connivance-at-the-university-of-alabama/",
      "thumbnail": "",
      "description": "Denny Chimes at the University of Alabama as seen on Nov. 20, 2025, in Tuscaloosa, Alabama. (Anna Barrett/Alabama Reflector)Back in 1997, a group of students formed an organization for gay and lesbian undergraduates at F..."
    },
    {
      "title": "Alabama representative plans bill to protect professional degree classifications",
      "link": "https://alabamareflector.com/2025/12/08/alabama-representative-plans-bill-protect-professional-degree-classifications/",
      "thumbnail": "",
      "description": "Rep. Napoleon Bracy, D-Saraland, speaks during a debate in the Alabama House of Representatives on Feb. 12, 2025 at the Alabama Statehouse in Montgomery, Alabama. Bracy is planning to introduce a bill to protect professi..."
    },
    {
      "title": "Privacy concerns linger in reproductive health care despite HIPAA lawsuit’s dismissal",
      "link": "https://alabamareflector.com/2025/12/07/repub/privacy-concerns-linger-in-reproductive-health-care-despite-hipaa-lawsuits-dismissal/",
      "thumbnail": "",
      "description": "A Biden-era protection for reproductive and gender affirming health care information was upended by a federal judge in Texas in June. Despite several lawsuits, key privacy rules for medical records remain, but some exper..."
    },
    {
      "title": "Dozens of cities, states hiking minimum wages in 2026 amid federal inaction",
      "link": "https://alabamareflector.com/2025/12/06/repub/dozens-of-cities-states-hiking-minimum-wages-in-2026-amid-federal-inaction/",
      "thumbnail": "",
      "description": "A server waits on customers at a café. The minimum hourly wage for workers will increase in dozens of cities, counties and states in January. (Photo by Scott Olson/Getty Images)The minimum wage for workers will increase ..."
    },
    {
      "title": "With homelessness rising, new federal rules could benefit states that take tougher approaches",
      "link": "https://alabamareflector.com/2025/12/05/repub/with-homelessness-rising-new-federal-rules-could-benefit-states-that-take-tougher-approaches/",
      "thumbnail": "",
      "description": "A homeless man sits in his tent in Washington, D.C., this summer. New rules from the U.S. Department of Housing and Urban Development will sharply restrict how $3 billion in homelessness aid will be spent, allowing no mo..."
    },
    {
      "title": "Trump order ending birthright citizenship to be argued at US Supreme Court",
      "link": "https://alabamareflector.com/2025/12/05/repub/trump-order-ending-birthright-citizenship-to-be-argued-at-us-supreme-court/",
      "thumbnail": "",
      "description": "The U.S. Supreme Court on Oct. 9, 2024. (Photo by Jane Norman/States Newsroom)The U.S. Supreme Court said Friday justices will hear a case to decide if President Donald Trump’s order to end birthright citizenship is cons..."
    }
  ],
  "lastUpdated": "2025-12-09T06:21:38.853Z"
}