{
  "status": "ok",
  "feed": {
    "title": "Alabama Reflector",
    "link": "https://alabamareflector.com/",
    "description": "Clarity today for a better tomorrow",
    "image": "https://alabamareflector.com/wp-content/uploads/2023/07/Alabama-Reflector-logo.png"
  },
  "items": [
    {
      "title": "Incarcerated women often don’t have enough period products",
      "link": "https://alabamareflector.com/2025/12/20/repub/incarcerated-women-often-dont-have-enough-period-products/",
      "thumbnail": "",
      "description": "Tampons are provided to people incarcerated in Arkansas state correctional facilities. Nationwide, many people in jails and prisons don’t have access to sufficient period products. (Photo courtesy of the Arkansas Departm..."
    },
    {
      "title": "US House passes bill to remove gray wolf from Endangered Species Act list",
      "link": "https://alabamareflector.com/2025/12/19/repub/us-house-passes-bill-to-remove-gray-wolf-from-endangered-species-act-list/",
      "thumbnail": "",
      "description": "A wolf makes its way across a road in Yellowstone National Park. (Jacob W. Frank/Courtesy of the U.S. National Park Service)The U.S. House on Thursday passed, 211-204, a bill to remove Endangered Species Act protections ..."
    },
    {
      "title": "Department of Justice releases new documents, photos as part of Epstein files",
      "link": "https://alabamareflector.com/2025/12/19/repub/criticism-erupts-after-doj-official-says-some-epstein-files-will-emerge-after-deadline/",
      "thumbnail": "",
      "description": "Former President Bill Clinton, rock star Mick Jagger and the late sex offender Jeffrey Epstein are seated at a table in this undated photo released as part of the Epstein files on Friday, Dec. 19, 2025, by the Department..."
    },
    {
      "title": "Trump administration moves to pause diversity visa program after Brown, MIT shootings",
      "link": "https://alabamareflector.com/2025/12/19/repub/trump-administration-moves-to-pause-diversity-visa-program-after-brown-mit-shootings/",
      "thumbnail": "",
      "description": "Brown University President Christina Paxson speaks to reporters gathered at the Providence Public Safety Complex on Dec. 16, 2025. Gov. Dan McKee, far left, and Providence Mayor Brett Smiley are also pictured. (Photo by ..."
    },
    {
      "title": "Suspected Brown mass shooter found dead in N.H. storage facility; linked to MIT physicist’s killing",
      "link": "https://alabamareflector.com/2025/12/19/repub/suspected-brown-mass-shooter-found-dead-in-n-h-storage-facility-linked-to-mit-physicists-killing/",
      "thumbnail": "",
      "description": "Claudio Manuel Neves Valente, the suspected Brown University shooter, is seen at the Alamo Rent a Car in Boston on Nov. 17, 2025. (Photos from Providence Police affidavit)“We got him.” With those three words from Ted Doc..."
    },
    {
      "title": "ABC Board passes emergency rule on hemp products over opposition from law’s sponsor",
      "link": "https://alabamareflector.com/2025/12/19/abc-board-passes-emergency-rule-on-hemp-products-over-opposition-from-law-sponsor/",
      "thumbnail": "",
      "description": "(Left to right) Randy Dempsey, Melissa Morrissette, Alan Spencer and John Knight discussing an emergency rule establishing the Responsible Consumable Hemp Product Program on Dec. 18, 2025, at the Alabama Alcohol Beverage..."
    },
    {
      "title": "Attorneys for UA System students, professors file appeal in anti-DEI lawsuit",
      "link": "https://alabamareflector.com/2025/12/19/attorneys-for-ua-system-students-professors-file-appeal-in-anti-dei-lawsuit/",
      "thumbnail": "",
      "description": "A sunset over the Denny Chimes on the campus of the University of Alabama in Tuscaloosa, Alabama on Thursday June 20, 2024. A group of students and professors in the University of Alabaa system have appealed a federal co..."
    },
    {
      "title": "Without pennies, should retailers round up or down? States offer their 2 cents.",
      "link": "https://alabamareflector.com/2025/12/19/repub/without-pennies-should-retailers-round-up-or-down-states-offer-their-2-cents/",
      "thumbnail": "",
      "description": "As pennies vanish from the American landscape, states are beginning to weigh in on how retailers should respond. (Photo illustration by Justin Sullivan/Getty Images)As pennies vanish from the American landscape, many bus..."
    },
    {
      "title": "Trump health agency proposes rules to limit gender-affirming care for youth",
      "link": "https://alabamareflector.com/2025/12/18/repub/trump-health-agency-proposes-rules-to-limit-gender-affirming-care-for-youth/",
      "thumbnail": "",
      "description": "Centers for Medicare and Medicaid Services Administrator Dr. Mehmet Oz speaks at the Department of Health and Human Services in Washington, D.C., on Dec. 18, 2025. Oz and other Trump administration officials announced pr..."
    },
    {
      "title": "Trump signs order to loosen federal restrictions on marijuana, but it’s still illegal",
      "link": "https://alabamareflector.com/2025/12/18/repub/trump-signs-order-to-loosen-federal-restrictions-on-marijuana-but-its-still-illegal/",
      "thumbnail": "",
      "description": "A cannabis pre-roll is held at a legalization anniversary party in Cranston, Rhode Island, Dec. 1, 2023. (Photo by Christopher Shea/Rhode Island Current)President Donald Trump signed an executive order Thursday to loosen..."
    }
  ],
  "lastUpdated": "2025-12-20T23:12:18.460Z"
}